{
  "proposals": [
    {
      "bio": "<p>Both Bhaskar and Vivek are Product Management professionals with over 15 years of experience managing leading global products.</p>\n<p>Bhaskar has extensive experience in accounting, enterprise retail, distribution and has a background in software sales and consulting. At Intuit, he manages two core product lines - QuickBooks Pro/Premier and QuickBooks Accountant. Prior to Intuit he has worked with IBM, and Sterling Commerce (now IBM). Bhaskar is an engineer with a MBA from IIM Ahmedabad.</p>\n<p>Vivek comes largely from the startup world, he has co-founded/worked for 6 early stage startups in the Valley focused on wireless and consumer facing software. At Intuit, Vivek manages the TurboTax product line and runs discovery teams focused on finding new ways to disrupting Intuit’s existing businesses. He is an engineer with an MBA from Columbia University in New York.</p>",
      "comments": 0,
      "confirmed": true,
      "description": "<p>Designing a new product can be quite the daunting challenge. We’ll take an in-depth look in designing a new mobile product using a very customer centric methodology that we call Design for Delight. We’ll walk you through techniques we use to get delight and innovation, starting with understanding the customer, their motivations, testing ideas, experimentation and failing fast.</p>",
      "fullname": "Vivek Raghavan",
      "id": 1676,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1348-design-for-delight/json",
      "level": "Beginner",
      "links": "",
      "name": "1348-design-for-delight",
      "objective": "<p>To outline a customer driven methodology to innovate and delight the customer.</p>",
      "proposer": "Vivek Raghavan (~vivekraghavan)",
      "requirements": "",
      "section": "Application Design – full talk",
      "slides": "",
      "speaker": "Vivek Raghavan (~vivekraghavan)",
      "submitted": "2015-04-02T02:57:20.771888Z",
      "title": "Design for Delight",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1348-design-for-delight",
      "votes": 1
    },
    {
      "bio": "<p>Amar is the director of Mobile Engineering @Flipkart. He is passionate about building great products and teams. He believes in a design philosophy that prefers &ldquo;People over Pixels&rdquo;. He works with lot of startups, mentoring them in technology and effective team building. </p>",
      "comments": 0,
      "confirmed": true,
      "description": "<p>See above.</p>",
      "fullname": "Rudi MK",
      "id": 1666,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1347-we-dont-hate-the-web/json",
      "level": "Intermediate",
      "links": "",
      "name": "1347-we-dont-hate-the-web",
      "objective": "<p>This talk is mainly to walk the w3 community through Flipkart&rsquo;s thought process on some of the recent decisions Flipkart took related to web. Also, we will be taking them through where we think mobile will be headed and how browser based technologies are going to play much significant role than ever. </p>",
      "proposer": "Rudi MK (~rudimk)",
      "requirements": "",
      "section": "Application Design – full talk",
      "slides": "",
      "speaker": null,
      "submitted": "2015-03-31T04:46:31.609214Z",
      "title": "We don't hate the web",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1347-we-dont-hate-the-web",
      "votes": 3
    },
    {
      "bio": "<p>Wishy co-manages the mobile product portfolio at Cleartrip, and is the product owner for the Cleartrip iOS and Windows Phone apps and mobile web. He has over eight years of experience in tech product management and marketing, in both B2B and B2C contexts. Prior to Cleartrip, he was heading the global product marketing function at Subex. He holds an MBA from IIM Lucknow, and a BE in Computer Engineering from Pune University. He blogs occassionaly at www.3rdkosha.com.</p>",
      "comments": 0,
      "confirmed": true,
      "description": "<ul>\n<li>Why mobile web still matters for Cleartrip - traffic patterns, user behaviour, conversion</li>\n<li>Behaviour differences between mobile web, apps and desktop</li>\n<li>Using mobile web for customer acquisition</li>\n<li>Mobile web as a testing ground for new features </li>\n<li>The future of mobile web </li>\n</ul>",
      "fullname": "Rudi MK",
      "id": 1664,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1346-mobile-web-in-an-app-world/json",
      "level": "Intermediate",
      "links": "",
      "name": "1346-mobile-web-in-an-app-world",
      "objective": "<p>Learn about Cleartrip&rsquo;s experiences building for the mobile web.</p>",
      "proposer": "Rudi MK (~rudimk)",
      "requirements": "",
      "section": "Application Design – full talk",
      "slides": "",
      "speaker": null,
      "submitted": "2015-03-30T09:29:59.417200Z",
      "title": "Mobile web in an app world",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1346-mobile-web-in-an-app-world",
      "votes": 2
    },
    {
      "bio": "<p>Saptarshi is currently working as technical Lead in Mckinsey Digital Lab. 6+ Years of experience in frontEnd technologies , mobile application and Full Stack development . Multiple nation-wide hackathon winner, npm Author, speaker and a geek . Before joining Mckinsey , Saptarshi worked with LinkedIn as a software Engineer.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>1) Discuss the basics of npm and yeoman . How to create a npm module quickly and publish it .<br>\n2) Discuss the basics and algorithm of how you can generate customized test suit for your angularJs Application.<br>\n3) Fundamentals and working principle of generator-yosapy (https://www.npmjs.com/package/generator-yosapy)<br>\nGenerates Jasmine test for your angularJs file, Most of these auto generated custom test cases will actually be passing and it will take file’s code coverage from 0% to 40%-50% without writing a single line of code, ain&rsquo;t that freaking awesome!!!</p>",
      "fullname": "saptarshi chatterjee",
      "id": 1648,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1345-auto-generate-customized-test-suit-for-your-javasc/json",
      "level": "Advanced",
      "links": "",
      "name": "1345-auto-generate-customized-test-suit-for-your-javasc",
      "objective": "<p>1) Will be able to create a basic npm module in 5 minute.<br>\n2) Will get insignts on Javascript code coverage , fundamental and tooling<br>\n3) Will learn JavaScript automation and code generation using yeoman.  </p>",
      "proposer": "saptarshi chatterjee (~sapy)",
      "requirements": "<p>Laptop with nodeJs installed.</p>",
      "section": "Front-end build processes and tools – full talks",
      "slides": "http://www.slideshare.net/sapta9433/auto-generate-customized-test-suit-for-your-angularjs",
      "speaker": "saptarshi chatterjee (~sapy)",
      "submitted": "2015-03-25T03:47:05.608810Z",
      "title": "Auto generate customized test suit for your JavaScript file",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1345-auto-generate-customized-test-suit-for-your-javasc",
      "votes": 1
    },
    {
      "bio": "<p>I&rsquo;m a co-founder and the chief hacker at Scrollback, a startup that hosts online meeting places for communities. My first JavaScript code was hosted on GeoCities and targeted IE4. I&rsquo;ve spoken at JSFoo in 2014 and 2011 and a couple of times at Bangalore JS.</p>\n<p>Scrollback is the fifth startup I&rsquo;ve written code at, and the second that I co-founded.</p>",
      "comments": 1,
      "confirmed": false,
      "description": "<p>The Scrollback web client was recently refactored to use React extensively. One of the key components we built is Endless (github.com/scrollback/endless), a very versatile infinite scroll component.</p>\n<p>This workshop will take participants through building a simple infinite scroll view in React.</p>",
      "fullname": "Aravind Ravi Sulekha",
      "id": 1641,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1344-the-react-way-a-non-trivial-example/json",
      "level": "Advanced",
      "links": "https://github.com/scrollback/endless\r\n",
      "name": "1344-the-react-way-a-non-trivial-example",
      "objective": "<p>Learn to build a complex React component, become familiar with the component lifecycle and gain experience with a broad range of component APIs.</p>",
      "proposer": "Aravind Ravi Sulekha (~aravindet)",
      "requirements": "<p>Familiarity with writing front-end JS, and maybe having read an article or two about React. Experience buiding stuff in React is not required.</p>",
      "section": "Workshops",
      "slides": "",
      "speaker": "Aravind Ravi Sulekha (~aravindet)",
      "submitted": "2015-03-22T16:41:40.134369Z",
      "title": "The React Way: A non-trivial example",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1344-the-react-way-a-non-trivial-example",
      "votes": 13
    },
    {
      "bio": "<p>Shwetank works in the Developer Relations team as well as the Extensions Team at Opera. He is also part of the W3C Mobile Web for Social Development Group and the W3C Web Education Community Group. He promotes open web standards and best practices amongst the developer community at large. Over the years, he has written several articles about web standards and techniques in various publications like .Net Magazine, Dev.Opera, Developer Fusion and more, and has given more than 100 talks in 10 countries. </p>\n<p>He likes browsers, extensions, open web technologies, and Batman.</p>",
      "comments": 0,
      "confirmed": true,
      "description": "<p>Blend Modes have been a common feature in most image editing programs on the desktop platform, but we&rsquo;ve never had them as part of the web platform, until now. Now we have them as part of CSS. This means a potential to really change graphic design on the web by  layering various web elements in novel and interesting ways to produce the designs of the future. </p>\n<p>In this talk, we&rsquo;ll go over everything one needs to know about CSS Blend Modes. We&rsquo;ll look at the algorithms of a few notable blend modes to illustrate what goes on behind the scenes, as well as see how they work with the stacking contexts in a web page. We&rsquo;ll also take a look at what other web page elements apart from images can be used with blend modes (you&rsquo;d be surprised) as well as best practices for maximum cross-browser compatibility. In the end, we&rsquo;ll talk about the future of this specification and how it can effect the future of web design. </p>",
      "fullname": "Shwetank Dixit",
      "id": 1636,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1343-a-deep-dive-into-css-blend-modes/json",
      "level": "Advanced",
      "links": "",
      "name": "1343-a-deep-dive-into-css-blend-modes",
      "objective": "<p>To give the audience an idea of what CSS Blend Modes are, give them deep knowledge of how they work (right down to the algorithmic level), and inspire them to take their designs on the web to the next level using this technology.</p>",
      "proposer": "Shwetank Dixit (~shwetank)",
      "requirements": "<p>Moderate proficiency in CSS. Basic mathematics. </p>",
      "section": "Application Design – full talk",
      "slides": "",
      "speaker": "Shwetank Dixit (~shwetank)",
      "submitted": "2015-03-18T07:29:46.525308Z",
      "title": "A Deep Dive into CSS Blend Modes",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1343-a-deep-dive-into-css-blend-modes",
      "votes": 2
    },
    {
      "bio": "<p>Praveen Singh, Front-End developer at roposo.com. An avid open source enthusiast and javascript lover.</p>\n<p>Ojassvi Chawla, Front-End developer at roposo.com. A javascript enthusiast and explorer on how to build things better.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>Entity or component based websites have a lot of common structure in their pages.<br>\nThrough a well thought out implementation it could be made much easier to build new pages and update the existing ones.</p>\n<p>Road map<br>\nThink Design - How to think in terms of design for card or entity based websites.<br>\nImplementation overview - How to make it work for you.<br>\nMaintenance and upgrade - How to change without breaking.  </p>",
      "fullname": "Praveen Singh",
      "id": 1633,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1342-building-lego-like-frontend-system/json",
      "level": "Intermediate",
      "links": "",
      "name": "1342-building-lego-like-frontend-system",
      "objective": "<p>Design methodology that we used to build components or pages that are easily maintainable and scalable.</p>",
      "proposer": "Praveen Singh (~praveensinghroposo)",
      "requirements": "",
      "section": "Application Design – full talk",
      "slides": "",
      "speaker": "Praveen Singh (~praveensinghroposo)",
      "submitted": "2015-03-16T15:56:31.189273Z",
      "title": "Building LEGO like Frontend System",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1342-building-lego-like-frontend-system",
      "votes": 13
    },
    {
      "bio": "<p>We are Srividya and Ajith- a duo of UX designers from Freshdesk. Srividya has a visual design background and pulls from her experience working at the Google mothership and Ajit whose forte is user research and brings with him learnings and stories from Cisco, HFI and HP Labs. </p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>So you want to build a mobile app but you have no idea where to start. Do you have the right feature set? Are you trying to do too much or even worse…too little? Are you going to “delight” your user? We are a designer duo from Freshdesk on a mission to help you out. At the end of this talk you will walk away with a great toolkit of questions and ways to figure out their answers to help you give your users the best experience on your app. </p>",
      "fullname": "Srividya Sriram & Ajith Sowndararajan",
      "id": 1632,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1341-mobilising-for-mobile/json",
      "level": "Beginner",
      "links": "",
      "name": "1341-mobilising-for-mobile",
      "objective": "<p>A trail of questions and answers that will lead you to eternal ‘app’iness.</p>",
      "proposer": "Srividya Sriram & Ajith Sowndararajan (~srividyasriram)",
      "requirements": "",
      "section": "Application Design – full talk",
      "slides": "",
      "speaker": "Srividya Sriram & Ajith Sowndararajan (~srividyasriram)",
      "submitted": "2015-03-16T15:26:47.254822Z",
      "title": "Mobilising for Mobile",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1341-mobilising-for-mobile",
      "votes": 1
    },
    {
      "bio": "<p>I&rsquo;m Jaseem Abid, currently hacking both UI and backend at Ideadevice. I&rsquo;ve been fiddling with JS for around 4 years and have done the same old story of jQuery to Backbone to every other MVC framework out there. Codes JS and Python for a living. Haskell for everything else.</p>\n<ol>\n<li><a href=\"https://twitter.com/jaseemabid/\">https://twitter.com/jaseemabid/</a>  </li>\n<li><a href=\"https://github.com/jaseemabid\">https://github.com/jaseemabid</a></li>\n</ol>",
      "comments": 0,
      "confirmed": true,
      "description": "<p>This is the story of a four people UI team at Ideadevice moving from a fairly complicated traditional MVC app using YUI to react and flux, the lessons learned, the joys and pains of it. The results are fairly positive and we are excited to share the experience with a wider community.</p>\n<p>One of the most striking facts about Flux is that unlike react, it is a specification rather than a implementation. Multiple implementations of the idea exist and they all differ in some way or the other, leading to much confusion and newcomers tend to get lost in all the details. This talk aims to clarify things a bit and help people understand the ideas.</p>\n<p>Talk will mostly concentrate on the original Flux architecture. This is not a react talk and we will only cover the minimum bits of it required to understand the concepts presented. Prior experience wont be necessary. Structuring large complex applications and testing will also be taken seriously.</p>\n<p>Individual components of the architecture like the dispatcher and stores will be analyzed in detail and how we implemented each of them with minimum 3rd party libraries.</p>\n<p>Eventually we would walk through a simple app, show how the data flows through and how actions propagate.  </p>",
      "fullname": "Jaseem abid",
      "id": 1631,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1340-how-i-learned-to-stop-worrying-and-love-the-flux/json",
      "level": "Advanced",
      "links": "",
      "name": "1340-how-i-learned-to-stop-worrying-and-love-the-flux",
      "objective": "<ol>\n<li>Deep dive into flux, the principles and components  </li>\n<li>Analyze responsibilities of each components and look at a sample implementation  </li>\n<li>Walk through a non trivial example application and understand data flow and actions.  </li>\n<li>Show how to do common tasks like routing, error handling etc in a unidirectional data flow model.  </li>\n<li>Introduce audience to testing UI components and show how cool it is :)</li>\n</ol>",
      "proposer": "Jaseem abid (~jaseemabid)",
      "requirements": "<p>You need to get the joke references ;)</p>\n<p>Prior knowledge with Flux will obviously help. An open mind to learn and unlearn things.</p>",
      "section": "Front-end build processes and tools – full talks",
      "slides": "",
      "speaker": "Jaseem abid (~jaseemabid)",
      "submitted": "2015-03-16T15:18:14.963921Z",
      "title": "How I Learned to Stop Worrying and Love the Flux",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1340-how-i-learned-to-stop-worrying-and-love-the-flux",
      "votes": 25
    },
    {
      "bio": "<p>With around 3 years experience in building multiple web applications &amp; a special place for CSS in heart, I have seen how using preprocessors have improved my CSS writing &amp; management skills.  </p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>When it comes to building Web Apps, writing HTML &amp; CSS is inevitable. And as an application grows big, the CSS becomes unwieldy. That is where giving a programmable logic(till some extent) to CSS can be really helpful.</p>\n<p>We will be taking a look at:<br>\n- Modularization\n- Variables\n- Functions\n- Mixins\n- Nesting\n- DRY \n- Caveats</p>\n<p>We will design a simple web page where all the features of Less preprocessor will be demonstrated. Basically I intend to show that how even CSS can be made programmable :)</p>\n<p>At end of the workshop, you will be comfortable with CSS preprocessors &amp; you might enjoy writing CSS.</p>",
      "fullname": "Jigar Jain",
      "id": 1622,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1339-simplifying-css-using-less/json",
      "level": "Intermediate",
      "links": "My profile - http://jigarjain.com ",
      "name": "1339-simplifying-css-using-less",
      "objective": "<p>Writing scalable &amp; modular CSS using preprocessors (LESS)</p>",
      "proposer": "Jigar Jain (~jigarjain)",
      "requirements": "<p>A laptop with<br>\n- Less installed (http://lesscss.org/#using-less)\n- Simple text editor</p>",
      "section": "Workshops",
      "slides": "",
      "speaker": "Jigar Jain (~jigarjain)",
      "submitted": "2015-03-11T06:59:04.098283Z",
      "title": " Simplifying CSS using {Less}",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1339-simplifying-css-using-less",
      "votes": 0
    },
    {
      "bio": "<p>Sheril has about 8 years of professional experience in IT industry with specialization on User Experience Design &amp; Development. At the age of 17, he started designing websites and hence worked on various projects involving IA, Visual Design, Web Application Development, and Content Management System implementation.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>In this talk, we will present our experience of creating UX in an incremental fashion for a virtual wallet. We will also talk about the different challenges we faced such as, educating various stakeholders on the value of incremental UX, building collaboration between developers and experience designers and abstracting design components, along with the solutions we devised to tackle these challenges.Traditionally, in software development, user experience (UX) wasn&rsquo;t valued as much as developing of the software itself. But this has changed rather radically. However, creating an enriching user experience in an agile fashion is still challenging. Most of the agile engineering practices in use are around building software but seldom address UX. When building a product in an agile fashion, UX in an incremental fashion becomes important.</p>\n<p>In this talk, we will present our experience of creating UX in an incremental fashion for a virtual wallet. We will also talk about the different challenges we faced such as, educating various stakeholders on the value of incremental UX, building collaboration between developers and experience designers and abstracting design components, along with the solutions we devised to tackle these challenges.</p>\n<p>We will focus on the following take-aways:</p>\n<ul>\n<li>Creating initial brand guidelines and setting a high level UX vision for the product in an agile context.</li>\n<li>Creating and maintaining Live Style Guide to help incremental design. We will show samples of our Live Style Guide and how we incrementally built it.</li>\n<li>Maintaining documentation incrementally to assist distributed teams work seamlessly on UX aspects.</li>\n<li>Incremental feature research - Plan for UX research at a feature level (not at the product level) and including this in the iteration/release planning.</li>\n</ul>",
      "fullname": "Sheril Jebasingh",
      "id": 1620,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1338-first-amongst-equals-can-ux-be-there/json",
      "level": "Intermediate",
      "links": "",
      "name": "1338-first-amongst-equals-can-ux-be-there",
      "objective": "<p>Traditionally, in software development, user experience (UX) wasn&rsquo;t valued as much as developing of the software itself. But this has changed rather radically. However, creating an enriching user experience in an agile fashion is still challenging. Most of the agile engineering practices in use are around building software but seldom address UX. When building a product in an agile fashion, UX in an incremental fashion becomes important.  </p>",
      "proposer": "Sheril Jebasingh (~sheril)",
      "requirements": "",
      "section": "Application design – crisp talk",
      "slides": "",
      "speaker": "Sheril Jebasingh (~sheril)",
      "submitted": "2015-03-11T04:16:18.929906Z",
      "title": "First Amongst Equals - Can UX be there?",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1338-first-amongst-equals-can-ux-be-there",
      "votes": 2
    },
    {
      "bio": "<p>Shekhar likes creating products using open source technologies especially Python. Lately flirting with building web UIs with HTML5 Javascript CSS.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<ul>\n<li>Introduction to Splinter: Python Web testing automation tool</li>\n<li>The Gherkin language to describe testing scenarios</li>\n<li>Behave tool for BDD</li>\n<li>Building a quick acceptance testing suite</li>\n</ul>",
      "fullname": "Shekhar Tiwatne",
      "id": 1614,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1337-behavior-driven-development-for-web-app/json",
      "level": "Intermediate",
      "links": "http://pythonhosted.org/behave/philosophy.html",
      "name": "1337-behavior-driven-development-for-web-app",
      "objective": "<p>Share experience of acceptance testing suite that we developed for testing our webapp on mobile and desktop browsers.</p>",
      "proposer": "Shekhar Tiwatne (~shon)",
      "requirements": "",
      "section": "Front-end build processes and tools – crisp talks",
      "slides": "",
      "speaker": "Shekhar Tiwatne (~shon)",
      "submitted": "2015-03-09T18:36:24.985688Z",
      "title": "Behavior-driven development for Web App",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1337-behavior-driven-development-for-web-app",
      "votes": 1
    },
    {
      "bio": "<p>Dron is a Front-End developer, Node JS and Automation Testing team lead at Housing.com. He is also Mozilla Representative and an open-source enthusiasts. He is the swiss knife of the Front End team at Housing and a great person to reach out. Dron has been vividly working upon a lot of cool technologies and challenges them for the best.  </p>",
      "comments": 4,
      "confirmed": true,
      "description": "<p>When someone says “Mobile Web”, we generalise it to media queries, minified code, gzipping and employing other paradigms, and thus we often fall prey to this trap. Neglecting Javascript performance issues on mobile, with less memory having templating, adding a cool MVC framework blindfoldedly just to make ourselves comfortable is a bad attitude. A deep understanding of Javascript engine with a topping of lower level architecture  and how it binds with DOM, where does we often fail, what all things we take for granted that causes a fail for gaining performance and what all we can work upon to gain it back.  </p>",
      "fullname": "Dron Rathore",
      "id": 1612,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1336-i-will-javascript-you/json",
      "level": "Intermediate",
      "links": "https://medium.com/@dron/should-i-call-or-should-i-apply-6650a4352206\r\nhttps://medium.com/@dron/oh-my-timeout-257f1d909e7c\r\nhttps://github.com/DronRathore/eventMan\r\nhttps://github.com/DronRathore\r\nhttps://in.linkedin.com/in/dronrathore",
      "name": "1336-i-will-javascript-you",
      "objective": "<p>To enlighten the community about the importance of writing concise, optimised Javascript code by deeply understanding the JS, lower level design patterns of it, and how it binds with DOM, for Mobile Web given its limitations.</p>",
      "proposer": "Dron Rathore (~dronrathore)",
      "requirements": "<p>A zeal to make Web a better place, Javascript, CSS3, HTML5 that&rsquo;s all it takes.</p>",
      "section": "Performance – full talk",
      "slides": "",
      "speaker": "Dron Rathore (~dronrathore)",
      "submitted": "2015-03-09T17:44:37.699709Z",
      "title": "I Will Javascript You!",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1336-i-will-javascript-you",
      "votes": 14
    },
    {
      "bio": "<p>Vikash is among one of the awesome fleet of our Front End Developers, applying optimisation, new methodology to make our product up &amp; running blazingly. He has a great interest in vivid technological aspects, looking under the hood is one of his passion! Migrating our platform from old front end technologies to new one is purely his job! He is been with Housing.com from past 2 years and is enjoying it everyday.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>With time, mobile’s have changed, and so has the web and indeed we have. With time we have also had a lot iterations and we always gone through the process of learning-unlearning and relearning. But for mobile web we have done a lot of things inside out, be it interms core product or tech stack. Also we use a lot of tools like new-relic, errorception to understand our issues and problems faced by our users. This talk will cater how we do things at housing, with real life examples and problems faced by us.  </p>",
      "fullname": "Vikash Agrawal",
      "id": 1611,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1335-look-up-mobile-web-with-housing-com/json",
      "level": "Intermediate",
      "links": "https://github.com/ivikash\r\nhttps://linkedin.com/in/ivikash\r\nhttp://vikash.io",
      "name": "1335-look-up-mobile-web-with-housing-com",
      "objective": "<p>To help front end developers and startups to learn from our experiences and utilize for their best.</p>",
      "proposer": "Vikash Agrawal (~ivikash)",
      "requirements": "",
      "section": "Front-end build processes and tools – full talks",
      "slides": "",
      "speaker": "Vikash Agrawal (~ivikash)",
      "submitted": "2015-03-09T17:42:53.677745Z",
      "title": "Look Up mobile web with Housing.com",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1335-look-up-mobile-web-with-housing-com",
      "votes": 12
    },
    {
      "bio": "<p>I am a co-founder of <a href=\"http://miranj.in\">Miranj</a>, a web design studio in New Delhi, and have been making websites for a few years now. I am a programmer at heart, who enjoys travelling, music, coffee and food, and has somehow managed to complete a couple of marathons this year.</p>",
      "comments": 0,
      "confirmed": true,
      "description": "<p>The web’s built on an open protocol, and was always meant to be an inclusive network. The requirements for consuming (and contributing to) content on the web are pretty straightforward — a web browser running on any device and an internet connection. </p>\n<p>While we all understand this, our understanding doesn’t necessarily translate into an unbiased effort at crafting experiences on the web. More often than not, the web experience on mobile gets stifled, in turn affecting those whose window to the web are these devices in their pockets.</p>\n<p>This talk will be based around my observation of where the state of web (and the community) is headed.</p>",
      "fullname": "Souvik Das Gupta",
      "id": 1609,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1334-whats-your-web/json",
      "level": "Intermediate",
      "links": "http://www.commitstrip.com/en/2015/03/05/mobile-browsing-in-2015/",
      "name": "1334-whats-your-web",
      "objective": "<p>To break the designer / creator bias towards laptops (and desktops) while designing experiences on the web.</p>",
      "proposer": "Souvik Das Gupta (~souvikdg)",
      "requirements": "",
      "section": "Application Design – full talk",
      "slides": "https://speakerdeck.com/souvikdg/whats-your-web",
      "speaker": "Souvik Das Gupta (~souvikdg)",
      "submitted": "2015-03-09T08:57:27.402838Z",
      "title": "What’s your web?",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1334-whats-your-web",
      "votes": 2
    },
    {
      "bio": "<p>Designer/Developer trying to bridge the gap between how designers and developers collaborate.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>&ldquo;In my experience, designers are better at technical things than they assume they are and engineers are better designers than they think are&rdquo; @murmurs</p>\n<p>The worlds are colliding. Modern tooling is bridging the gap between what a designer can do and what a developer can&rsquo;t. It also brings in a more powerful notion of the role of a prototyper. A prototyper can not only design in traditional applications such as Photoshop/Illustrator to realize the structure and layout of web/mobile applications but also be able to code interactions to conceptualize ideas in a fidelity that mimics the end behavior for the targeted platform(s).</p>\n<p>This workshop aims to provide attendees with a sense of how such a workflow can be constructed using modern tools. We will start with going over Sketch (http://bohemiancoding.com/sketch) which aims to be a replacement to Photoshop/Illustrator, learning how to use it to design for multiple screen sizes, hooking it up to framer.js to provide a environment which enables exploration of interactive/animation patterns and using front-end tools like gulp to enable live editing of both sketch resources and HTML prototypes for a more efficient iteration cycle.</p>",
      "fullname": "Raunaq Gupta",
      "id": 1608,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1333-interaction-prototyping-for-the-modern-fragmented-/json",
      "level": "Beginner",
      "links": "",
      "name": "1333-interaction-prototyping-for-the-modern-fragmented-",
      "objective": "<p>The workshop will introduce a design workflow that provides a seamless approach to designing interactions for the web and mobile applications by augmenting what the role of a traditional designer is usually limited to.</p>",
      "proposer": "Raunaq Gupta (~raunaqgupta)",
      "requirements": "<p>A copy of Sketch (http://bohemiancoding.com/sketch/ which also has a 30 day trial period), basic knowledge of JS, CSS, HTML</p>",
      "section": "Workshops",
      "slides": "",
      "speaker": "Raunaq Gupta (~raunaqgupta)",
      "submitted": "2015-03-09T07:57:00.961915Z",
      "title": "Interaction prototyping for the modern fragmented digital world",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1333-interaction-prototyping-for-the-modern-fragmented-",
      "votes": 4
    },
    {
      "bio": "<p>Harish is VP &amp; Head of design and front end engineering @freecharge, musician @agamlive and an overall nice guy. At times he sees dead pixels.</p>",
      "comments": 0,
      "confirmed": true,
      "description": "<p>I will cover the architecture, design, performance optimizations and UX considerations that went into building this project. Side note - Having an app should not be a reason to kill your mobile web experience. Remember, the way to get people to use your app is not by killing your mobile web app or putting ugly road blocks. Build for the customers and not for your investors.</p>",
      "fullname": "Harish Sivaramakrishnan",
      "id": 1607,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1332-now-that-we-have-an-app-lets-kill-our-mobile-site/json",
      "level": "Intermediate",
      "links": "http://idontwantyourfuckingapp.tumblr.com/",
      "name": "1332-now-that-we-have-an-app-lets-kill-our-mobile-site",
      "objective": "<p>A technical, deep, highly irreverent lowdown on how we went ahead and built a badass mobile web experience for FreeCharge.in, despite the fact that we have apps for all major platforms. </p>",
      "proposer": "Harish Sivaramakrishnan (~harish-io)",
      "requirements": "<p>Working knowledge of Web technologies, appreciation to the fact that building for mobile is painful - but not impossible. </p>",
      "section": "Application Design – full talk",
      "slides": "",
      "speaker": "Harish Sivaramakrishnan (~harish-io)",
      "submitted": "2015-03-09T05:56:15.986968Z",
      "title": "Now that we have an app, Let's kill our mobile site!",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1332-now-that-we-have-an-app-lets-kill-our-mobile-site",
      "votes": 15
    },
    {
      "bio": "<p>My name is Himanshu and I’m a front-end developer at Wingify. I’m also a iOS game developer part time. I have experience with developing both native applications (games) and mobile web applications, and can present the best of both worlds to the listeners.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>“Go Native or Go Home”, veterans in the mobile world would often say that, as they watch the web world trying to play catch in terms of performance. This talk would talk about some low level details of programming a native app that help boost performance, the details that a web programmer wouldn’t really know unless he gets his hands dirty with some native code. These details include:</p>\n<ol>\n<li>Understanding Memory - each byte on a mobile device is critical, understanding garbage collection, strong references and memory leaks  </li>\n<li>Understanding Bitmaps - optimizing images, POT (power of two) textures, sprite sheets, dithering,  </li>\n<li>Understanding Rendering - introduction to the rendering process, DOM vs canvas vs hardware accelerated canvas  </li>\n<li>Multi-threading - importance of delegating all processing work to a different thread, web-workers, parallel.js</li>\n</ol>\n<p>Once you develop a native application, you can very well take those learnings and develop a web application with performance as the prime focus.</p>",
      "fullname": "Himanshu Kapoor",
      "id": 1605,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1331-go-native-and-come-back/json",
      "level": "Intermediate",
      "links": "I have spoken previously at JSFoo 2014:\r\nhttps://jsfoo.talkfunnel.com/2014/1237\r\nhttps://hasgeek.tv/jsfoo/2014-1/989",
      "name": "1331-go-native-and-come-back",
      "objective": "<p>Lets try and make the picture clear. Currently, the concensus is that:</p>\n<ol>\n<li>Native apps will always perform better than the Web  </li>\n<li>The mobile web is slow</li>\n</ol>\n<p>This talk will be about my experience developing native applications and learning of things I wouldn’t normally have known had I been developing only using the web. You would know what to optimize from the tips and tricks floating around the web, but you wouldn’t really know why or how they work.</p>\n<p>This talk will focus on things are like a native app developer’s religion, but are taken for granted by the naïve web developer. Thus, encouraging the web developer to learn and develop a native app at least once, take those learnings and use them in the web world. This talk will also go about what those learnings are, one by one.</p>",
      "proposer": "Himanshu Kapoor (~fleon)",
      "requirements": "<p>Basic understanding of JavaScript.</p>",
      "section": "Performance – full talk",
      "slides": "",
      "speaker": "Himanshu Kapoor (~fleon)",
      "submitted": "2015-03-08T12:39:55.265709Z",
      "title": "Go Native and Come Back",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1331-go-native-and-come-back",
      "votes": 2
    },
    {
      "bio": "<p>I am Kanagaraj, working as Software Develeoper at Red Hat and an open source enthusiast. Coming from Java ecosystem, i started liking Javascript for its simplicity and powerfulness. I am interested in exploring javascript more and more.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>ECMAScript 6, the new Javascript standard, is going to be released by the mid of 2015. So its a good time to talk some of the cool features the javascript is going to get. The list includes</p>\n<ul>\n<li>Classes</li>\n<li>Modules</li>\n<li>Promises</li>\n<li>Arrow Functions</li>\n<li>Block Scoping</li>\n</ul>\n<p>ECMAScript 6 features are continually appearing in javascript engines. But not all the browsers support all the features. There are tools that can be used today to transpile code to ES5 so that it can work in today’s browsers. There are some well known transpilers.</p>\n<ul>\n<li>Traceur</li>\n<li>BabelJS (was 6to5)</li>\n</ul>",
      "fullname": "Kanagaraj Mayilsamy",
      "id": 1602,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1330-es6-the-future-of-javascript/json",
      "level": "Beginner",
      "links": "https://twitter.com/kanagarajkm\r\nhttps://github.com/kmkanagaraj/",
      "name": "1330-es6-the-future-of-javascript",
      "objective": "<p>The next version of JavaScript, defined by ECMAScript 6 (ES6), is packed with great, new features. This talk gives a overview of ECMAScript 6 features and tools that enable you to use them today.</p>",
      "proposer": "Kanagaraj Mayilsamy (~kmkanagaraj)",
      "requirements": "<p>Basic knowledge about Javascript</p>",
      "section": "Application Design – full talk",
      "slides": "",
      "speaker": "Kanagaraj Mayilsamy (~kmkanagaraj)",
      "submitted": "2015-03-07T15:26:42.950306Z",
      "title": "ES6 - The future of javascript",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1330-es6-the-future-of-javascript",
      "votes": 7
    },
    {
      "bio": "<p>Lakshman Prasad works as a Software Architect at a management consulting firm. He has been working to deliver solid technology solutions in the entire stack for the most part of the decade.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>Google is out to redesign entirely based on a <em>design language</em> called Material Design. Unified consistent design that works seamlessly across devices and is intutive has been a need of the hour.</p>\n<p>In this session we explore the need for such a design language, the various aspects to it, how it can be implemented in your apps today.</p>",
      "fullname": "Lakshman Prasad",
      "id": 1601,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1329-studying-google-material-design-and-exploring-how-/json",
      "level": "Intermediate",
      "links": "",
      "name": "1329-studying-google-material-design-and-exploring-how-",
      "objective": "<ul>\n<li>To understand various aspects of Google Material Design</li>\n<li>To understand how it can be achieved using CSS</li>\n<li>To explore how it is implemented in some of the Open Source Design frameworks ( implemented using Angularjs, Polymer, React)</li>\n<li>Understand how you can utilize these frameworks today and/or take away parts of the relevant design specs/implementations</li>\n</ul>",
      "proposer": "Lakshman Prasad (~becomingguru)",
      "requirements": "",
      "section": "Application Design – full talk",
      "slides": "",
      "speaker": "Lakshman Prasad (~becomingguru)",
      "submitted": "2015-03-07T13:50:23.737844Z",
      "title": "Studying Google Material Design and Exploring how you can take advantage of it today",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1329-studying-google-material-design-and-exploring-how-",
      "votes": 2
    },
    {
      "bio": "<p><a href=\"http://geohacker.in\">Sajjad Anwar</a> is a developer at <a href=\"https://mapbox.com\">Mapbox</a> where he focuses on buidling data processing and productivity tools. He has been working closely with OpenStreetMap data and technology for over 6 years. As a strong advocate of open data, he is actively involved in its movement in India with initiatives like <a href=\"http://datameet.org\">DataMeet</a> and <a href=\"http://geoblr.in\">GeoBLR</a>.</p>",
      "comments": 5,
      "confirmed": true,
      "description": "<p>Maps have continously become the center stage for mobile web apps. They have gone from something that developers plug in at the last minute to a fully interactive element that governs the overall aesthetics of the application. We will talk about how this is important and how open source tools help add value and functionality to the maps. We will understand how maps are rendered in a browser in a mobile environment, and explore some of the recent improvements that push the limits of web technologies. </p>\n<h4>Outline</h4>\n<ul>\n<li>Why maps matter and how they are the focal point of applications.</li>\n<li>Mapbox&rsquo;s open source tool infrastructure, web standards and compatibility.</li>\n<li>Performance considerations.</li>\n<li>WebGL, vectors and how they compare to raster rendering techniques. </li>\n<li>Why some of these challenges are nudging us to go native.</li>\n</ul>",
      "fullname": "Sajjad Anwar",
      "id": 1600,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1328-making-maps-work-on-mobile/json",
      "level": "Beginner",
      "links": "https://www.mapbox.com/mapbox-gl/\r\nhttps://www.mapbox.com/mapbox.js/api/v2.1.5/\r\nhttp://justinmiller.io/posts/2015/01/20/anatomy-of-a-travel-map/\r\nhttp://leafletjs.com/\r\n",
      "name": "1328-making-maps-work-on-mobile",
      "objective": "<p>The idea is to introduce few challenges in serving maps on the mobile web through Mapbox&rsquo;s open source infrastructure. Embracing web standards and understanding device resources are key aspects. We will discuss how technologies like WebGL and vector tiles along with data formats like GeoJSON are setting the baseline for beatiful maps on mobile.</p>",
      "proposer": "Sajjad Anwar (~geohacker)",
      "requirements": "<p>Not much really. If you have built an interactive map into your application, that&rsquo;s great. If you understand how maps work on the web, that&rsquo;s even better.</p>",
      "section": "Performance – crisp talk",
      "slides": "",
      "speaker": "Sajjad Anwar (~geohacker)",
      "submitted": "2015-03-06T19:18:25.729200Z",
      "title": "Making maps work on mobile.",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1328-making-maps-work-on-mobile",
      "votes": 3
    },
    {
      "bio": "<p>We hate slow and janky websites, every user wants an application to load in less than a second and perform jank-free. PerfAudit is a step towards achieving this goal, by involving the experts and the business owners to find the keyholes hindering the performance of web applications. With every Performance Audit, we not only intend to help make a web application perform fast, but also add our findings to the pool of performance improvements that developers must add into their deployment routine to make evergreen performant applications.</p>",
      "comments": 0,
      "confirmed": true,
      "description": "<p>Performance is a Feature, the slower your website loads and displays, the less people will use it directly impacting the growth and revenue of your business.</p>\n<p>Yet many people are not able to understand the performance gotchas completely, and don&rsquo;t make it a part of their deployment process to consider the page load and rendering performance.</p>\n<p>Workshop will consist of:</p>\n<ul>\n<li>Comprehensive analysis and discussion of the process to achieve a pagespeed score of 100, with explanation of each point.</li>\n<li>Profiling with Chrome Dev Tools to explore the rendering issues and their respective remedies.</li>\n<li>Discussion of 2-3 case studies of already audited web applications, and discuss their performance remedies as well.</li>\n</ul>\n<p>Takeaways for participants:</p>\n<ul>\n<li>In-depth understanding of browser rendering process.</li>\n<li>Profiling of Networking and Rendering Performance of a Webpage using Chrome Dev tools and other tools.</li>\n<li>Learn techniques to consider when coming across issues related to networking/rendering performance, and apply the same in your projects.</li>\n<li>Live Audit of web application will help them understand and overcome the issues related to their page performance.</li>\n</ul>",
      "fullname": "Apoorv Saxena",
      "id": 1599,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1327-profile-profile-profile/json",
      "level": "Intermediate",
      "links": "Co-Founder, PerfAudit http://perfaudit.com/\r\n100/100 PageSpeed Score https://developers.google.com/speed/pagespeed/insights/?url=http%3A%2F%2Fperfaudit.com\r\nHacking to be Performant? Talk presented in Meta Refresh Delhi Runup www.slideshare.net/ApoorvSaxena/hacking-to-be-performant",
      "name": "1327-profile-profile-profile",
      "objective": "<p>Profile Web Applications to load under 1 second and tackle issues to run them at 60fps</p>",
      "proposer": "Apoorv Saxena (~apoorv-saxena)",
      "requirements": "<p>I expect developers and project managers to be interested in this workshop, and thus require a basic level of understanding of HTML, CSS &amp; JS. Every attendee must also accompany a laptop to perform a Live PerfAudit.</p>",
      "section": "Workshops",
      "slides": "",
      "speaker": "Apoorv Saxena (~apoorv-saxena)",
      "submitted": "2015-03-06T15:43:05.337188Z",
      "title": "{ Profile } ! { Profile } ! { Profile } !",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1327-profile-profile-profile",
      "votes": 7
    },
    {
      "bio": "<p><strong>Abhinav</strong> //\nOld school JVM hacker. Loves log files. Wishes he was programming Haskell.<br>\n<strong>Akshay</strong> //\nModern day aesthetically-relevant hacker. Long time Rubyist, recent JavaScript and Clojure programmer.</p>\n<p>We work in a variety of different projects at nilenso. From media publishing platforms and energy saving projects to multi-variate testing and machine learning systems.</p>",
      "comments": 0,
      "confirmed": true,
      "description": "<p>We&rsquo;ll go through the fundamentals and philosophy of ReactJS and see how we can apply patterns that have emerged from using it alongside a design team.</p>\n<p>In our half-day workshop, we&rsquo;ll try to cover these high-level ideas:</p>\n<ul>\n<li>Setting up a simple ReactJS application.</li>\n<li>Writing UI components that can be re-used across the application as an easy way of keeping the design consistent.</li>\n<li>HTML-like templating languages (like JSX, react-templates) that make it much easier for designers to write dynamic interactions by themselves.</li>\n<li>Declarative / logic-less UI components that can perform transitions / animations etc.</li>\n<li>\n<p>We&rsquo;ll try our hands on building a few simple UI components. For example, a menu system like this: </p>\n<p><img alt=\"\" src=\"https://s3.amazonaws.com/f.cl.ly/items/430I1j2L3b1C2e2A0W1Q/did-a-thing.gif\" title=\"menu system in react\"></p>\n</li>\n</ul>",
      "fullname": "Akshay Gupta",
      "id": 1598,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1326-a-quick-and-hopefully-painless-ride-through-reactj/json",
      "level": "Intermediate",
      "links": "nilenso.com\r\ngithub.com/kitallis\r\ngithub.com/abhin4v\r\ntinyurl.com/a-taste-of-clojure\r\nlanyrd.com/2013/rubyconfindia/schdhh",
      "name": "1326-a-quick-and-hopefully-painless-ride-through-reactj",
      "objective": "<p>ReactJS as a much better front-end engineering battle-axe and a facilitator for designers.</p>",
      "proposer": "Akshay Gupta (~kitallis)",
      "requirements": "<ul>\n<li>Basic understanding of JavaScript, HTML and CSS.</li>\n<li>Laptop with the lastest Chrome, Sublime Text editor, a terminal and python installed.</li>\n</ul>",
      "section": "Workshops",
      "slides": "",
      "speaker": "Akshay Gupta (~kitallis)",
      "submitted": "2015-03-06T09:27:39.702270Z",
      "title": "A Quick (and Hopefully Painless) Ride Through ReactJS ",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1326-a-quick-and-hopefully-painless-ride-through-reactj",
      "votes": 3
    },
    {
      "bio": "<p>Front-end design and development @ Arkin.net working and writing email templates for fun and profit.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>A quick lowdown into what goes into designing and implementing email templates that with focus on design patterns that work well on both mobile and desktop, using SVGs for image content and designing/devloping keeping in mind progressive enhancement to support multiple email clients.</p>",
      "fullname": "Raunaq Gupta",
      "id": 1594,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1325-design-and-code-responsive-emails/json",
      "level": "Beginner",
      "links": "http://raunaqgupta.com",
      "name": "1325-design-and-code-responsive-emails",
      "objective": "<p>Getting exposed to design patterns and implementation quirks that go into designing and writing responsive email templates.</p>",
      "proposer": "Raunaq Gupta (~raunaqgupta)",
      "requirements": "<p>A basic understanding of <code>HTML</code> and <code>CSS</code></p>",
      "section": "Content design – crisp talk",
      "slides": "",
      "speaker": "Raunaq Gupta (~raunaqgupta)",
      "submitted": "2015-03-05T03:56:10.814507Z",
      "title": "Design and Code Responsive Emails",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1325-design-and-code-responsive-emails",
      "votes": 3
    },
    {
      "bio": "<p>Team lead at Practo. Creating delightful interfaces makes me happy.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>Creating native app like experience for mobile websites is still a challenge. But there are simple user interface tricks that can give the user a perceived sense of enhanced performance.</p>",
      "fullname": "Siddharth Kshetrapal",
      "id": 1592,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1324-perceived-performance-for-the-mobile-web/json",
      "level": "Beginner",
      "links": "",
      "name": "1324-perceived-performance-for-the-mobile-web",
      "objective": "<p>Ways to make mobile web feel native.</p>",
      "proposer": "Siddharth Kshetrapal (~siddharthkp)",
      "requirements": "<p>Basic knowledge of CSS3 and javascript.</p>",
      "section": "Performance – crisp talk",
      "slides": "",
      "speaker": "Siddharth Kshetrapal (~siddharthkp)",
      "submitted": "2015-03-04T08:50:10.897236Z",
      "title": "Perceived Performance for the Mobile Web",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1324-perceived-performance-for-the-mobile-web",
      "votes": 2
    },
    {
      "bio": "<p>Karthik Kumar Viswanathan is an independant software consultant who has hacked on various stacks and innumerous projects. He makes development and design accessible to many developers. He is an ardent FOSS supporter and has spoken at various conferences on a wide variety of topics from Operating Systems, Compilers, Video Games and Analytics.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>We talk about how we faced these challenges, and how we went about solving them.</p>",
      "fullname": "Geographic Company",
      "id": 1591,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1323-small-talk-on-i18n/json",
      "level": "Intermediate",
      "links": "",
      "name": "1323-small-talk-on-i18n",
      "objective": "<p>To help understand the challenges of Internationalization, and how to prepare, design and implement it as a Front-End Developer.</p>",
      "proposer": "Geographic Company (~geogcompany)",
      "requirements": "<p>Projector, Microphone, Small Conference Room.</p>",
      "section": "Front-end build processes and tools – crisp talks",
      "slides": "",
      "speaker": "Geographic Company (~geogcompany)",
      "submitted": "2015-03-04T08:14:45.281548Z",
      "title": "Small Talk on i18n",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1323-small-talk-on-i18n",
      "votes": 1
    },
    {
      "bio": "<p>Iam a front end developer, designer at Genwi. At genwi we are developing hybrid apps (IOS, Android, HTML5) targeted towards content marketing world where design (written in HTML,CSS,JS) is decoupled from the actual code to run the apps. Visualising content is key focus in our apps and we take care of client requirements which are challenging both in terms of design and functionality. Iam an avid blogger as well, reading and writing about technology, good design and any insights or experiences that I gain.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>Single Page App is what helps provide a native experience in the mobile browser. They don&rsquo;t involve page reloads, respond much faster and take advantage of custom animations for navigation. Overall they provide a more seamless experience than a traditional website where each link is loaded fresh.</p>\n<p>Backbonejs is a javascript framework based on a model-view type architecture. In simple terms, it tries to bring structure to the data and the many parts of interface that your website has. In this presentation we will demonstrate a project converting a simple content based website; a &ldquo;news portal&rdquo; to a single page app using backbone. The following functionalities will be discussed in terms of the concept and the coding implementation.</p>\n<ol>\n<li>Structuring the website as per the model view architecture of Backbone.  </li>\n<li>Routing of the website - How to present different views upon navigation, maintain browser history.  </li>\n<li>Special features available in Backbone in terms of operations on model and view.</li>\n</ol>",
      "fullname": "Aseem Agarwal",
      "id": 1587,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1322-developing-spa-for-the-mobile-browser-with-backbon/json",
      "level": "Intermediate",
      "links": "",
      "name": "1322-developing-spa-for-the-mobile-browser-with-backbon",
      "objective": "<p>With this talk we will take a traditional content based website and convert it into a Single Page App (SPA) using Backbone. </p>",
      "proposer": "Aseem Agarwal (~agaase19)",
      "requirements": "<p>something to write down the important points during the talk.</p>",
      "section": "Front-end build processes and tools – crisp talks",
      "slides": "",
      "speaker": "Aseem Agarwal (~agaase19)",
      "submitted": "2015-03-04T03:43:40.552357Z",
      "title": "Developing  SPA for the mobile browser with Backbone",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1322-developing-spa-for-the-mobile-browser-with-backbon",
      "votes": 1
    },
    {
      "bio": "<p>Ronak Bhandari is a Data Artist at <a href=\"https://pykih.com\">https://pykih.com</a> Data Visualization. He primarily codes in Javascript.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>d3.js is powerful but tough to use! You could copy-paste from d3.js examples but they have inconsistent design and input data formats! For pro-users, coding in d3.js can get easily chaotic. PykCharts.js is our attempt to addresses these issues!</p>\n<ul>\n<li>Problems with d3.js</li>\n<li>Solution</li>\n<li>Charting Design Guidelines we follow</li>\n<li>Input Data Reusability </li>\n<li>Code Architecture</li>\n<li>Configuration Params</li>\n<li>How to contribute</li>\n</ul>",
      "fullname": "Ronak Bhandari",
      "id": 1586,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1321-contributing-to-pykcharts-js-responsive-d3-js-char/json",
      "level": "Intermediate",
      "links": "http://pykcharts.com",
      "name": "1321-contributing-to-pykcharts-js-responsive-d3-js-char",
      "objective": "<p>We just launched PykCharts.js - 26+, open source, design biased, responsive charts under the BSD license. This session will do a code walk through of the architecture of PykCharts.js so d3.js developers can contribute to the library.</p>",
      "proposer": "Ronak Bhandari (~ronakrrb)",
      "requirements": "<p>Knowledge of Javascript, d3.js, CSS</p>",
      "section": "Application Design – full talk",
      "slides": "",
      "speaker": "Ronak Bhandari (~ronakrrb)",
      "submitted": "2015-03-03T19:16:53.073475Z",
      "title": "Contributing to PykCharts.js (Responsive d3.js charts without the complexity of d3.js)",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1321-contributing-to-pykcharts-js-responsive-d3-js-char",
      "votes": 4
    },
    {
      "bio": "<p>Ritvvij Parrikh is the founder of <a href=\"https://pykih.com\">https://pykih.com</a> - a data visualisation company. He works in the intersection of data, design, statistics and coding. In his previous avatars, he founded a social enterprise that helped charities with analytics. Prior to that, he worked for many years at Amdocs US designing data-driven systems for AT&amp;T.</p>",
      "comments": 0,
      "confirmed": true,
      "description": "<p>At Pykih, we have attempted to solve this problem with a Javascript Framework (PykQuery.js) that establishes a consistent way for our team to write data-driven interactive front-ends. </p>\n<ul>\n<li>The problem</li>\n<li>Case study without PykQuery.js</li>\n<li>Introduction </li>\n<li>Architecture</li>\n<li>How it works?</li>\n<li>Case study with PykQuery.js</li>\n</ul>",
      "fullname": "Ritvvij Parrikh",
      "id": 1585,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1320-a-framework-for-building-data-driven-interactive-f/json",
      "level": "Intermediate",
      "links": "",
      "name": "1320-a-framework-for-building-data-driven-interactive-f",
      "objective": "<p>We live in world of &ldquo;big data&rdquo;. However, the front-end for the &ldquo;big data&rdquo; age is the browser which cannot hold more than 1-5 MB of data at any given moment of time. The problem becomes more aggravated in mobiles where the bandwidth is even lower. How to build user interfaces that are data heavy and interactive in nature? </p>",
      "proposer": "Ritvvij Parrikh (~pykih)",
      "requirements": "<p>Basic HTML and Javascript knowledge</p>",
      "section": "Application design – crisp talk",
      "slides": "http://www.slideshare.net/ritvvijparrikh/pykqueryjs",
      "speaker": "Ritvvij Parrikh (~pykih)",
      "submitted": "2015-03-03T19:01:39.738265Z",
      "title": "A framework for building data-driven interactive front-ends ",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1320-a-framework-for-building-data-driven-interactive-f",
      "votes": 6
    },
    {
      "bio": "<p>I&rsquo;m Abhishek, I do product design at <a href=\"https://helpshift.com\">Helpshift</a>. I love running, dabbling into art and programming. Twitter: <a href=\"https://twitter.com/ideamonk\">@ideamonk</a></p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>At Helpshift, for over a year, we used a tiny internal documentation generator - Quill. The workflows were hardly friendly to non-developers and proved to be a bottleneck as we grew.</p>\n<p>In a recent hackathon, we built a UI for Quill with Polymer and it turned out to be a fantastic fit.</p>\n<p>This talk is about observations &amp; insights from the work.</p>\n<p>In this talk, we gently introduce Web Components and Polymer. We take walk-through design &amp; development of the UI. Talk about why Polymer turned out to be a breeze. And why Web Components and Polymer are a step forward fostering much needed re-usability and composability for the modern web.  </p>",
      "fullname": "Abhishek Mishra",
      "id": 1580,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1319-polymer-for-fun-and-profit-observations-from-writi/json",
      "level": "Beginner",
      "links": "https://www.polymer-project.org/",
      "name": "1319-polymer-for-fun-and-profit-observations-from-writi",
      "objective": "<p>This talk is about Web Components and Polymer - first a walkthrough of an internal tool built with Polymer, followed by reflections on the choice, benefits and observations.</p>",
      "proposer": "Abhishek Mishra (~mishra2015)",
      "requirements": "",
      "section": "Application design – crisp talk",
      "slides": "",
      "speaker": "Abhishek Mishra (~mishra2015)",
      "submitted": "2015-02-28T17:56:16.714936Z",
      "title": "Polymer for Fun and Profit - observations from writing a documentation tool with Polymer",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1319-polymer-for-fun-and-profit-observations-from-writi",
      "votes": 34
    },
    {
      "bio": "<p>I&rsquo;m Priyanka Herur, working at Adobe Systems in the Web Platform and Authoring team. In the past year, we&rsquo;ve been exploring solutions to make it easier to test across multiple devices. This talk will cover our learnings and observations of various device testing tool.</p>",
      "comments": 0,
      "confirmed": true,
      "description": "<p>We’re all working on responsive websites. Testing these webpages across different devices/screens and across all the different browsers is a time-consuming process.<br>\nIn this talk, we’ll explore ways in which we can preview and test webpages across multiple browsers, multiples devices at different screen resolutions. This talk will cover:<br>\n1. Why should we test on devices?<br>\n2. Different tools and services with which we can test the webpages across devices/browsers .  </p>",
      "fullname": "Priyanka Herur",
      "id": 1579,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1318-why-and-how-to-test-webpages-across-multiple-devic/json",
      "level": "Beginner",
      "links": "",
      "name": "1318-why-and-how-to-test-webpages-across-multiple-devic",
      "objective": "<p>In this talk, we&rsquo;ll talk about why it is important to test webpages on devices and how to test across multiple devices/screens/browsers.</p>",
      "proposer": "Priyanka Herur (~priyanka-herur)",
      "requirements": "",
      "section": "Front-end build processes and tools – crisp talks",
      "slides": "",
      "speaker": "Priyanka Herur (~priyanka-herur)",
      "submitted": "2015-02-28T17:32:31.290377Z",
      "title": "Why and how to test webpages across multiple devices and browsers",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1318-why-and-how-to-test-webpages-across-multiple-devic",
      "votes": 1
    },
    {
      "bio": "<p>I am Ankur Bansal. I am working as a front end developer from past 2 years and have worked in creating single page applications using angularjs. I have also acquired some expertise in creating highly configurable d3js charts for visualising multi dimensional data on web.</p>",
      "comments": 3,
      "confirmed": false,
      "description": "<p>The session will be about the data driven UI generation with the help of angularjs. Some of the powerful features of angularjs like<br>\nTwo way data binding,<br>\nDynamic templates, and<br>\nOn the go compilation of HTML<br>\n are used to achieve the goal.\nGenerally, multiple HTML templates are created for different views in a web application but we are going to discuss an approach where we create dynamic dom generator based on the JSON received and what to do to write the reusable code.  </p>",
      "fullname": "Ankur Bansal",
      "id": 1578,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1317-creating-a-data-driven-ui-framework/json",
      "level": "Intermediate",
      "links": "",
      "name": "1317-creating-a-data-driven-ui-framework",
      "objective": "<p>To discuss an approach to create scalable UI framework and configurable UI components to incorporate custom requirements of web applications.</p>",
      "proposer": "Ankur Bansal (~ankurbansal177)",
      "requirements": "<p>Ears</p>",
      "section": "Application design – crisp talk",
      "slides": "http://www.slideshare.net/ankurbansal177/meta-refresh-45253237",
      "speaker": "Ankur Bansal (~ankurbansal177)",
      "submitted": "2015-02-28T13:00:11.675937Z",
      "title": "Creating a Data Driven UI Framework",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1317-creating-a-data-driven-ui-framework",
      "votes": 15
    },
    {
      "bio": "<p>Souvik is working as a Front End dev and Technical lead with ecoInsight. He has worked on Windows and Web technologies for about 12 years. For the past few years Souvik has been spending a major time on HTML5 and UI development. He is passionate about Front End technologies. Souvik has worked with companies like ThoughtWorks, Avaya and Symantec in past. His daily work involves work on HTML5 and WPF front end. He has spoken on Silverlight and HTML5 technologies in various dev conferences before. When he is not coding he is outdoors chasing wildlife with his DSLR in the National Parks of Southern India.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>Today most of the websites are designed Responsive or even better with a Mobile First approach. We have devices ranging from a 2 inch display to 42 inches and every other dimension in between. Designing a UI that fits well with all or most device is a challenge. Even when we create an app with responsive design principles in mind we do stumble upon a lot of issues while trying to give the best User experience. </p>\n<p>One such problem is with identifying high resolution devices with smaller screen sizes. In such devices it becomes even more difficult to identify the best strategy to take advantage of high resolution and yet be careful of not trying to stuff in more than the user can interact with. Another issue is with handling responsiveness on Single Page Apps. Most SPAs demand that the whole page be visible on the screen which becomes a challenge on Tablets due to smaller screen sizes. Adding scroll bars impacts UX in such cases.</p>\n<p>In my talk I will talk from my experience of the various problem we face while desigining a responsive web app. We will spend some time on discussing approaches to solve issues with displaying an SPA page on different device screens. We will look at how we can take advantage of HTML5 features and try some smart code to solve a lot of concerns with responsive designs.</p>",
      "fullname": "Souvik Basu",
      "id": 1574,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1316-practical-problems-with-responsive-designs-and-how/json",
      "level": "Intermediate",
      "links": "",
      "name": "1316-practical-problems-with-responsive-designs-and-how",
      "objective": "<p>To drill down on the major problems that a Front End developer faces while implementing a Responsive design</p>",
      "proposer": "Souvik Basu (~souvikbasu)",
      "requirements": "<p>Basic knowledge of JavaScript, HTML and CSS. Understanding of what is a Responsive design.</p>",
      "section": "Application Design – full talk",
      "slides": "",
      "speaker": "Souvik Basu (~souvikbasu)",
      "submitted": "2015-02-27T09:49:55.878471Z",
      "title": "Practical problems with Responsive designs and how to approach them",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1316-practical-problems-with-responsive-designs-and-how",
      "votes": 8
    },
    {
      "bio": "<p>Technical Architect @ siminars<br>\nDabling with code for last 6 years</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>Angular/React/Backbone &hellip; Yes there are a zillion frameworks that can help get your job done. This talk is all about the various ideas we learnt writing our own framework for siminars.com. And how we incorporated the design patterns that have evolved in this period in our own framework. This talk could help you find a better solution by explaining the various questions you probably would need to answer through your development cycles.</p>",
      "fullname": "Amit Singh Sethi",
      "id": 1570,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1315-what-does-writing-a-js-framework-teach-you/json",
      "level": "Intermediate",
      "links": "",
      "name": "1315-what-does-writing-a-js-framework-teach-you",
      "objective": "<p>What we can have learn from the evolution of frontend frameworks in last 5 years. And how we incorporated it in our frontend framework.</p>",
      "proposer": "Amit Singh Sethi (~dusual)",
      "requirements": "<p>Should be able to think beyond Angular and React.  </p>",
      "section": "Application design – crisp talk",
      "slides": "",
      "speaker": "Amit Singh Sethi (~dusual)",
      "submitted": "2015-02-26T06:03:53.071522Z",
      "title": "What does writing a js framework teach you?",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1315-what-does-writing-a-js-framework-teach-you",
      "votes": 3
    },
    {
      "bio": "<p>I’m a 23 year old Front-end Developer from Srinagar, Kashmir. I work at Axelerant where most of my time is spent working on medium to large scale websites built on top of Drupal. I&rsquo;ve been working with various startups for the past three years with an agile approch, building front-end for website and webapp.</p>\n<p>I specialize in Front-end architecture, responsive design, web typography and UI/UX development. I’m passionate about JavaScript and spend most of time crafting software using Node.js and one of many client-side MVC frameworks. I’m a huge proponent of following best practices: TDD &amp; BDD, proper design patterns, always optimizing, and using the right tools for the right job.</p>\n<p>A believer of all Unixy things, I spend most of the time in the terminal. Vim is the text editor of choice. I live and breathe Open Source, I even started a local Open Source Community.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>CSS comes off as a simple language but as your codebase grows so does the technical debt. If not used correctly, you will end up with a bunch of code that is not only difficult to manage and extend but also doesn&rsquo;t follow any of the principals (DRY/SRP) our forefathers with the UNIX beard had passed on to us. </p>\n<p>SMACSS and BEM are the two methodologies that have emerged in the last few years that have helped companies like Facebook and Twitter with massive codebases to scale while continuously iterating and extending. We will learn how to adopt these techniques to write scalable and maintainable code which portrays a single author but in reality has multiple committers.</p>",
      "fullname": "Bassam Ismail",
      "id": 1569,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1314-scalable-architecture-with-smacss-and-bem/json",
      "level": "Intermediate",
      "links": "http://bassam.co\r\nhttp://github.com/skippednote\r\nhttp://twitter.com/skippednote",
      "name": "1314-scalable-architecture-with-smacss-and-bem",
      "objective": "<h4>We&rsquo;ll be learning about:</h4>\n<ul>\n<li>Component abstraction: Making a shift from theming for pages to theming for components.</li>\n<li>Naming patterns: Classes that are easy to extend and reuse with the low specificity.</li>\n<li>Preprocessors: Using preprocessor for dividing large stylesheets into components and abstracting magic data.</li>\n<li>CMS: How to use all these techniques in harmony with content management systems.</li>\n</ul>",
      "proposer": "Bassam Ismail (~skippednote)",
      "requirements": "",
      "section": "Application Design – full talk",
      "slides": "",
      "speaker": "Bassam Ismail (~skippednote)",
      "submitted": "2015-02-25T12:17:48.464619Z",
      "title": "Scalable architecture with SMACSS and BEM",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1314-scalable-architecture-with-smacss-and-bem",
      "votes": 5
    },
    {
      "bio": "<p>Vignesh is a UX designer (UX nazi as his colleagues call him :D) at <a href=\"http://recruiterbox.com/\">Recruiterbox</a>. Works primarily on design most recently, though he codes sometimes. Loves human languages more than computer ones and can read &amp; write 5 of them.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>Most of the sites - including the ones whose primary usage is from mobiles - seem to take speed for granted. While responsive design has become the norm for most modern websites, the speed is generally overlooked.</p>\n<p>But on the brighter side, it&rsquo;s not so hard to fix it. With a few simple build steps, you can achieve 90+ score on <a href=\"https://developers.google.com/speed/pagespeed/insights/?url=https%3A%2F%2Fmetarefresh.in%2F2015%2F\">Google Pagespeed</a>, as we did for <a href=\"http://recruiterbox.com/\">recruiterbox.com</a>.</p>\n<p>Inspired by <a href=\"https://developers.google.com/speed/pagespeed/insights/?url=http%3A%2F%2Fsmashingmagazine.com%2F\">SmashingMagazine&rsquo;s perfect 100/100</a>, we started going aggressively after performance bottlenecks for recruiterbox.com, and managed to get 91 on mobile and 94 on desktop, though we still have some more optimizations pending.</p>\n<p>I&rsquo;ll share the learnings, along with the step-by-step process we went through.</p>",
      "fullname": "Vignesh Nandha Kumar",
      "id": 1567,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1313-score-90-on-google-pagespeed-mobile-desktop/json",
      "level": "Intermediate",
      "links": "https://developers.google.com/speed/pagespeed/insights/?url=http%3A%2F%2Frecruiterbox.com\r\nhttp://blog.viky.in/redesign-website-without-affecting-seo/\r\nhttps://hasgeek.tv/jsfoo/2013-2/689-potential-gotchas-in-making-a-backbone-app\r\nhttps://github.com/vikynandha\r\nhttps://twitter.com/vikynandha",
      "name": "1313-score-90-on-google-pagespeed-mobile-desktop",
      "objective": "<p>To explain how to improve page load speeds without compromising on quality.</p>",
      "proposer": "Vignesh Nandha Kumar (~vikynandha)",
      "requirements": "<p>Basic knowledge about HTML, CSS &amp; front-end build tools (gulp/grunt).</p>",
      "section": "Performance – full talk",
      "slides": "",
      "speaker": "Vignesh Nandha Kumar (~vikynandha)",
      "submitted": "2015-02-24T16:46:18.829636Z",
      "title": "Score 90+ on Google Pagespeed - mobile & desktop",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1313-score-90-on-google-pagespeed-mobile-desktop",
      "votes": 11
    },
    {
      "bio": "<p>Engineering user experience for half a decade.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>A hands-on session to create a responsive design for portfolio website followed by detailed analysis of pros &amp; cons of using Axure for RWD</p>",
      "fullname": "vigneshwar",
      "id": 1565,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1312-prototyping-responsive-website-with-axure/json",
      "level": "Beginner",
      "links": "https://www.youtube.com/watch?v=9jwUKGXZjbM",
      "name": "1312-prototyping-responsive-website-with-axure",
      "objective": "<p>To understand and leverage capabilities of Axure in creating wireframes and prototypes for different screen sizes</p>",
      "proposer": "vigneshwar (~vigneshwar)",
      "requirements": "<p>Laptop</p>",
      "section": "Application design – crisp talk",
      "slides": "",
      "speaker": "vigneshwar (~vigneshwar)",
      "submitted": "2015-02-23T12:23:18.182369Z",
      "title": "Prototyping responsive website with Axure",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1312-prototyping-responsive-website-with-axure",
      "votes": 1
    },
    {
      "bio": "<p>Vagmi Mudumbai is mostly a developer. He welcomes all things λ. He heads a high end consultancy <a href=\"http://www.tarkalabs.com\">Tarka Labs</a> focused on building distributed applications with technologies like Clojure, Javascript, Ruby and Elm. Although he has been a staunch beleiver in the dynamically typed camp (Ruby/Python/JS), he is leaning towards the strongly and statically typed languages camp like Haskell/Purescript/Elm.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p><a href=\"http://elm-lang.org/\">Elm</a> is a functional programming language that eliminates run time errors in Javascript. It supports Virtual DOM based approach for building apps for both HTML and SVG based DOM that has been popularized by frameworks like React.js. I will introduce the basics concepts of Elm using the Elm.Html and why virtual-dom and immutable data structures are great ideas. We can then look at the the awesomeness of the <a href=\"https://github.com/elm-lang/elm-reactor\">Elm Reactor</a> project that lets us all give demos like Bret Victor in <a href=\"https://vimeo.com/36579366\">Inventing on Principle</a>. </p>",
      "fullname": "Vagmi Mudumbai",
      "id": 1557,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1310-building-apps-that-run-at-60fps-on-the-mobile-with/json",
      "level": "Advanced",
      "links": "https://github.com/vagmi\r\nhttps://www.youtube.com/watch?v=NBgYLPA0qO4\r\nhttps://www.youtube.com/watch?v=-v9MehRHsNE",
      "name": "1310-building-apps-that-run-at-60fps-on-the-mobile-with",
      "objective": "<p>Participants will walk away with an appreciation of the Elm programming language that shows an entirely new way of building javascript applications. Its type safety ensures that you will never see errors like &ldquo;undefined is not a function&rdquo;.</p>",
      "proposer": "Vagmi Mudumbai (~vagmi)",
      "requirements": "<p>A laptop with a working browser and internet connection. We will be primarily using <a href=\"http://elm-lang.org/try\">http://elm-lang.org/try</a> for the code samples.</p>",
      "section": "Front-end build processes and tools – crisp talks",
      "slides": "",
      "speaker": "Vagmi Mudumbai (~vagmi)",
      "submitted": "2015-02-21T17:15:28.908383Z",
      "title": "Building apps that run at 60fps on the mobile with Elm",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1310-building-apps-that-run-at-60fps-on-the-mobile-with",
      "votes": 2
    },
    {
      "bio": "<p>Manish is a Product Manager at Multunus Software. A Hacker and UX Dude who&rsquo;s also obsessed with Lean Start-ups. He also loves Earl grey tea and Beaches. So, don&rsquo;t get him started on that!</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>Lean Start-up is the new buzz word, but for good reason. It works!</p>\n<p>How do we apply that to design?</p>\n<p>Design sprint provides a framework to quickly validate your bold and risky concepts in a matter of days.<br>\nDon’t have a concept yet? Design sprint will help come up with one as well!</p>\n<p>In the workshop we’ll start with how to get a deeper and clearer understanding about the problem you are trying to solve and get the whole team on the same page.</p>\n<p>We’ll see how we can leverage everyone’s skills in the team to come up with great ideas (no more awkward silences in brainstorming!)</p>\n<p>Then we’ll see how we can combine the best parts from everyone’s ideas and agree upon one concept.</p>\n<p>Once we have a single concept, we’ll see how we can actually test it with real users and get real feedback without code!</p>\n<p><strong>Let&rsquo;s go from concept to confidence fast! And build software that not only looks good, but also solves problems well.</strong></p>",
      "fullname": "Manish Chiniwalar",
      "id": 1555,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1309-google-design-sprint-concept-to-confidence/json",
      "level": "Intermediate",
      "links": "https://speakerdeck.com/manishrc/design-sprint-construkt-festival-2015\r\nhttp://sched.co/2LpT\r\nhttps://speakerdeck.com/manishrc/demystifying-design-for-developers\r\n",
      "name": "1309-google-design-sprint-concept-to-confidence",
      "objective": "<h3>Using the principles you learn from the workshop, you should be able to:</h3>\n<ul>\n<li>Create designs that not only look good, but also improves the numbers that matter to the business</li>\n<li>Get everyone in the team thinking about the big picture</li>\n<li>Leverage the designer in everyone to come up with creative ideas</li>\n<li>Validate your designs before you spend time and money developing it</li>\n<li>Fail fast and arrive at a solution that works</li>\n<li>AND have fun while solving hard problems!</li>\n</ul>",
      "proposer": "Manish Chiniwalar (~manishrc)",
      "requirements": "",
      "section": "Workshops",
      "slides": "",
      "speaker": "Manish Chiniwalar (~manishrc)",
      "submitted": "2015-02-19T12:18:10.164277Z",
      "title": "Google Design Sprint - Concept to Confidence",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1309-google-design-sprint-concept-to-confidence",
      "votes": 21
    },
    {
      "bio": "<p>Founder &amp; Principal Designer @ NetBramha Studios<br>\nFounder @ DesignDay.co {a design community}</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>With the advent of wearables, devices and IOT&rsquo;s UX is no longer restricted to good old web or mobile. Paradigms have shifted, technologies have been invented and design is critical more than ever. </p>\n<p>The talk will focus on how does one design and adapt to these ever growing sea changes, how products don&rsquo;t just reside in browsers and apps. It will in hindsight look to inspire designers to go beyond the obvious.</p>\n<p>We will see examples, find design patterns and in general debate the design thinking applied. This session will not be an &ldquo;how to&rdquo; or an &ldquo;casestudy&rdquo; but a genuine attempt to leap into the future and see where UX is heading and how we can cope up with it. </p>\n<p>If time permits might do a design activity or two apart from the mandatory humour. </p>",
      "fullname": "Aashish Solanki",
      "id": 1552,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1307-user-experience-design-beyond-web-mobile/json",
      "level": "Intermediate",
      "links": "",
      "name": "1307-user-experience-design-beyond-web-mobile",
      "objective": "<p>Inspiration to design beyond mobile and web, Design cues to think for non browser/app UX and an overview of product design thinking across the digital future</p>",
      "proposer": "Aashish Solanki (~netbramha)",
      "requirements": "<p>Sense of humour, Passion for design</p>",
      "section": "Application Design – full talk",
      "slides": "",
      "speaker": "Aashish Solanki (~netbramha)",
      "submitted": "2015-02-17T11:46:33.388067Z",
      "title": "User Experience Design beyond web & mobile ",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1307-user-experience-design-beyond-web-mobile",
      "votes": 4
    },
    {
      "bio": "<p>Arun works in the mobile division of Amadeus, coding it out on hybrid mobile apps in the travel domain. He brings to the podium over 8 years experience in front-end engineering and couple of (hopefully) interesting demos.</p>",
      "comments": 0,
      "confirmed": true,
      "description": "<p>What does it take to get a native-like feel on mobile web?<br>\nHow does CSS and JS animations compare?<br>\nWhat libraries are out there - velocityJS, famo.us&hellip;<br>\nDemos</p>",
      "fullname": "Arun Subramaniam",
      "id": 1551,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1306-dom-animations-almost-native/json",
      "level": "Beginner",
      "links": "",
      "name": "1306-dom-animations-almost-native",
      "objective": "<p>What does it take to get a native-like feel on mobile web? How do CSS and JS animations compare?</p>",
      "proposer": "Arun Subramaniam (~rustydroid)",
      "requirements": "",
      "section": "Performance – crisp talk",
      "slides": "",
      "speaker": "Arun Subramaniam (~rustydroid)",
      "submitted": "2015-02-12T14:31:32.424561Z",
      "title": "DOM animations, almost native",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1306-dom-animations-almost-native",
      "votes": 4
    },
    {
      "bio": "<p>Leena is the Head of Engineering @ Multunus. She was bitten by the TDD bug a couple of years ago. Having done enough TDD in Ruby/Rails, Javascript and Android, she’s moved onto Continuous Delivery (CD) in a big way - even spoke about CD at DroidCon India 2011 and AgileIndia 2012. During the last couple of years, she had conducted workshops on TDD and CD during JSFoo, DroidCon and RootConf.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>Those who have written unit tests would know how much confidence it gives to the developers and how much it impacts maintainability due to frequent refactoring. And needless to say the faster feedback cycle it gives by following the &ldquo;Red-Green-Refactoring&rdquo;.</p>\n<p>But for CSS usually the practice is to rely on end to end tools such as Selenium, which are brittle and slow. </p>\n<h2>Session Format</h2>\n<p>It will be a live coding session, based on the <a href=\"https://github.com/multunus/sample-tddcss\">Sample setup</a> which uses:</p>\n<ul>\n<li>Quixote - Library for Unit Testing CSS </li>\n<li>Mocha - Javascript Testing Framework which Quixote uses for running the tests in browser</li>\n<li>Karma - the Test Runner, to run the tests across multiple web browsers, including mobile browsers</li>\n</ul>\n<p>The format of the session will be:</p>\n<ul>\n<li>Introduction to Unit Testing, specifically TDD, why its so important</li>\n<li>Unit test [2-3 trivial cases where CSS have logic, such as display block/none, position attribute with fixed value etc.]</li>\n<li>Test Driving some of the CSS3 tricks, mentioned in <a href=\"https://github.com/rupl/fun-games-css\">https://github.com/rupl/fun-games-css</a></li>\n<li>Introduction to tools like <a href=\"https://github.com/BBC-News/wraith\">wraith</a>, which can be used in complement to unit testing, for end to end testing including responsiveness</li>\n<li>Suggestions on how to help the participants apply the above learnings on their daily work</li>\n<li>Q&amp;A </li>\n</ul>\n<p>The session is open to anyone who has basic knowledge of CSS, Javascript and Git. If you are struggling to have high confidence about the reliability of every commits that you make to your repository, this session is for you. This session will help you to regain the confidence to push every commit to production.  </p>",
      "fullname": "Leena S N",
      "id": 1550,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1305-unit-testing-css/json",
      "level": "Intermediate",
      "links": "",
      "name": "1305-unit-testing-css",
      "objective": "<p>This workshop gives an overview of unit testing, especially Test Driven Development and also shows that CSS can also be unit tested. </p>",
      "proposer": "Leena S N (~leenasn)",
      "requirements": "",
      "section": "Workshops",
      "slides": "",
      "speaker": "Leena S N (~leenasn)",
      "submitted": "2015-02-08T17:49:32.444361Z",
      "title": "Unit Testing CSS",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1305-unit-testing-css",
      "votes": 5
    },
    {
      "bio": "<p>I am Indermohan Singh, Developer of Mobile App Ragakosh, Link: <a href=\"https://play.google.com/store/apps/details?id=com.ragakosh.app\">https://play.google.com/store/apps/details?id=com.ragakosh.app</a> and creator of Ionic Framework Snippet Plugin, Link: <a href=\"https://github.com/imsingh/ionic-sublime-plugin\">https://github.com/imsingh/ionic-sublime-plugin</a></p>\n<p>I am running AngularJS Ludhiana Meetup Group and Community memeber of Ionic. I have experience of Developing Mobile Apps with Ionic.</p>",
      "comments": 1,
      "confirmed": false,
      "description": "<p>I will be discussing purely about Ionic and AngularJS. As per your theme, it will great for attendees to experience the awesomeness of this Increadible tool. Ionic is very well designed framework, I will be discussing various features of Ionic and its UI Elements Like Tabs, Sidemenus, Drawer, Popover etc and lots of Other Functionality. Along with Ionic, I will also discuss about AngularJS, a better way to develop web application.</p>",
      "fullname": "Indermohan Singh",
      "id": 1444,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1304-mobile-app-development-with-ionic-and-angularjs/json",
      "level": "Intermediate",
      "links": "",
      "name": "1304-mobile-app-development-with-ionic-and-angularjs",
      "objective": "<p>In this Talk, I will discuss about Mobile App development with Ionic, a front-end SDK along with AngularJS and Cordova. People who are attending this conference will learn better way of Developing Apps and Websites too. (jQuery is not solution of Everything!)</p>",
      "proposer": "Indermohan Singh (~imsingh)",
      "requirements": "",
      "section": "Application Design – full talk",
      "slides": "http://ionicframework.com/present-ionic/slides",
      "speaker": "Indermohan Singh (~imsingh)",
      "submitted": "2015-01-23T15:55:44.188452Z",
      "title": "Mobile App Development with Ionic and AngularJS",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1304-mobile-app-development-with-ionic-and-angularjs",
      "votes": 4
    },
    {
      "bio": "<p>An automation nerd, working with goibibo.com. Loves to figure out ways to improve quality of the product by hook or crook. <a href=\"http://www.github.com/p00j4\">github/pooja</a><br>\n<a href=\"https://www.linkedin.com/in/qagirl\">linkedin/pooja</a></p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>Mobile is taking over the world and my app works awesomely on Android :-)<br>\nwait a second! OMG! it breaks on iPad !!!<br>\n1. Where are our Automated Tests which can test on web &amp; mobile cross platform/browser before a release goes  live?<br>\n2. Can Unit Tests alone make sure to have the app working on android 4.4.4, 3.0, ios &amp; windows as well?<br>\n3. Won’t the backend release going live hamper my front end app which is already in appstore from a month ?<br>\n4. Where is the plan to reduce Time To market?<br>\n5. Where is the Continuous Integration, is Jenkins helpful?  </p>",
      "fullname": "Pooja Shah",
      "id": 1434,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1303-scaling-test-automation-for-mobile-apps-and-explor/json",
      "level": "Intermediate",
      "links": "https://www.youtube.com/watch?v=WpQtyDKmaKM",
      "name": "1303-scaling-test-automation-for-mobile-apps-and-explor",
      "objective": "<ul>\n<li>Parameters to check to ensure the quality of app across platforms &amp; across browsers</li>\n<li>Is taking multiple releases live daily a pain, especially when scalability is of concern! \nCome, lets hear the challenges we faced @goibibo &amp; watch live demo of what we did and doing resolve them.  </li>\n</ul>",
      "proposer": "Pooja Shah (~p00j4)",
      "requirements": "",
      "section": "Application Design – full talk",
      "slides": "",
      "speaker": "Pooja Shah (~p00j4)",
      "submitted": "2015-01-21T18:16:42.738886Z",
      "title": "Scaling test automation for mobile apps and exploring Continuous Integration",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1303-scaling-test-automation-for-mobile-apps-and-explor",
      "votes": 8
    },
    {
      "bio": "<p>Siddharth Banerjee,<br>\nCTO, Wow Labz<br>\nLinked In Profile: <a href=\"https://in.linkedin.com/in/siddharthbanerjee82/\">https://in.linkedin.com/in/siddharthbanerjee82/</a></p>\n<p>Roshit Omanakuttan,<br>\nMobile Lead, Wow Labz<br>\nLinked In Profile: <a href=\"https://in.linkedin.com/in/roshit/\">https://in.linkedin.com/in/roshit/</a></p>",
      "comments": 1,
      "confirmed": false,
      "description": "<p>We&rsquo;ll start with a problem description. (Assuming I have my colleague building a mobile client along with me)<br>\nWe&rsquo;ll architect the applicaiton, both on server and the client side.<br>\nWe&rsquo;ll code the server first.<br>\nClient will be coded next.<br>\nWe&rsquo;ll demonstrate a simple 1 to 1 text chat first over web sockets. This will serve as an introduction to web sockets for people who haven&rsquo;t been exposed to the same yet. It is important to understand both client and server side nuances as this is what most beginners struggle with.<br>\nWe&rsquo;ll then write code to stream video content between server and client.<br>\nHopefully many other users will be able to code (at least the server) along with us.<br>\nWe&rsquo;ll personally solve the issues faced by them and also take other questions. </p>",
      "fullname": "Siddharth Banerjee",
      "id": 1433,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1302-hands-on-development-of-a-video-chat-application-u/json",
      "level": "Beginner",
      "links": "",
      "name": "1302-hands-on-development-of-a-video-chat-application-u",
      "objective": "<p>I&rsquo;d like this to be a practical introduction to WebRTC.<br>\nA video chat application will allow users to face and solve real challenges while working with WebRTC.<br>\nWe&rsquo;ll code along with the participants.</p>",
      "proposer": "Siddharth Banerjee",
      "requirements": "",
      "section": "Workshops",
      "slides": "",
      "speaker": "Siddharth Banerjee",
      "submitted": "2015-01-21T15:27:03.322034Z",
      "title": "Hands on development of a video chat application using WebRTC",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1302-hands-on-development-of-a-video-chat-application-u",
      "votes": 3
    },
    {
      "bio": "<p>It takes a rebel to start a war. With 7 years of web and 17 years of computing, I am starting one.</p>",
      "comments": 1,
      "confirmed": false,
      "description": "<p>I believe in kiss. Keeping it simple and stupid. That is how I write my code, make my UI, drink my coffee, take my photographs and live my life. I plan to take you through a journey of how web can do things beyond the web. I plan to show you a glimpse of that first step to the future. I plan to tell you how difficult simple can be. I plan to present how simple is the ultimate elegance. But then, the ones who follow the plan always reach the destination and that is not how discoveries are made.</p>",
      "fullname": "Ramanpreet Singh",
      "id": 1432,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1301-simple-yet-elegant/json",
      "level": "Beginner",
      "links": "",
      "name": "1301-simple-yet-elegant",
      "objective": "<p>We are human beings. We are creatures of habit, and web have been here for so long that we have got stuck in some bad ones. I aim to make a call to your subconscious.</p>",
      "proposer": "Ramanpreet Singh (~rmn)",
      "requirements": "<p>a dream.</p>",
      "section": "Application design – crisp talk",
      "slides": "",
      "speaker": "Ramanpreet Singh (~rmn)",
      "submitted": "2015-01-20T19:48:07.940384Z",
      "title": "simple yet elegant ..",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1301-simple-yet-elegant",
      "votes": 20
    },
    {
      "bio": "<p>I&rsquo;m Shashi, I build UI tools for The <a href=\"http://julialang.org\">Julia</a> Language. I am <a href=\"http://twitter.com/g0wda\">twitter/g0wda</a> and <a href=\"http://github.com/shashi\">github/shashi</a></p>",
      "comments": 1,
      "confirmed": true,
      "description": "<p>In no small part does Facebook&rsquo;s <a href=\"http://facebook.github.io/react\">React</a> framework owe its popularity to its magical ease &ndash; it provides a declarative way of describing UIs, and blazing fast performance for free. Good performance in this programming model is feasible because of a key design tenet of React called <a href=\"http://facebook.github.io/react/docs/reconciliation.html\">DOM Reconciliation</a>. In short, React does not mutate or create the <em>actual</em> DOM (for that is expensive and full of peril), instead it creates a representation of the DOM (which is called the <em>Virtual DOM</em>) at every app state, and then applies <em>only the differences</em> that need to be applied to the actual DOM.</p>\n<p>In this talk, we will explore what designing and programming UIs with such a <em>Virtual DOM</em> representation entails. We extend the Virtual DOM idea to the server-side and represent complex UIs as denotations tied to their <a href=\"http://webcomponents.org/\">Web Component</a> counterparts. This combination makes it easy to compose data-driven UIs from smaller reusable parts. We will also see examples of these ideas manifesting in the <a href=\"http://elm-lang.org\">Elm</a> ecosystem and some Julia UI packages (namely <a href=\"https://github.com/JuliaLang/Interact.jl\">Interact</a>, <a href=\"http://github.com/shashi/Patchwork.jl\">Patchwork</a>, and <a href=\"http://github.com/shashi/Canvas.jl\">Canvas</a>)</p>\n<p>Agenda/Contents:</p>\n<ul>\n<li>What are Values?<ul>\n<li>Numerals as the UI of numbers</li>\n</ul>\n</li>\n<li>UIs as abstract values<ul>\n<li>Rendering abstract values into Virtual DOM</li>\n</ul>\n</li>\n<li>Functionally Composing UIs<ul>\n<li>An algebra of layouts (aka try this with HTML)</li>\n<li>Style and theming</li>\n</ul>\n</li>\n<li>Reactive programming: Interaction and Animations<ul>\n<li>UI as a time-varying value</li>\n<li>Diffing and Patching</li>\n<li>The case for the server sending patches to the browser</li>\n</ul>\n</li>\n<li>Making UIs at a REPL</li>\n<li>Debugging: Time-travel and infinite undo</li>\n</ul>",
      "fullname": "Shashi Gowda",
      "id": 1431,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1300-uis-as-values/json",
      "level": "Intermediate",
      "links": "",
      "name": "1300-uis-as-values",
      "objective": "<p>This talk aims to dwell on the benifits of representing UIs as values. We take the key contribution of Facebook&rsquo;s React framework - the idea of <a href=\"http://facebook.github.io/react/docs/working-with-the-browser.html#the-virtual-dom\">Virtual DOM</a> and <a href=\"http://facebook.github.io/react/docs/reconciliation.html\">DOM Reconciliation</a> and push it as far as it can seemingly go.</p>\n<p><strong>Warning:</strong> contains Alan Kay quotes and Bret Victor-esque demos</p>",
      "proposer": "Shashi Gowda (~g0wda)",
      "requirements": "",
      "section": "Front-end build processes and tools – full talks",
      "slides": "",
      "speaker": "Shashi Gowda (~g0wda)",
      "submitted": "2015-01-20T19:00:35.897200Z",
      "title": "UIs as Values",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1300-uis-as-values",
      "votes": 6
    },
    {
      "bio": "<p>I&rsquo;m a hacker by heart, coder by profession. Live to Die in a technology rich world.</p>\n<p>And For those who dig in, I :<br>\ncode @ <a href=\"http://github.com/loxxy\">http://github.com/loxxy</a><br>\nsleep @ <a href=\"http://www.stackoverflow.com/users/378806/loxxy\">http://www.stackoverflow.com/users/378806/loxxy</a><br>\n&amp; enjoy making things @ <a href=\"http://www.sapientnitro.com\">http://www.sapientnitro.com</a></p>",
      "comments": 1,
      "confirmed": false,
      "description": "<p>People fear change, People fear the unknowns. Giants are bieng forced to consume the Dwarves. Complex seems uninvited. And a mysterious group of people seem to be in charge - The Makers. But little do we know that we are all already a part of this revolution. The tools, the weapons, are already with us.</p>\n<p>It doesn&rsquo;t matter what language you speak, whether it be Javascript or Python, Compiled or Interpreted, Frontend or Backend - Today&rsquo;s world allows you to make wonders with anything.</p>\n<p>We can control everything with the very knowledge we have. All it requires is a bit of tinkering &amp; bit more of curiousity. </p>",
      "fullname": "Ajay  Vishnu",
      "id": 1430,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1299-waking-the-maker/json",
      "level": "Beginner",
      "links": "",
      "name": "1299-waking-the-maker",
      "objective": "<p>From the begining, applications have always been designed with a two way agreement between humanity &amp; technology. We learning them &amp; they learning us. It&rsquo;s time that we take charge. But to do this, we need to teach them faster. Connect our world to theirs. Create - The Internet of Things.</p>\n<p>This session will help to realize the steps involved in leveraging the Internet of things &amp; it&rsquo;s potential in shaping a better tomorrow.</p>",
      "proposer": "Ajay  Vishnu (~loxxy)",
      "requirements": "<p>A Maker Hat</p>",
      "section": "Application design – crisp talk",
      "slides": "",
      "speaker": "Ajay  Vishnu (~loxxy)",
      "submitted": "2015-01-20T18:30:48.007135Z",
      "title": "Waking the Maker",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1299-waking-the-maker",
      "votes": 15
    },
    {
      "bio": "<p>Designed and developed Function Space - a social learning network for science. Also, happens to be its founder :) </p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>Designing a social network is a challenge in itself and if the network is for science lovers, the whole process becomes a lot more interesting. We&rsquo;ll take an in-depth look in designing a social network for science along with the special tools that we&rsquo;ve developed to attract the scintific community. We&rsquo;ll go throguh the entire design process for web and mobile including interaction design concepts, layout, typography and visual design. And the heart of the entire talk would be the &ldquo;hooked&rdquo; model that helped us to make the network more engaging and rewarding for our users.</p>",
      "fullname": "Adit Gupta",
      "id": 1428,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1297-using-hooked-model-to-design-a-social-network-for-/json",
      "level": "Intermediate",
      "links": "https://medium.com/@aditgupta/redesigning-function-space-e70a8fc6eab2",
      "name": "1297-using-hooked-model-to-design-a-social-network-for-",
      "objective": "<p>Users will understand the intricacies of designing a social network from scratch including interaction design concepts, layout strategies, typography, responsive design and visual design. </p>",
      "proposer": "Adit Gupta (~aditgupta)",
      "requirements": "",
      "section": "Application Design – full talk",
      "slides": "",
      "speaker": "Adit Gupta (~aditgupta)",
      "submitted": "2015-01-20T17:32:36.646839Z",
      "title": "Using \"Hooked\" model to design a social network for science",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1297-using-hooked-model-to-design-a-social-network-for-",
      "votes": 4
    },
    {
      "bio": "<p>I believe in simplicity, minimalism and an ardent willingness to push the envelop, envisioning the betterment of usable and practical solutions. - <a href=\"http://brajeshwar.me/\">brajeshwar</a></p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>The cold war, sometimes hot, between designers and developers are an on-going and part-parcel of any project that involves both. Designers frown upon the developers&rsquo; inability to design what they did in their graphic software. Developers blames the designers for being creative for the wrong reason.</p>\n<p>Let’s dive into some ideas, principles and naturally occurring phenomenon to help both designers and developers and apply to their work to bring forth better designs, creatively apply repetitive patterns and make their work beautiful.</p>\n<p>Let’s learn to look at the beauty of nature, sacred mathematical fractals and algorithms to design our products, apps, websites, mobile apps and your life.</p>\n<h2>Problem</h2>\n<p>With most designs projects - be it a website, or an app - has never been easy to make a client and everyone involved be really happy.</p>\n<p>A visual designer may do her best and get the clients convinced somehow, the final design usually loses its edge and originality when translated to the web, and devices.</p>\n<p>It is not easy and a tedious process to keep the Typography consistent, the spacing - paddings, margins - in sync.</p>\n<h2>Presentation Preview</h2>\n<p>The presentation will highlight some of the natural existing solutions to design problems - the Golden Ratio, the Fibonacci Sequence, the Cicada Principle - and how they can be used to leverage product designs - for the web, and devices.</p>\n<p>There will also be references to musical notes - the minor, major, fourth, sixth, octave, tenth, etc - and apply it to design to achieve a modular scale with the typography, and spacings between elements to bring forth a design that has its meanings.</p>\n<p>There will mentions of how adapting these principles, mathematical fractals can bring beauty, consistency and a sense of being part of users when it comes to designs that they interact everyday.</p>\n<h2>Takeaway from the Presentation</h2>\n<p>The presentation will walk through some of the well known naturally occurring phenomenon, patterns and mathematical fractals.</p>\n<p>I&rsquo;ll also prepare an open source example complete with working code on how we can apply such patterns, fractals to help designers and non-designers (read developers) understand each other better and be able to bring out design works that are ingrained in the beauty of nature.</p>\n<p>Hopefully, the presentation should be able to help inculcate a thinking into new designers and those who work with designers be able to take decisions with their work to make it more &lsquo;beautiful&rsquo;.</p>",
      "fullname": "Brajeshwar Oinam",
      "id": 1427,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1296-design-with-beauty-nature-mathematics-and-code/json",
      "level": "Intermediate",
      "links": "",
      "name": "1296-design-with-beauty-nature-mathematics-and-code",
      "objective": "<p>With increasing numbers of screen sizes to take care of, number of devices, platforms and mediums - it is really hard not just for designers but also developers to make sure a design ‘works’ across all these facades.</p>\n<p>Imagine if a developer, without a design degree or a design background, be able to use mathematics, fractals and intelligent algorithmic codes to design websites, apps, etc? Let’s about that.</p>",
      "proposer": "Brajeshwar Oinam (~brajeshwar)",
      "requirements": "",
      "section": "Content Design – full talk",
      "slides": "",
      "speaker": "Brajeshwar Oinam (~brajeshwar)",
      "submitted": "2015-01-20T16:08:03.435367Z",
      "title": "Design with Beauty, Nature, Mathematics and Code",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1296-design-with-beauty-nature-mathematics-and-code",
      "votes": 11
    },
    {
      "bio": "<p>I believe in simplicity, minimalism and an ardent willingness to push the envelop, envisioning the betterment of usable and practical solutions. - <a href=\"http://brajeshwar.me/\">brajeshwar</a></p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>In recent times, quite a bit of established companies - small, medium and large - have embarked on a journey to find a way to maintain design consistency, ability to quickly prototype and design on small sections or modules of a bigger project and get stack holders involved early on.</p>\n<p>The best way to do so far is through the practice of Styleguide Driven Development.</p>\n<p><em>Some of the points this talk with touch upon are:</em></p>\n<ul>\n<li>Philosophy behind SDD.</li>\n<li>Preparation for SDD.</li>\n<li>How to go about maintaining a Styleguide.</li>\n<li>Tools, Template and References to help start off with SDD.</li>\n</ul>\n<h2>Problem</h2>\n<p>A universal tuck-of-war between designers and developers will remain as long as web design and development exist. Unfortunately, there may unlikely be a solution that solves it 100% but we can try to reduce the friction and bring sanity to the design+developer world. The problem is more prominent in an Agile environment, where a design changes, evolves all the time and where designs cannot be &lsquo;fixed&rsquo; before the development.</p>\n<p>Of course, there is the code bloat that happens when two or more developers work on the same design and codes similar designs in multiple styles.</p>\n<h2>Presentation Preview</h2>\n<p>Imagine a scenario where there can be a common, updated visual guide for all the design elements, modules and styles. With my presentation, I&rsquo;ll walk through the common problems faced by teams of designer and developers working on a project.</p>\n<p>There will be examples, approaches to solving the problem of designer-developer mis-fits via Styleguide Driven Development. I&rsquo;ll walk through the process, best practices and want to build, maintain and cultivate a system of design and development based on a Styleguide.</p>\n<p>The presentation will include examples from projects I have been part of.</p>\n<p>Remember that a Styleguide is not a Photoshop or a JPEG file, it is not a Word or an Excel Doc. It is actual production ready codes, it should be part of your project version control system. Its purpose to help separate design from development and at the same time be on the same page.</p>\n<h2>Takeaway from the Presentation</h2>\n<p>There will be enough examples from companies that have successfully implemented Styleguide Driven Development.<br>\nConcrete step-by-step process to start and maintain a Styleguide with the options to tweak it suit the needs of any team.<br>\nI&rsquo;ll also be developing a working example of a Styleguide, which will be open source and can thus be extended, or used as bootstrap for your styleguide.</p>",
      "fullname": "Brajeshwar Oinam",
      "id": 1426,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1295-styleguide-driven-development-for-a-sane-cross-pla/json",
      "level": "Advanced",
      "links": "",
      "name": "1295-styleguide-driven-development-for-a-sane-cross-pla",
      "objective": "<p>Ushering in a key practice to front-end design and development to foster clear separation of UI (User Interface), UX (User Experience), front-end and the back-end. Styleguide Driven Development (SDD) is a practice that helps maintain sanity across all mediums and platforms, be it mobile, tablets or desktops or perhaps something else in future.</p>\n<p>The ultimate goal of SDD to allow everyone involved to work on their task, not to step on each others’ toes and hopefully bring peace between front-end team and the back-end.</p>",
      "proposer": "Brajeshwar Oinam (~brajeshwar)",
      "requirements": "",
      "section": "Application Design – full talk",
      "slides": "",
      "speaker": "Brajeshwar Oinam (~brajeshwar)",
      "submitted": "2015-01-20T15:51:35.364310Z",
      "title": "Styleguide Driven Development for a sane cross-platform design (Mobile, Tablets & Desktops)",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1295-styleguide-driven-development-for-a-sane-cross-pla",
      "votes": 16
    },
    {
      "bio": "<p>Sunil Pai writes code at Myntra. </p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>Yet another take on Bret Victor&rsquo;s livecoding demo, but for developing user interfaces (as opposed to games or graphics). The idea is to have a designer friendly (yet fully powerful) environment to be able to prototype user interface elements and layouts, animations, interactions, and whatnot. </p>",
      "fullname": "Sunil Pai",
      "id": 1425,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1294-a-live-environment-for-user-interface-prototyping/json",
      "level": "Intermediate",
      "links": "Bret Victor - Inventing on Principle - http://vimeo.com/36579366\r\n\r\n",
      "name": "1294-a-live-environment-for-user-interface-prototyping",
      "objective": "<p>to demo live &lsquo;coding&rsquo; as a strategy for prototyping user interfaces for mobile devices. </p>",
      "proposer": "Sunil Pai (~threepointone)",
      "requirements": "",
      "section": "Application design – crisp talk",
      "slides": "",
      "speaker": "Sunil Pai (~threepointone)",
      "submitted": "2015-01-20T14:03:15.865880Z",
      "title": "A live environment for user interface prototyping ",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1294-a-live-environment-for-user-interface-prototyping",
      "votes": 11
    },
    {
      "bio": "<p>Working as a frontend engineer at Myntra since 2013, till unsolved problems in frontend layout tools for iOS and Android forced us to dabble in engineering some backend systems.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>Long ago, a website had to be tweaked to work correctly in individual browsers and operating systems. Buttons, sliders and drop-down menus appeared differently on different operating systems. The web was the glue that defined their configuration, and the browser rendered these individual interface components for you. Soon CSS followed and you were able to specify styling attributes for these components.</p>\n<p>With the mobile age, we are back to square one. Everyone uses the &lsquo;web&rsquo;, not via the browser but via apps in the form of &lsquo;HTTP&rsquo;. Unfortunately, compiled apps have to be updated everytime something changes. iOS, Android, Windows Phone SDKs bring their own implementations of these interface elements and it is time for us to bring the remote configurability of the browser to these native elements.</p>\n<p>Here are the things we already know:<br>\n1. Mobile usage is shadowing desktop usage.<br>\n2. We now need to develop for 5 platforms: Desktop web, Mobile web, Android app, iOS app, Windows Phone app.<br>\n3. Mobile apps cannot be easily updated like websites.<br>\n4. Doing hybrid apps is like mixing tea and coffee into one drink, so you don&rsquo;t have to ask anyone what they would like to have.</p>\n<p>Here are the things we want:<br>\n1. Build apps whose content can be magically reconfigured from the server.<br>\n2. Define the content and layout for the apps once and have it work on all the different platforms.<br>\n3. An easy interface to be able to define such content and layout.<br>\n4. The ability to travel faster than light.</p>\n<p>We have attempted solutions to the first three things, and would like to share them with you. (Meanwhile feel free to attempt the fourth.) It&rsquo;s like Photoshop for building app content in the age of mobile platforms. Upvote the proposal and come hear the full story.</p>",
      "fullname": "Param Aggarwal",
      "id": 1424,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1293-netscape-for-mobile/json",
      "level": "Intermediate",
      "links": "https://www.youtube.com/watch?v=YDsK3NQWjBY (Sunil Pai's 'no-format content format' talk)\r\nhttps://www.youtube.com/watch?v=iG01gVs9Wpo (My flash talk at MetaRefresh 2014)\r\nhttps://www.youtube.com/watch?v=ZvXuW3tyQF0&t=6m35s (My flash talk at JSFoo 2013)",
      "name": "1293-netscape-for-mobile",
      "objective": "<p>Designing and serving content for multiple mobile and web platforms is hard. Come hear about some of the problems we faced, as Myntra migrated from serving fashion content on one platform to five platforms. How step by step, layouts and templates were pulled out from the app and into the server, to be freely changed without an app update.</p>",
      "proposer": "Param Aggarwal (~paramaggarwal)",
      "requirements": "<p>Understanding of the web and native apps in general.</p>",
      "section": "Content Design – full talk",
      "slides": "",
      "speaker": "Param Aggarwal (~paramaggarwal)",
      "submitted": "2015-01-20T10:46:07.072464Z",
      "title": "Netscape for Mobile",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1293-netscape-for-mobile",
      "votes": 21
    },
    {
      "bio": "<p>Works at Razorfish<br>\nEnjoy playing with frontend tools &amp; technologies.<br>\nWrote a book on AngularJS</p>",
      "comments": 0,
      "confirmed": true,
      "description": "<p>Frontend development for modern web apps has become complex with the need to support multiple browers and devices. At the same time there is an increased focus on innovative interactions across the different devices.<br>\nThis talk aims to touch upon a components based approach of UX, Design and Development of web apps.<br>\nWe&rsquo;ll see how tools like Google Polymer and Material Design principles help in this process and how it helps reduce the friction between frontend and backend developers on a project.</p>",
      "fullname": "Vinci Rufus",
      "id": 1423,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1292-building-application-frontends-the-web-components-/json",
      "level": "Intermediate",
      "links": "https://hasgeek.tv/vinci/speaking-in/681-using-camera-motion-detection-in-js-for-gestures-based-interaction\r\nhttp://www.slideshare.net/vincirufus/angular-js-and-magento\r\n",
      "name": "1292-building-application-frontends-the-web-components-",
      "objective": "<p>The talk aims to showcase a components based approach to designing and developing web apps and how it can significantly help improve productivity across various streams of UX, Visual Design and Development</p>",
      "proposer": "Vinci Rufus (~vinci)",
      "requirements": "",
      "section": "Application Design – full talk",
      "slides": "",
      "speaker": "Vinci Rufus (~vinci)",
      "submitted": "2015-01-20T09:13:04.283245Z",
      "title": " Building  Application frontends the Web Components Way ",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1292-building-application-frontends-the-web-components-",
      "votes": 5
    },
    {
      "bio": "<p>Senior Interactive Developer at SapientNitro. Keen in JS, Design and UX.</p>",
      "comments": 2,
      "confirmed": false,
      "description": "<p>Quick insight on how Device APIs that can interact with real world can be used to tailor the user experience for the mobile web based on various real world entities that a typical user deal with in their day-to-day life, thus making web not just interactive but also redefine the term &ldquo;Mobile Web&rdquo;.</p>",
      "fullname": "Santhosh Sundar",
      "id": 1422,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1291-redefining-mobile-web-ux-with-device-apis/json",
      "level": "Beginner",
      "links": "",
      "name": "1291-redefining-mobile-web-ux-with-device-apis",
      "objective": "<p>A crisp talk on enhancing the mobile web UX by harnessing the potential of JavaScript / HTML5 Device APIs.</p>",
      "proposer": "Santhosh Sundar (~gigacore)",
      "requirements": "",
      "section": "Application design – crisp talk",
      "slides": "",
      "speaker": "Santhosh Sundar (~gigacore)",
      "submitted": "2015-01-19T06:54:58.281661Z",
      "title": "Redefining Mobile Web UX with Device APIs",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1291-redefining-mobile-web-ux-with-device-apis",
      "votes": 11
    },
    {
      "bio": "<p>I have worked with different industries. I have experience of working in Electronics domain, Animation and Media, Ad Agency and IT. In last two and half years, I have participated in many hackathons and won almost all. My favourite time pass is innovating things.</p>",
      "comments": 3,
      "confirmed": false,
      "description": "<p>Being part of a like-minded group that works to achieve a mission, “Bring Innovations to Life”, we created a virtual kite flying application, which is a multiplayer game with second screen experience and we open it up for public. This application entertained many people for full day at Forum Value Mall, Bangalore. By seeing reaction of people our believe became strong, that lot more is still missing in the world. Technology has the potential to achieve many things. It&rsquo;s time for our community to open the hidden door.</p>\n<ol>\n<li>See technology as an enhancement to user experience  </li>\n<li>Every idea has its place  </li>\n<li>Understanding the power of innovation and provide backbone to it  </li>\n</ol>",
      "fullname": "parag gajjar",
      "id": 1421,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1290-tangible-solutions-by-application-design/json",
      "level": "Intermediate",
      "links": "www.paraggajjar.com/blog/",
      "name": "1290-tangible-solutions-by-application-design",
      "objective": "<p>Application development is not limited to screens. Many of us have started exploring new areas like virtual reality and IOT, and many of us are full of innovative ideas with different technologies. Due to lack of direction and market knowledge, ideas get diluted and does not come to life. My talk is about showcasing the market possibilities for application development using mobile, which will also be motivation for people who are full of ideas and want to achieve something by pushing limits of technologies. </p>",
      "proposer": "parag gajjar (~paraggajjar)",
      "requirements": "",
      "section": "Application design – crisp talk",
      "slides": "",
      "speaker": "parag gajjar (~paraggajjar)",
      "submitted": "2015-01-18T16:40:04.969590Z",
      "title": "Tangible Solutions by application design",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1290-tangible-solutions-by-application-design",
      "votes": 16
    },
    {
      "bio": "<p>Working as an Interactive Developer at Sapient Nitro, Bangalore. Key interests include JavaScript and hardware programming.</p>",
      "comments": 1,
      "confirmed": false,
      "description": "<p>Arduino is one of the most popular physical computing platforms available today. It is an amazing tool for both experienced and budding electronic enthusiasts. The best part: the entire Arduino project – both hardware and software – is open-source. I will be experimenting with the SparkFun Inventor&rsquo;s Kit that has the Arduino Uno RedBoard. The main microprocessor on the board is ATmega328. You can go from blinking a led to building home automation systems.</p>",
      "fullname": "Saloni Jain",
      "id": 1417,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1289-tinkering-the-spark/json",
      "level": "Beginner",
      "links": "",
      "name": "1289-tinkering-the-spark",
      "objective": "<p>Lets kickstart programming and hardware interaction with the Arduino programming language. I will be using the Spark Inventor&rsquo;s toolkit to create something fun.</p>",
      "proposer": "Saloni Jain (~salonijain)",
      "requirements": "",
      "section": "Application design – crisp talk",
      "slides": "",
      "speaker": "Saloni Jain (~salonijain)",
      "submitted": "2015-01-16T10:31:04.359616Z",
      "title": "Tinkering the spark",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1289-tinkering-the-spark",
      "votes": 12
    },
    {
      "bio": "<p>Hi, I&rsquo;m Dheeraj.</p>\n<p>I write Ruby &amp; JS at <a href=\"http://bangthetable.com\">Bang The Table</a>, Bangalore. I&rsquo;ve recently started learning Scala and being constantly amazed by its expressiveness. </p>\n<p>I&rsquo;m a member of &amp; presented talks in several meetups including Bangalore Ruby User Group, Chennai.rb and Bangalore Ember.js Meetup Group. I&rsquo;ve also helped organize India&rsquo;s first regional Ruby conference - <a href=\"http://gardencityruby.org\">Garden City Ruby Conference</a></p>\n<p>I love software design patterns, reverse engineering, cycling and <a href=\"https://www.google.co.in/search?q=kaju+katli\">Kaju Katli</a></p>\n<p>I&rsquo;m a proud opinionated Ember.js enthusiast. Go Hamster!</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>In a <a href=\"http://www.filamentgroup.com/lab/mv-initial-load-times.html\">recent analysis</a> by Filament Group, using a framework increases a page&rsquo;s first render time by several seconds. The larger the framework is, like Angular and Ember, the more performance penalties they incur (4 and 5 seconds).</p>\n<p>Isomorphic Javascript is a technique to minimize the perceived performance penalties for the end user, by rendering your page on the server using Node/IO, and serving the static HTML generated. This significantly decreases the time to first render, which effectively speeds up the site drastically for the end user. The framework will then be loaded asynchronously, and will take over once loaded to provide the interactivity. </p>\n<p><strong>Advantages</strong><br>\n1. This technique is especially useful in mobile devices, as seen from the analysis, where 3G speeds can cause ~5 seconds delay to the render time.<br>\n2. SEO benefits just like a server-sided app.<br>\n3. Progressive enhancement of the site, so the content loads first, and then is made interactive.  </p>\n<p>Considering this is MetaRefresh and not JSFoo, I&rsquo;ll be talking about this technique in general, talking about the various advantages in detail, along with the tradeoffs required to build this into your app. However, as for implementation details, I&rsquo;ll be talking from the context of <a href=\"http://emberjs.com/blog/2014/12/22/inside-fastboot-the-road-to-server-side-rendering.html\">Ember &amp; Fastboot</a>, <a href=\"http://dev.alexishevia.com/2014/08/isomorphic-apps-with-backbonejs-and.html\">Backbone &amp; React</a>, and <a href=\"https://prerender.io/\">Prerender.io</a>. </p>\n<p>Note that the <a href=\"https://www.meteor.com/\">Meteor Framework</a> is one of the most famous examples of Isomorphic Javascript. I haven&rsquo;t used it personally, but will try to learn &amp; include it in the talk :)</p>",
      "fullname": "Dheeraj Kumar",
      "id": 1416,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1288-render-your-single-page-app-on-the-server-with-iso/json",
      "level": "Intermediate",
      "links": "https://twitter.com/codepodu\r\nhttp://codepodu.com\r\nhttps://speakerdeck.com/codepodu",
      "name": "1288-render-your-single-page-app-on-the-server-with-iso",
      "objective": "<p>I&rsquo;ll attempt to help you speed up your app by rendering your client-side JS app on the server with Node.js/IO.js, hence improving your page&rsquo;s first render time.</p>",
      "proposer": "Dheeraj Kumar (~codepodu)",
      "requirements": "<p>Curiosity, and an open mind.</p>",
      "section": "Performance – full talk",
      "slides": "",
      "speaker": "Dheeraj Kumar (~codepodu)",
      "submitted": "2015-01-16T07:13:48.683037Z",
      "title": "Render your single-page app on the server with Isomorphic Javascript",
      "type": null,
      "url": "https://metarefresh.talkfunnel.com/2015/1288-render-your-single-page-app-on-the-server-with-iso",
      "votes": 5
    },
    {
      "bio": "<p>I come from a diverse background of Science, Mathematics, Statistics, Programming, Fine Arts &amp; Design. And what I do is to amalgamate and leverage each one of these to create smarter, intuitive, interactive Visualizations and Blended Experiences.</p>\n<p>I am an Architect XT - eXperience Technology, and primarily work with Instrumented Intelligence Function and Experience Research Function for Sapient Nitro.</p>",
      "comments": 2,
      "confirmed": false,
      "description": "<p>We often struggle with fixating technologies to create interactive content for our websites &amp; experiences, especially for mobile. This session will showcase examples, case studies &amp; prototypes of programming with HTML5 technologies, viz: Canvas, WebGL, SVG, DOM &amp; CSS, video, and will also dig deep down on possibilities &amp; application case studiesb. This session will also outline decision-making process to match implementation of these technologies to the application usage specifically for mobile implementation.</p>",
      "fullname": "Taran J Singh",
      "id": 1413,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1287-enabling-interactive-experiences-visualization-opt/json",
      "level": "Beginner",
      "links": "",
      "name": "1287-enabling-interactive-experiences-visualization-opt",
      "objective": "<p>Application &amp; Case Studies for Interactive Development &amp; Data Visualizations with UI technologies, viz: Canvas, WebGL, SVG, DOM &amp; CSS, video. And outlining principles for decision-making &amp; implementation of these for the mobile web.</p>",
      "proposer": "Taran J Singh (~taran-j)",
      "requirements": "<p>Curiosity</p>",
      "section": "Front-end build processes and tools – full talks",
      "slides": "",
      "speaker": "Taran J Singh (~taran-j)",
      "submitted": "2015-01-15T12:52:53.404550Z",
      "title": "Enabling Interactive experiences & Visualization Options for Mobile Web",
      "type": "",
      "url": "https://metarefresh.talkfunnel.com/2015/1287-enabling-interactive-experiences-visualization-opt",
      "votes": 22
    },
    {
      "bio": "<p>I come from a diverse background of Science, Mathematics, Statistics, Programming, Fine Arts &amp; Design. And what I do is to amalgamate and leverage each one of these to create smarter, intuitive, interactive Visualizations and Blended Experiences.</p>\n<p>I am an Architect XT - eXperience Technology, and primarily work with Instrumented Intelligence Function and Experience Research Function for Sapient Nitro.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>The metaphor of box has transformed into Glass.. or the display of tablets &amp; mobiles, and this has contained our thinking as well. We try to create an app or website for anything and everything new.<br>\n   This session is about an alternate future of experience development, where we design for humans instead of containing experiences inside glass box:\nBy:<br>\n1: making technology imvisible and seamlessly integrated into our lives.<br>\n2: leveraging human senses of smell, touch, hear and taste to create experiences apart from visually seeing them?<br>\n3: utilizing the potential of eversensing world of IOT, instrumented intelligence, computer vision, physical computing.<br>\n:\nTo:<br>\n1: engage specially abled people or people from any lingual or demography, equally.<br>\n2: create more human centric natural experiences with steeper or no learning curve at all<br>\n3: Give more control to us humans over the experience.</p>",
      "fullname": "Taran J Singh",
      "id": 1412,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1286-think-out-of-the-glass-natural-experiences/json",
      "level": "Beginner",
      "links": "",
      "name": "1286-think-out-of-the-glass-natural-experiences",
      "objective": "<p>Showcasing a transformational shift of focus from machine oriented experience development for &lsquo;Glass devices&rsquo;, to human centric experience development. Leveraging human senses to create natural experiences which are more closer and engaging to humans. And hence coining the term: &lsquo;Design for humans’  </p>",
      "proposer": "Taran J Singh (~taran-j)",
      "requirements": "<p>Curiosity </p>",
      "section": "Application Design – full talk",
      "slides": "",
      "speaker": "Taran J Singh (~taran-j)",
      "submitted": "2015-01-15T12:50:51.878245Z",
      "title": "Think out of the Glass | Natural Experiences",
      "type": "",
      "url": "https://metarefresh.talkfunnel.com/2015/1286-think-out-of-the-glass-natural-experiences",
      "votes": 18
    },
    {
      "bio": "<p>Experience Technology Specialist. Thought Leader. Interactive Development Manager @SapientNitro</p>",
      "comments": 1,
      "confirmed": false,
      "description": "<p>No developer wants old, outdated devices to prevent them from using awesome new APIs.</p>\n<p>With the platform variations in the market you are forced to assume that every Android WebView works differently. There are differences in:</p>\n<ul>\n<li>Which JavaScript APIs are available</li>\n<li>Support and syntax for CSS properties</li>\n<li>How your application&rsquo;s interface is rendered</li>\n<li>…and plenty more. You want to support as many versions of Android as possible, but it’s frustrating and time consuming.</li>\n</ul>\n<p>Source: www.crosswalk-project.org</p>",
      "fullname": "Sameer Gupta",
      "id": 1406,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1285-using-crosswalk-to-build-world-class-hybrid-apps/json",
      "level": "Intermediate",
      "links": "twitter.com/samunplugged\r\nwww.crosswalk-project.org",
      "name": "1285-using-crosswalk-to-build-world-class-hybrid-apps",
      "objective": "<p>As web designers use HTML5 to develop Hybrid apps we are faced with new challenges. Supporting a number of different WebViews! Each Android phone running your Hybrid (PhoneGap) App will use the default WebView available during runtime. What if the only WebView you had to worry about was the latest Chromium? </p>\n<p>In this talk, you will be introduced to one such open source project. Crosswalk! With Crosswalk you will only have to worry about one target browser.</p>",
      "proposer": "Sameer Gupta (~sameergupta)",
      "requirements": "<p>Curiosity</p>",
      "section": "Front-end build processes and tools – full talks",
      "slides": "",
      "speaker": "Sameer Gupta (~sameergupta)",
      "submitted": "2015-01-14T05:43:38.836833Z",
      "title": "Using Crosswalk to Build World Class Hybrid Apps",
      "type": "",
      "url": "https://metarefresh.talkfunnel.com/2015/1285-using-crosswalk-to-build-world-class-hybrid-apps",
      "votes": 12
    },
    {
      "bio": "<p>Iam a front end developer, designer at Genwi. At genwi we are developing hybrid apps (IOS, Android, HTML5) targeted towards content marketing world where design (written in HTML,CSS,JS) is decoupled from the actual code to run the apps. Visualising content is key focus in our apps and we take care of client requirements which are challenging both in terms of design and functionality.<br>\nIam an avid <a href=\"http://aseemagarwal.in/?k1=blog\">blogger</a> as well, reading and writing about technology, good design and any insights or experiences that I gain.</p>",
      "comments": 1,
      "confirmed": false,
      "description": "<p>Why study patterns?. A statement from the book <a href=\"http://www.goodreads.com/book/show/22022723-sketching-user-experiences?from_search=true\">&ldquo;Sketching User Experiences&rdquo;</a> by Bill Buxton says - &ldquo;Time spent developing a technique provides the foundation for the creation of the art.&rdquo;. In this case techniques are the many strategies designers and developers have already worked on while designing for the mobile ecosystem. Understanding what they have done will give us an insight of what works and what doesn&rsquo;t so that we can ourself create a unique solution.</p>\n<p>Specifically in this discussion we are looking at patterns where the challenge is to visualise content. There&rsquo;s a common pattern with any system that has the basic job of visualising a lot of content and it hasn&rsquo;t changed much with time. Three type of models are chosen and any interface has the challenge to visualise all these three.</p>\n<ol>\n<li>Representing the list of items.  </li>\n<li>A categorization of the items where we have different groups of articles.  </li>\n<li>The actual item itselft which is the eventual purpose.</li>\n</ol>\n<p>A simple example of this pattern being used, is in publications which has a list of articles categorised on different themes. It needs to showcase the list of articles, the different themes (tech, science, sports etc) on which articles are grouped and the article itself.</p>\n<p>Each model above is unique and present its own challenges especially for mobile. We&rsquo;ll first discuss the significance itself of each model and then lot of real life examples that have tried to solve them.<br>\nFor instance, categorization which also serves as navigation for the app, has lot of patterns.</p>\n<ul>\n<li>The left nav flyout menu.</li>\n<li>Top navigation or do nothing.</li>\n<li>Full screen menu</li>\n<li>Carousel+.</li>\n</ul>\n<p>It is also important to measure and analyse each pattern on the yardsticks of good design. That will help us understand what problems is each pattern solving and as such their true purpose. Some of the points include but not limited to</p>\n<ul>\n<li>The importance of whitespace and boundaries in design.</li>\n<li>User attention span.</li>\n<li>Utilising touch gestures effectively.</li>\n<li>The case of design discovery.</li>\n</ul>\n<p>Every designer is working in a unique context and set of constraints in which they are trying to represent their content model. Learning about these patterns will help him/her objectively analyse what all things he should take care of design wise, so that he can give the best fit solution.</p>",
      "fullname": "Aseem Agarwal",
      "id": 1401,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1284-scaling-down-for-mobile-insight-into-design-patter/json",
      "level": "Intermediate",
      "links": "aseemagarwal.in/?k1=portfolio\r\ngithub.com/agaase\r\nmedium.com/@designalysed",
      "name": "1284-scaling-down-for-mobile-insight-into-design-patter",
      "objective": "<p>The phrase &ldquo;scaling down&rdquo; in the title tries to convey more than its literal meaning. It is the scaling down of the whole thought process to take a mobile first approach towards developing websites where content is the key focus.<br>\nIn this talk we will discuss patterns and design considerations that one should take care of, when working on websites which have the business of showcasing content. Over time web designers have come up with innovative solutions for many problems related to visualisation of content on mobile.  We will discuss those patterns analysing them in terms of basics of design to find out what works best in what context.</p>",
      "proposer": "Aseem Agarwal (~agaase19)",
      "requirements": "",
      "section": "Content Design – full talk",
      "slides": "",
      "speaker": "Aseem Agarwal (~agaase19)",
      "submitted": "2015-01-12T16:23:35.716994Z",
      "title": "Scaling down for Mobile - Insight into design patterns for content based sites.",
      "type": "",
      "url": "https://metarefresh.talkfunnel.com/2015/1284-scaling-down-for-mobile-insight-into-design-patter",
      "votes": 6
    },
    {
      "bio": "<p>I am Kiran, a JS enthusiast. Knowing and experimenting new things in the FE space has been my passion. I love the concept of framework and open source.  </p>",
      "comments": 1,
      "confirmed": false,
      "description": "<p>How about a Library which can do all of the above mentioned items and all around 4KB(compressed file)  </p>",
      "fullname": "Kiran A",
      "id": 1400,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1283-awesome-js/json",
      "level": "Intermediate",
      "links": "https://github.com/keplerlab/Interactive/tree/master/awesome",
      "name": "1283-awesome-js",
      "objective": "<ul>\n<li>Showcasing awesome.js library which can \nResponsive image solution<br>\nLazyload<br>\nCapture image path value from json and load it dynamically<br>\nLow resolution to high resolution switcher. If the device is retina display then it loads the retina image and for other devices/browsers it loads the high resolution images provided.<br>\nSupport small breakpoint landscape mode<br>\nSupport XL breakpoint<br>\nSupport iFrame lazyload<br>\nHave base path for images to reduce repetitive base path tagged with images.<br>\nBackground image support and you can lazy load that too<br>\nRetina Support<br>\nAngular support<br>\nCompletely customizable options where users can change the default settings.<br>\nSupport all modern browsers (desktop and touch devices) IE8 and above<br>\nOnly native JS – No jQuery or any library dependency. For Angular, users have to download angular in their package but we provide the angular directive.</li>\n</ul>",
      "proposer": "Kiran A (~jsgeek)",
      "requirements": "",
      "section": "Application design – crisp talk",
      "slides": "",
      "speaker": "Kiran A (~jsgeek)",
      "submitted": "2015-01-12T14:07:04.631247Z",
      "title": "Awesome.js",
      "type": "",
      "url": "https://metarefresh.talkfunnel.com/2015/1283-awesome-js",
      "votes": 10
    },
    {
      "bio": "<ul>\n<li>Specialist, eXperience Technology - SapientNitro</li>\n<li>JavaScript hacker / Proficient in creating real-time scalable web applications and performant websites using Angular, Backbone and Node.js + frameworks.</li>\n<li>JS enthusiast from the dawn of the JS era! :)</li>\n<li>Winner - Yahoo! Open Hack 2012, Bangalore</li>\n</ul>",
      "comments": 1,
      "confirmed": false,
      "description": "<p>ReactJS is not a full featured MVC framework and does not intend to be. It&rsquo;s only the V in MV*. What differentiates React from other frameworks s it&rsquo;s render approach. Since DOM manipulations are slow, React replicates the DOM virtually. Your application talks to the Virtual DOM which is really fast, and then React diffs the virtual DOM with the real DOM and applies all changes efficiently.</p>\n<p><strong> About Flux Architecture:</strong></p>\n<p>Flux is the application architecture that Facebook uses for building client-side web applications. It complements React&rsquo;s composable view components by utilizing a unidirectional data flow. It&rsquo;s more of a pattern rather than a formal framework, and you can start using Flux immediately without a lot of new code.</p>\n<p>It&rsquo;s based on one simple principle:<br>\n&ldquo;Data moves in one direction through your application&rdquo;. </p>\n<p><img alt=\"Flux Application architecture\" src=\"https://d262ilb51hltx0.cloudfront.net/max/1420/1*ZvLUQRHVsW1eWBN9sJQJDg.jpeg\" title=\"Basic Flux Data Flow\"></p>\n<p>We&rsquo;ll explore how all this translates to the real world scenario! :)</p>",
      "fullname": "Rakesh Menon",
      "id": 1399,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1282-using-reactjs-with-flux-to-boost-performance-for-m/json",
      "level": "Intermediate",
      "links": "http://twitter.com/rakeshmenon13\r\nhttp://in.linkedin.com/in/menonrakesh",
      "name": "1282-using-reactjs-with-flux-to-boost-performance-for-m",
      "objective": "<ul>\n<li>Understand how the Flux architecture is different from MVC (Why did Facebook prefer Flux over MVC?)</li>\n<li>Discuss &ldquo;Unidirectional data flow&rdquo;</li>\n<li>Create a short application using React.js and Flux architecture!</li>\n<li>Usage in the mobile environment</li>\n</ul>",
      "proposer": "Rakesh Menon (~sublimecoder)",
      "requirements": "<p>An open mind and otherwise, a laptop (if you want to work with me as I create the application live!)</p>",
      "section": "Application Design – full talk",
      "slides": "http://fluxpres.sublimecoder.com/",
      "speaker": "Rakesh Menon (~sublimecoder)",
      "submitted": "2015-01-12T08:12:25.915806Z",
      "title": "Using ReactJS (with Flux) to boost performance for mobile webapps",
      "type": "",
      "url": "https://metarefresh.talkfunnel.com/2015/1282-using-reactjs-with-flux-to-boost-performance-for-m",
      "votes": 14
    },
    {
      "bio": "<ul>\n<li>Pursuing a career in the field of Information Technology for about 5 and a half years now</li>\n<li>Appreciating the nuances of how the &lsquo;job gets done&rsquo; across different industries&rsquo;s IT needs</li>\n<li>Startup oriented (Love the concept of Lean startup and Minimum viable product)</li>\n<li>Passionate about programming and learning new technologies.</li>\n<li>Learning from and contributing to various open source technologies and forums</li>\n<li>Extensive experience as a Java and JavaScript toolkit programmer. Beginner skills in Hack, Dart  and Nodejs</li>\n</ul>",
      "comments": 0,
      "confirmed": true,
      "description": "<p>Delivering a fast web experience requires a lot of work by the browser. Most of this work is hidden from us as web developers: we write the markup, and a nice looking page comes out on the screen. But how exactly does the browser go from consuming our HTML, CSS, and JavaScript to rendered pixels on the screen?</p>\n<p>Optimizing for performance is all about understanding what happens in these intermediate steps between receiving the HTML, CSS, and JavaScript bytes and the required processing to turn them into rendered pixels - that’s the critical rendering path.</p>\n<p>Optimizing the critical rendering path is critical for improving performance of our pages. The goal is to prioritize and display the content that relates to the primary action the user wants to take on a page.</p>",
      "fullname": "Brameshmadhav Srinivasan",
      "id": 1398,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1281-perffirst-optimizing-the-critical-rendering-path/json",
      "level": "Beginner",
      "links": "My blog on understanding critical rendering path : http://juvenileoutpost.blogspot.in/2015/03/perffirst-understanding-critical.html\r\nCRP detail : https://developers.google.com/web/fundamentals/performance/critical-rendering-path/\r\nHow to Optimize : https://developers.google.com/web/fundamentals/performance/\r\nChrome plugin developed by my colleague and me for measuring and optimizing : https://chrome.google.com/webstore/detail/analyze-page-performance/hemibacgndhdhkfahkjdedjdgfapmfki \r\nIlya's talk on the same topic : https://www.youtube.com/watch?v=YV1nKLWoARQ",
      "name": "1281-perffirst-optimizing-the-critical-rendering-path",
      "objective": "<ul>\n<li>Understand the browser&rsquo;s Critical rendering Path</li>\n<li>How to use the modern day tools (dev tools, firebug etc) to improve Performance by optimizing the Critical rendering path</li>\n<li>Demo of pages before and after optimization</li>\n<li>How to use page insights and other tools to analyse the performace of the page.</li>\n</ul>",
      "proposer": "Brameshmadhav Srinivasan (~sbmadhav)",
      "requirements": "<p>A laptop to work out examples as I show them. Also, a good pre-read would be <a href=\"http://juvenileoutpost.blogspot.in/2015/03/perffirst-understanding-critical.html\">http://juvenileoutpost.blogspot.in/2015/03/perffirst-understanding-critical.html</a></p>",
      "section": "Performance – crisp talk",
      "slides": "http://www.slideshare.net/sbmadhav/optimizing-the-critical-rendering-path-meta-refresh-2015",
      "speaker": "Brameshmadhav Srinivasan (~sbmadhav)",
      "submitted": "2015-01-12T07:45:30.109374Z",
      "title": "#Perffirst - Optimizing the Critical Rendering Path",
      "type": "",
      "url": "https://metarefresh.talkfunnel.com/2015/1281-perffirst-optimizing-the-critical-rendering-path",
      "votes": 19
    },
    {
      "bio": "<p>Anand is the chief data scientist at <a href=\"https://gramener.com/\">Gramener</a>. He and his team explore insights from data and communicates these as visual stories.</p>\n<p>Anand has an MBA from IIM Bangalore and a B.Tech from IIT Madras. He has worked at IBM, Lehman Brothers, The Boston Consulting Group and Infosys Consulting. He blogs at <a href=\"http://www.s-anand.net/\">s-anand.net</a>.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>For an artist, creating a <a href=\"https://www.youtube.com/watch?v=zDZFcDGpL4U\">doodle</a> is easy. They just draw it and record their process.</p>\n<p>For a programmer without any design experience, a doodle borders on the unapproachable.</p>\n<p>This talk is about how you can create a doodle from scratch without having to draw a single stroke. It covers:</p>\n<ul>\n<li>How to storyboard a doodle</li>\n<li>Finding clipart</li>\n<li>Converting pictures to vector art</li>\n<li>Jittering them to make them look hand-drawn</li>\n<li>Converting fonts to centerline fonts</li>\n<li>Animating the strokes, making them look hand-drawn</li>\n</ul>",
      "fullname": "Anand S",
      "id": 1392,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1280-automating-doodling/json",
      "level": "Intermediate",
      "links": "",
      "name": "1280-automating-doodling",
      "objective": "<p>You&rsquo;ve probably seen <a href=\"https://www.youtube.com/watch?v=zDZFcDGpL4U\">animated doodles</a> before. These doodles are engaging for three reasons:</p>\n<ol>\n<li>The hand-made drawings feel personal and human  </li>\n<li>The animations feels like you&rsquo;re watching an expert artist draw fast  </li>\n<li>The voice-over focuses attention further, making the experience mesmerising</li>\n</ol>\n<p>Creating these by hand requires a level of expertise in drawing that takes practice.</p>\n<p>This talk teaches you how to create a doodle programmatically, with no design experience.</p>",
      "proposer": "Anand S (~sanand0)",
      "requirements": "",
      "section": "Content Design – full talk",
      "slides": "",
      "speaker": "Anand S (~sanand0)",
      "submitted": "2015-01-05T15:36:49.488820Z",
      "title": "Automating doodling",
      "type": "",
      "url": "https://metarefresh.talkfunnel.com/2015/1280-automating-doodling",
      "votes": 9
    },
    {
      "bio": "<p><a href=\"http://www.milkandcigarettes.so/justass.html\">http://www.milkandcigarettes.so/justass.html</a></p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>Playing games has always been an intergral part of growing up. We are always thrilled with the new and unique interactions, story, music and art that each game offers us. From 8-bit games to something as gorgeous as GTA 5, we have always been in wonderment from the experience we get during gameplay. This session, we try to decipher the integral elements that help make these experiences so awesome and in turn, inspire us to create better art.</p>",
      "fullname": "Jaison Justus",
      "id": 1390,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1279-why-we-play-games/json",
      "level": "Beginner",
      "links": "",
      "name": "1279-why-we-play-games",
      "objective": "<p>Appreciate, Observe and Play more games.</p>",
      "proposer": "Jaison Justus (~jaisonjustus)",
      "requirements": "",
      "section": "Application design – crisp talk",
      "slides": "",
      "speaker": "Jaison Justus (~jaisonjustus)",
      "submitted": "2015-01-04T11:12:18.441599Z",
      "title": "Why we play games?",
      "type": "",
      "url": "https://metarefresh.talkfunnel.com/2015/1279-why-we-play-games",
      "votes": 7
    },
    {
      "bio": "<p>Sonal Raj is a hacker, pythonista, big data believer and a technology dreamer. He has a passion for design and is an artist at heart. He blogs about technology, gadgets and design at <a href=\"http://www.sonalraj.com/.\">http://www.sonalraj.com/.</a> When not working on projects, he can be found travelling, stargazing or reading.<br>\nSonal currently works at Goldman Sachs. He has been a speaker at PyCon India and local Meetups and has also published articles and research papers in leading magazines and international journals. He loves to work on community projects and has contributed to several open source projects.  </p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>&ldquo;Simplicity is the ultimate sophistication&rdquo;. The material design brings back a sense of simplicity, precision and elegance to the tools that are developed for modern screens. It brings in a set of advanced design trends, which do not require any additional hardware or tools to be implemented. The core area that this talk will focus on are enlisted below:</p>\n<ul>\n<li>What is Material Design?</li>\n<li>Principles of MUI design</li>\n<li>Properties that make material</li>\n<li>3D and animation</li>\n<li>style, icons, images, …, LnF</li>\n<li>material design for web development</li>\n<li>cross device development with material.</li>\n</ul>\n<p>The talk is aimed to introduce the Material Design Paradigm along with the advantages of it being implemented using the already popular tools - HTML5, CSS3 and Javascript, to design web interfaces that are not only aesthetically pleasing but also simple to use.  </p>",
      "fullname": "Sonal Raj",
      "id": 1385,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1278-how-material-ui-can-redefine-web-development/json",
      "level": "Intermediate",
      "links": "http://in.linkedin.com/in/sonalraj/\r\nhttp://www.sonalraj.com/\r\nhttp://www.slideshare.net/sonal-raj/neo4j-and-python-pycon-india-2014-talk\r\nhttps://www.youtube.com/watch?v=pixhXQd0oe4\r\nhttps://www.youtube.com/watch?v=bp1NmA4rZuI\r\n",
      "name": "1278-how-material-ui-can-redefine-web-development",
      "objective": "<p>The <strong>Material UI</strong> of Android 5.0 is not only a mobile interface design paradigm, it also possesses the potential to change the way we design modern webpages . . for the better. This talk will look into the features and properties that Material Design brings to the designer&rsquo;s table, and how design inspirations from Material UI can help in creating amazing web pages.</p>",
      "proposer": "Sonal Raj (~sonalraj)",
      "requirements": "<p>This talk is aimed to be more of an informative and insightful experience. However, if &lsquo;hands-on&rsquo; is your game, you will need a basic web development environment setup on any platform. Basic knowledge of front-end design will help you to collect more from this talk, however, if you have just started, you can still learn a lot.</p>",
      "section": "Content Design – full talk",
      "slides": "http://www.slideshare.net/sonal-raj/slides-proposal-draft",
      "speaker": "Sonal Raj (~sonalraj)",
      "submitted": "2014-12-24T14:31:36.027064Z",
      "title": "How Material UI can redefine Web Development",
      "type": "",
      "url": "https://metarefresh.talkfunnel.com/2015/1278-how-material-ui-can-redefine-web-development",
      "votes": 14
    },
    {
      "bio": "<p>Apoorv Saxena is a programmer at heart, weekend Cook and an occasional photographer. He has worked at both large organisations and startups, evangelising Backend and Front End teams. He believes in polygot programming and uses the best tools at hand to create a performant product.</p>",
      "comments": 0,
      "confirmed": true,
      "description": "<p>Rendering performance on the modern web is messy, especially when talking about games, mobile and HTML5. The web was never designed to do real-time animation, but we’re trying to teach this old dog yet another round of new tricks so it can compete with the fluid, animation-heavy experiences the mobile touch device revolution  has trained users to expect. Let’s blow the covers off of what’s going on when the browser renders your game and associated animations. Rather than do this by explaining all the complicated technology involved, your humble host will discuss the best practices and show you what it looks like when we do performance profiling to run your games at 60fps. We’ll bounce from JavaSript and CSS all the way down to the GPU and back using the tools built to analyze Chrome&rsquo;s performance.</p>",
      "fullname": "Apoorv Saxena",
      "id": 1356,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1277-running-mobile-games-at-60fps/json",
      "level": "Intermediate",
      "links": "Hacking to be Performant Talk, Meta Refresh Delhi Runup http://www.slideshare.net/ApoorvSaxena/hacking-to-be-performant",
      "name": "1277-running-mobile-games-at-60fps",
      "objective": "<ul>\n<li>Performance profiling your HTML5 Games</li>\n<li>Discuss performance best practices to run your Game at 60fps</li>\n</ul>",
      "proposer": "Apoorv Saxena (~apoorv-saxena)",
      "requirements": "",
      "section": "Performance – full talk",
      "slides": "",
      "speaker": "Apoorv Saxena (~apoorv-saxena)",
      "submitted": "2014-12-16T14:34:51.996453Z",
      "title": "Running Mobile Games at 60fps",
      "type": "",
      "url": "https://metarefresh.talkfunnel.com/2015/1277-running-mobile-games-at-60fps",
      "votes": 5
    },
    {
      "bio": "<p>Thomas is coding the webs for 16 years, organizer of JSConf.Asia, UX mentor at JFDI.Asia and chief troublemaker at webtech startup Temasys in Singapore.</p>",
      "comments": 0,
      "confirmed": true,
      "description": "<p>Your mobile phone is likely to already support technology that makes real-time communication embedable into your web-app and with modern open-source libraries it is easier then ever. We&rsquo;re going to explore some of the scenarios in which communication helps your use-case and UX and how to get it into your app.</p>",
      "fullname": "Thomas Gorissen",
      "id": 1354,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1276-real-time-communications-on-mobile/json",
      "level": "Beginner",
      "links": "http://www.webrtc.org, http://getaroom.io, http://github.com/Temasys/SkylinkJS",
      "name": "1276-real-time-communications-on-mobile",
      "objective": "<p>Educate about the support of modern web technologies like WebRTC on mobile phones and the power of embedded communications in your website or webapp.</p>",
      "proposer": "Thomas Gorissen (~serrynaimo)",
      "requirements": "<p>Basic understanding of JavaScript and HTML and how the web works.</p>",
      "section": "Application Design – full talk",
      "slides": "",
      "speaker": "Thomas Gorissen (~serrynaimo)",
      "submitted": "2014-12-07T18:55:03.411363Z",
      "title": "Real-time communications on mobile",
      "type": "",
      "url": "https://metarefresh.talkfunnel.com/2015/1276-real-time-communications-on-mobile",
      "votes": 7
    },
    {
      "bio": "<p>I&rsquo;m a Full Stack Developer with 8 years of experience across platforms. Currently working with Gainsight. Building scalable applications is what attracts me most. Call me anytime for any new challenge for Nodejs, Mongo, Redis and Android..  </p>\n<p>SO: <a href=\"http://stackoverflow.com/users/229106/ankitjaininfo\">http://stackoverflow.com/users/229106/ankitjaininfo</a><br>\nLN: <a href=\"https://www.linkedin.com/in/ankitjaininfo\">https://www.linkedin.com/in/ankitjaininfo</a></p>",
      "comments": 0,
      "confirmed": false,
      "description": "<ol>\n<li>HTTP1.1 and current limitations. Where are we. How developers mitigate these limitations. The need of a new protocol.  </li>\n<li>A little background of HTTP2.0, how it got started, current status, future adoption.  </li>\n<li>HTTP2.0 Features: Multiplexing, Server Push, Header Compression.  </li>\n<li>How it affects web developer&rsquo;s job.  </li>\n<li>What a Web Developer need to worry about.  </li>\n</ol>",
      "fullname": "Ankit Jain",
      "id": 1353,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1275-http-2-and-whats-it-all-about/json",
      "level": "Intermediate",
      "links": "",
      "name": "1275-http-2-and-whats-it-all-about",
      "objective": "<ol>\n<li>Create awareness of upcoming HTTP 2 protocol.  </li>\n<li>As a web-developer what you need to be prepared of.</li>\n</ol>",
      "proposer": "Ankit Jain (~ankitjaininfo)",
      "requirements": "",
      "section": "Performance – full talk",
      "slides": "",
      "speaker": "Ankit Jain (~ankitjaininfo)",
      "submitted": "2014-12-07T17:53:13.417010Z",
      "title": "HTTP 2  and What's it all about",
      "type": "",
      "url": "https://metarefresh.talkfunnel.com/2015/1275-http-2-and-whats-it-all-about",
      "votes": 11
    },
    {
      "bio": "<p>I am working on jQuery for last 8 years and worked on various projects using open source platform.<br>\nActively participate in jQuery forum and ranked 3rd in the ladder board.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>Select correct version of jQuery version based upon what version your browser supported.<br>\nChoose correct selector.<br>\nUse find instead of context<br>\nCaching the selector and why<br>\nChaining the query<br>\nGroup up the selectors.<br>\nBest way to manipulate dom<br>\nAvoid css itreation<br>\nhow to delegate events<br>\nhow to stop propagation and why<br>\nhow and why abort ajax call<br>\nwhy to avoid nested ajax call.</p>",
      "fullname": "Subhranil Dalal",
      "id": 1274,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1274-digesting-jquery/json",
      "level": "Intermediate",
      "links": "",
      "name": "1274-digesting-jquery",
      "objective": "<p>How to avoid common mistakes we made during our jQuery coding unknowingly.<br>\nHow you can enhance jQuery code and performance very easily.<br>\nWhat are impacts of wrong selector.<br>\nDo&rsquo;s and Dont&rsquo;s of jQuery.  </p>",
      "proposer": "Subhranil Dalal (~subhranil)",
      "requirements": "",
      "section": "Performance – full talk",
      "slides": "",
      "speaker": "Subhranil Dalal (~subhranil)",
      "submitted": "2014-10-07T10:43:17.022416Z",
      "title": "Digesting jQuery",
      "type": "",
      "url": "https://metarefresh.talkfunnel.com/2015/1274-digesting-jquery",
      "votes": 3
    },
    {
      "bio": "<p>Later</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>DCV (Desktop Cloud Visulalization) is an alternative approach for making existing desktop apps available from inside of a browser. We will discuss how this approach mixed with the linux containerization technologies like Docker can provide with a cost effective app marketplace for all.</p>",
      "fullname": "Anubhav Sinha",
      "id": 1273,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1273-dcv-with-docker-better-than-building-web-apps/json",
      "level": "Beginner",
      "links": "",
      "name": "1273-dcv-with-docker-better-than-building-web-apps",
      "objective": "<p>DCV (Desktop Cloud Visulalization) is an alternative approach for making existing desktop apps available from inside of a browser. We will discuss how this approach mixed with the linux containerization technologies like Docker can provide with a cost effective app marketplace for all.</p>",
      "proposer": "Anubhav Sinha (~anubhavsinha)",
      "requirements": "<p>Interest in various app dev approaches.</p>",
      "section": "Application design – crisp talk",
      "slides": "",
      "speaker": "Anubhav Sinha (~anubhavsinha)",
      "submitted": "2014-10-06T16:23:33.289386Z",
      "title": "DCV with Docker - better than building web apps",
      "type": "",
      "url": "https://metarefresh.talkfunnel.com/2015/1273-dcv-with-docker-better-than-building-web-apps",
      "votes": 4
    },
    {
      "bio": "<p>I am a full time freelance developer, got into python Development and has experience building web applications using the Google appengine platform and its services. I love working on interesting cs projects. Recently I have been developing Android apps using Phonegap and explored Polymer as a very interesting futuristic concept.</p>",
      "comments": 0,
      "confirmed": false,
      "description": "<p>Web Components usher in a new era of web development based on encapsulated and interoperable custom elements that extend HTML itself. Built atop these new standards, Polymer makes it easier and faster to create anything from a button to a complete application across desktop, mobile, and beyond.</p>",
      "fullname": "indu s",
      "id": 1271,
      "json_url": "https://metarefresh.talkfunnel.com/2015/1271-polymer-the-future-of-front-end-frameworks/json",
      "level": "Beginner",
      "links": "",
      "name": "1271-polymer-the-future-of-front-end-frameworks",
      "objective": "<p>This talk is about Polymer, a front end framework which came out of Google and provides some neat ideas on how front end developemnt should be done.</p>",
      "proposer": "indu s (~indu28)",
      "requirements": "<p>A basic understanding of front end frameworks like Angular JS etc.</p>",
      "section": "Front-end build processes and tools – full talks",
      "slides": "",
      "speaker": "indu s (~indu28)",
      "submitted": "2014-10-06T15:46:13.744673Z",
      "title": "Polymer: The future of front-end frameworks",
      "type": "",
      "url": "https://metarefresh.talkfunnel.com/2015/1271-polymer-the-future-of-front-end-frameworks",
      "votes": 5
    }
  ],
  "rooms": [
    {
      "bgcolor": "6f87ff",
      "description": "",
      "json_url": null,
      "name": "mlr-convention-centre-jp-nagar/conference-hall",
      "title": "Conference hall",
      "url": null,
      "venue": "mlr-convention-centre-jp-nagar"
    }
  ],
  "schedule": [
    {
      "date": "2015-04-16",
      "slots": [
        {
          "sessions": [
            {
              "description": "<p>The web’s built on an open protocol, and was always meant to be an inclusive network. The requirements for consuming (and contributing to) content on the web are pretty straightforward — a web browser running on any device and an internet connection. </p>\n<p>While we all understand this, our understanding doesn’t necessarily translate into an unbiased effort at crafting experiences on the web. More often than not, the web experience on mobile gets stifled, in turn affecting those whose window to the web are these devices in their pockets.</p>\n<p>This talk will be based around my observation of where the state of web (and the community) is headed.</p>",
              "description_text": "The web’s built on an open protocol, and was always meant to be an inclusive network. The requirements for consuming (and contributing to) content on the web are pretty straightforward — a web browser running on any device and an internet connection. \r\n\r\nWhile we all understand this, our understanding doesn’t necessarily translate into an unbiased effort at crafting experiences on the web. More often than not, the web experience on mobile gets stifled, in turn affecting those whose window to the web are these devices in their pockets.\r\n\r\nThis talk will be based around my observation of where the state of web (and the community) is headed.",
              "end": "2015-04-16T04:45:00Z",
              "feedback_url": "https://metarefresh.talkfunnel.com/2015/1334-whats-your-web/feedback",
              "id": 8,
              "is_break": false,
              "json_url": "https://metarefresh.talkfunnel.com/2015/1334-whats-your-web/json",
              "proposal": 1609,
              "proposal_url": "https://metarefresh.talkfunnel.com/2015/1334-whats-your-web",
              "room": "mlr-convention-centre-jp-nagar/conference-hall",
              "section_name": "applicationdesign-fulltalk",
              "section_title": "Application Design – full talk",
              "speaker": "Souvik Das Gupta",
              "speaker_bio": "<p>I am a co-founder of <a href=\"http://miranj.in\">Miranj</a>, a web design studio in New Delhi, and have been making websites for a few years now. I am a programmer at heart, who enjoys travelling, music, coffee and food, and has somehow managed to complete a couple of marathons this year.</p>",
              "speaker_bio_text": "I am a co-founder of [Miranj](http://miranj.in), a web design studio in New Delhi, and have been making websites for a few years now. I am a programmer at heart, who enjoys travelling, music, coffee and food, and has somehow managed to complete a couple of marathons this year.",
              "start": "2015-04-16T04:00:00Z",
              "technical_level": "Intermediate",
              "title": "What’s your web?",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#8-whats-your-web"
            }
          ],
          "slot": "09:30"
        },
        {
          "sessions": [
            {
              "description": "<p>This is the story of a four people UI team at Ideadevice moving from a fairly complicated traditional MVC app using YUI to react and flux, the lessons learned, the joys and pains of it. The results are fairly positive and we are excited to share the experience with a wider community.</p>\n<p>One of the most striking facts about Flux is that unlike react, it is a specification rather than a implementation. Multiple implementations of the idea exist and they all differ in some way or the other, leading to much confusion and newcomers tend to get lost in all the details. This talk aims to clarify things a bit and help people understand the ideas.</p>\n<p>Talk will mostly concentrate on the original Flux architecture. This is not a react talk and we will only cover the minimum bits of it required to understand the concepts presented. Prior experience wont be necessary. Structuring large complex applications and testing will also be taken seriously.</p>\n<p>Individual components of the architecture like the dispatcher and stores will be analyzed in detail and how we implemented each of them with minimum 3rd party libraries.</p>\n<p>Eventually we would walk through a simple app, show how the data flows through and how actions propagate.  </p>",
              "description_text": "This is the story of a four people UI team at Ideadevice moving from a fairly complicated traditional MVC app using YUI to react and flux, the lessons learned, the joys and pains of it. The results are fairly positive and we are excited to share the experience with a wider community.\r\n\r\nOne of the most striking facts about Flux is that unlike react, it is a specification rather than a implementation. Multiple implementations of the idea exist and they all differ in some way or the other, leading to much confusion and newcomers tend to get lost in all the details. This talk aims to clarify things a bit and help people understand the ideas.\r\n\r\nTalk will mostly concentrate on the original Flux architecture. This is not a react talk and we will only cover the minimum bits of it required to understand the concepts presented. Prior experience wont be necessary. Structuring large complex applications and testing will also be taken seriously.\r\n\r\nIndividual components of the architecture like the dispatcher and stores will be analyzed in detail and how we implemented each of them with minimum 3rd party libraries.\r\n\r\nEventually we would walk through a simple app, show how the data flows through and how actions propagate.\r\n",
              "end": "2015-04-16T05:30:00Z",
              "feedback_url": "https://metarefresh.talkfunnel.com/2015/1340-how-i-learned-to-stop-worrying-and-love-the-flux/feedback",
              "id": 48,
              "is_break": false,
              "json_url": "https://metarefresh.talkfunnel.com/2015/1340-how-i-learned-to-stop-worrying-and-love-the-flux/json",
              "proposal": 1631,
              "proposal_url": "https://metarefresh.talkfunnel.com/2015/1340-how-i-learned-to-stop-worrying-and-love-the-flux",
              "room": "mlr-convention-centre-jp-nagar/conference-hall",
              "section_name": "frontend-full",
              "section_title": "Front-end build processes and tools – full talks",
              "speaker": "Jaseem abid",
              "speaker_bio": "<p>I&rsquo;m Jaseem Abid, currently hacking both UI and backend at Ideadevice. I&rsquo;ve been fiddling with JS for around 4 years and have done the same old story of jQuery to Backbone to every other MVC framework out there. Codes JS and Python for a living. Haskell for everything else.</p>\n<ol>\n<li><a href=\"https://twitter.com/jaseemabid/\">https://twitter.com/jaseemabid/</a>  </li>\n<li><a href=\"https://github.com/jaseemabid\">https://github.com/jaseemabid</a></li>\n</ol>",
              "speaker_bio_text": "I'm Jaseem Abid, currently hacking both UI and backend at Ideadevice. I've been fiddling with JS for around 4 years and have done the same old story of jQuery to Backbone to every other MVC framework out there. Codes JS and Python for a living. Haskell for everything else.\r\n\r\n1. https://twitter.com/jaseemabid/\r\n2. https://github.com/jaseemabid",
              "start": "2015-04-16T04:45:00Z",
              "technical_level": "Advanced",
              "title": "How I Learned to Stop Worrying and Love the Flux",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#48-how-i-learned-to-stop-worrying-and-love-the-flux"
            }
          ],
          "slot": "10:15"
        },
        {
          "sessions": [
            {
              "description": "",
              "description_text": "",
              "end": "2015-04-16T06:00:00Z",
              "feedback_url": null,
              "id": 3,
              "is_break": true,
              "json_url": null,
              "proposal": null,
              "proposal_url": null,
              "room": null,
              "section_name": null,
              "section_title": null,
              "speaker": "",
              "speaker_bio": "",
              "speaker_bio_text": "",
              "start": "2015-04-16T05:30:00Z",
              "technical_level": null,
              "title": "Tea Break",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#3-tea-break"
            }
          ],
          "slot": "11:00"
        },
        {
          "sessions": [
            {
              "description": "<p>When someone says “Mobile Web”, we generalise it to media queries, minified code, gzipping and employing other paradigms, and thus we often fall prey to this trap. Neglecting Javascript performance issues on mobile, with less memory having templating, adding a cool MVC framework blindfoldedly just to make ourselves comfortable is a bad attitude. A deep understanding of Javascript engine with a topping of lower level architecture  and how it binds with DOM, where does we often fail, what all things we take for granted that causes a fail for gaining performance and what all we can work upon to gain it back.  </p>",
              "description_text": "When someone says “Mobile Web”, we generalise it to media queries, minified code, gzipping and employing other paradigms, and thus we often fall prey to this trap. Neglecting Javascript performance issues on mobile, with less memory having templating, adding a cool MVC framework blindfoldedly just to make ourselves comfortable is a bad attitude. A deep understanding of Javascript engine with a topping of lower level architecture  and how it binds with DOM, where does we often fail, what all things we take for granted that causes a fail for gaining performance and what all we can work upon to gain it back.\r\n",
              "end": "2015-04-16T06:45:00Z",
              "feedback_url": "https://metarefresh.talkfunnel.com/2015/1336-i-will-javascript-you/feedback",
              "id": 14,
              "is_break": false,
              "json_url": "https://metarefresh.talkfunnel.com/2015/1336-i-will-javascript-you/json",
              "proposal": 1612,
              "proposal_url": "https://metarefresh.talkfunnel.com/2015/1336-i-will-javascript-you",
              "room": "mlr-convention-centre-jp-nagar/conference-hall",
              "section_name": "fulltalk-performance",
              "section_title": "Performance – full talk",
              "speaker": "Dron Rathore",
              "speaker_bio": "<p>Dron is a Front-End developer, Node JS and Automation Testing team lead at Housing.com. He is also Mozilla Representative and an open-source enthusiasts. He is the swiss knife of the Front End team at Housing and a great person to reach out. Dron has been vividly working upon a lot of cool technologies and challenges them for the best.  </p>",
              "speaker_bio_text": "Dron is a Front-End developer, Node JS and Automation Testing team lead at Housing.com. He is also Mozilla Representative and an open-source enthusiasts. He is the swiss knife of the Front End team at Housing and a great person to reach out. Dron has been vividly working upon a lot of cool technologies and challenges them for the best.\r\n",
              "start": "2015-04-16T06:00:00Z",
              "technical_level": "Intermediate",
              "title": "I Will Javascript You!",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#14-i-will-javascript-you"
            }
          ],
          "slot": "11:30"
        },
        {
          "sessions": [
            {
              "description": "<p>Designing a new product can be quite the daunting challenge. We’ll take an in-depth look in designing a new mobile product using a very customer centric methodology that we call Design for Delight. We’ll walk you through techniques we use to get delight and innovation, starting with understanding the customer, their motivations, testing ideas, experimentation and failing fast.</p>",
              "description_text": "Designing a new product can be quite the daunting challenge. We’ll take an in-depth look in designing a new mobile product using a very customer centric methodology that we call Design for Delight. We’ll walk you through techniques we use to get delight and innovation, starting with understanding the customer, their motivations, testing ideas, experimentation and failing fast.",
              "end": "2015-04-16T07:30:00Z",
              "feedback_url": "https://metarefresh.talkfunnel.com/2015/1348-design-for-delight/feedback",
              "id": 35,
              "is_break": false,
              "json_url": "https://metarefresh.talkfunnel.com/2015/1348-design-for-delight/json",
              "proposal": 1676,
              "proposal_url": "https://metarefresh.talkfunnel.com/2015/1348-design-for-delight",
              "room": "mlr-convention-centre-jp-nagar/conference-hall",
              "section_name": "applicationdesign-fulltalk",
              "section_title": "Application Design – full talk",
              "speaker": "Vivek Raghavan",
              "speaker_bio": "<p>Both Bhaskar and Vivek are Product Management professionals with over 15 years of experience managing leading global products.</p>\n<p>Bhaskar has extensive experience in accounting, enterprise retail, distribution and has a background in software sales and consulting. At Intuit, he manages two core product lines - QuickBooks Pro/Premier and QuickBooks Accountant. Prior to Intuit he has worked with IBM, and Sterling Commerce (now IBM). Bhaskar is an engineer with a MBA from IIM Ahmedabad.</p>\n<p>Vivek comes largely from the startup world, he has co-founded/worked for 6 early stage startups in the Valley focused on wireless and consumer facing software. At Intuit, Vivek manages the TurboTax product line and runs discovery teams focused on finding new ways to disrupting Intuit’s existing businesses. He is an engineer with an MBA from Columbia University in New York.</p>",
              "speaker_bio_text": "Both Bhaskar and Vivek are Product Management professionals with over 15 years of experience managing leading global products.\r\n\r\nBhaskar has extensive experience in accounting, enterprise retail, distribution and has a background in software sales and consulting. At Intuit, he manages two core product lines - QuickBooks Pro/Premier and QuickBooks Accountant. Prior to Intuit he has worked with IBM, and Sterling Commerce (now IBM). Bhaskar is an engineer with a MBA from IIM Ahmedabad.\r\n\r\nVivek comes largely from the startup world, he has co-founded/worked for 6 early stage startups in the Valley focused on wireless and consumer facing software. At Intuit, Vivek manages the TurboTax product line and runs discovery teams focused on finding new ways to disrupting Intuit’s existing businesses. He is an engineer with an MBA from Columbia University in New York.",
              "start": "2015-04-16T06:45:00Z",
              "technical_level": "Beginner",
              "title": "Design for Delight (sponsored by Intuit)",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#35-design-for-delight"
            }
          ],
          "slot": "12:15"
        },
        {
          "sessions": [
            {
              "description": "",
              "description_text": "",
              "end": "2015-04-16T08:30:00Z",
              "feedback_url": null,
              "id": 6,
              "is_break": true,
              "json_url": null,
              "proposal": null,
              "proposal_url": null,
              "room": null,
              "section_name": null,
              "section_title": null,
              "speaker": "",
              "speaker_bio": "",
              "speaker_bio_text": "",
              "start": "2015-04-16T07:30:00Z",
              "technical_level": null,
              "title": "Lunch",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#6-lunch"
            }
          ],
          "slot": "13:00"
        },
        {
          "sessions": [
            {
              "description": "<p>Maps have continously become the center stage for mobile web apps. They have gone from something that developers plug in at the last minute to a fully interactive element that governs the overall aesthetics of the application. We will talk about how this is important and how open source tools help add value and functionality to the maps. We will understand how maps are rendered in a browser in a mobile environment, and explore some of the recent improvements that push the limits of web technologies. </p>\n<h4>Outline</h4>\n<ul>\n<li>Why maps matter and how they are the focal point of applications.</li>\n<li>Mapbox&rsquo;s open source tool infrastructure, web standards and compatibility.</li>\n<li>Performance considerations.</li>\n<li>WebGL, vectors and how they compare to raster rendering techniques. </li>\n<li>Why some of these challenges are nudging us to go native.</li>\n</ul>",
              "description_text": "Maps have continously become the center stage for mobile web apps. They have gone from something that developers plug in at the last minute to a fully interactive element that governs the overall aesthetics of the application. We will talk about how this is important and how open source tools help add value and functionality to the maps. We will understand how maps are rendered in a browser in a mobile environment, and explore some of the recent improvements that push the limits of web technologies. \r\n\r\n#### Outline\r\n* Why maps matter and how they are the focal point of applications.\r\n* Mapbox's open source tool infrastructure, web standards and compatibility.\r\n* Performance considerations.\r\n* WebGL, vectors and how they compare to raster rendering techniques. \r\n* Why some of these challenges are nudging us to go native.",
              "end": "2015-04-16T08:45:00Z",
              "feedback_url": "https://metarefresh.talkfunnel.com/2015/1328-making-maps-work-on-mobile/feedback",
              "id": 12,
              "is_break": false,
              "json_url": "https://metarefresh.talkfunnel.com/2015/1328-making-maps-work-on-mobile/json",
              "proposal": 1600,
              "proposal_url": "https://metarefresh.talkfunnel.com/2015/1328-making-maps-work-on-mobile",
              "room": "mlr-convention-centre-jp-nagar/conference-hall",
              "section_name": "crisptalk-performance",
              "section_title": "Performance – crisp talk",
              "speaker": "Sajjad Anwar",
              "speaker_bio": "<p><a href=\"http://geohacker.in\">Sajjad Anwar</a> is a developer at <a href=\"https://mapbox.com\">Mapbox</a> where he focuses on buidling data processing and productivity tools. He has been working closely with OpenStreetMap data and technology for over 6 years. As a strong advocate of open data, he is actively involved in its movement in India with initiatives like <a href=\"http://datameet.org\">DataMeet</a> and <a href=\"http://geoblr.in\">GeoBLR</a>.</p>",
              "speaker_bio_text": "[Sajjad Anwar](http://geohacker.in) is a developer at [Mapbox](https://mapbox.com) where he focuses on buidling data processing and productivity tools. He has been working closely with OpenStreetMap data and technology for over 6 years. As a strong advocate of open data, he is actively involved in its movement in India with initiatives like [DataMeet](http://datameet.org) and [GeoBLR](http://geoblr.in).",
              "start": "2015-04-16T08:30:00Z",
              "technical_level": "Beginner",
              "title": "Making maps work on mobile.",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#12-making-maps-work-on-mobile"
            }
          ],
          "slot": "14:00"
        },
        {
          "sessions": [
            {
              "description": "<p>At Pykih, we have attempted to solve this problem with a Javascript Framework (PykQuery.js) that establishes a consistent way for our team to write data-driven interactive front-ends. </p>\n<ul>\n<li>The problem</li>\n<li>Case study without PykQuery.js</li>\n<li>Introduction </li>\n<li>Architecture</li>\n<li>How it works?</li>\n<li>Case study with PykQuery.js</li>\n</ul>",
              "description_text": "At Pykih, we have attempted to solve this problem with a Javascript Framework (PykQuery.js) that establishes a consistent way for our team to write data-driven interactive front-ends. \r\n\r\n* The problem\r\n* Case study without PykQuery.js\r\n* Introduction \r\n* Architecture\r\n* How it works?\r\n* Case study with PykQuery.js",
              "end": "2015-04-16T09:00:00Z",
              "feedback_url": "https://metarefresh.talkfunnel.com/2015/1320-a-framework-for-building-data-driven-interactive-f/feedback",
              "id": 32,
              "is_break": false,
              "json_url": "https://metarefresh.talkfunnel.com/2015/1320-a-framework-for-building-data-driven-interactive-f/json",
              "proposal": 1585,
              "proposal_url": "https://metarefresh.talkfunnel.com/2015/1320-a-framework-for-building-data-driven-interactive-f",
              "room": "mlr-convention-centre-jp-nagar/conference-hall",
              "section_name": "applicationdesign-crisptalk",
              "section_title": "Application design – crisp talk",
              "speaker": "Ritvvij Parrikh",
              "speaker_bio": "<p>Ritvvij Parrikh is the founder of <a href=\"https://pykih.com\">https://pykih.com</a> - a data visualisation company. He works in the intersection of data, design, statistics and coding. In his previous avatars, he founded a social enterprise that helped charities with analytics. Prior to that, he worked for many years at Amdocs US designing data-driven systems for AT&amp;T.</p>",
              "speaker_bio_text": "Ritvvij Parrikh is the founder of https://pykih.com - a data visualisation company. He works in the intersection of data, design, statistics and coding. In his previous avatars, he founded a social enterprise that helped charities with analytics. Prior to that, he worked for many years at Amdocs US designing data-driven systems for AT&T.",
              "start": "2015-04-16T08:45:00Z",
              "technical_level": "Intermediate",
              "title": "A framework for building data-driven interactive front-ends ",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#32-a-framework-for-building-data-driven-interactive-front-ends"
            }
          ],
          "slot": "14:15"
        },
        {
          "sessions": [
            {
              "description": "<p>In no small part does Facebook&rsquo;s <a href=\"http://facebook.github.io/react\">React</a> framework owe its popularity to its magical ease &ndash; it provides a declarative way of describing UIs, and blazing fast performance for free. Good performance in this programming model is feasible because of a key design tenet of React called <a href=\"http://facebook.github.io/react/docs/reconciliation.html\">DOM Reconciliation</a>. In short, React does not mutate or create the <em>actual</em> DOM (for that is expensive and full of peril), instead it creates a representation of the DOM (which is called the <em>Virtual DOM</em>) at every app state, and then applies <em>only the differences</em> that need to be applied to the actual DOM.</p>\n<p>In this talk, we will explore what designing and programming UIs with such a <em>Virtual DOM</em> representation entails. We extend the Virtual DOM idea to the server-side and represent complex UIs as denotations tied to their <a href=\"http://webcomponents.org/\">Web Component</a> counterparts. This combination makes it easy to compose data-driven UIs from smaller reusable parts. We will also see examples of these ideas manifesting in the <a href=\"http://elm-lang.org\">Elm</a> ecosystem and some Julia UI packages (namely <a href=\"https://github.com/JuliaLang/Interact.jl\">Interact</a>, <a href=\"http://github.com/shashi/Patchwork.jl\">Patchwork</a>, and <a href=\"http://github.com/shashi/Canvas.jl\">Canvas</a>)</p>\n<p>Agenda/Contents:</p>\n<ul>\n<li>What are Values?<ul>\n<li>Numerals as the UI of numbers</li>\n</ul>\n</li>\n<li>UIs as abstract values<ul>\n<li>Rendering abstract values into Virtual DOM</li>\n</ul>\n</li>\n<li>Functionally Composing UIs<ul>\n<li>An algebra of layouts (aka try this with HTML)</li>\n<li>Style and theming</li>\n</ul>\n</li>\n<li>Reactive programming: Interaction and Animations<ul>\n<li>UI as a time-varying value</li>\n<li>Diffing and Patching</li>\n<li>The case for the server sending patches to the browser</li>\n</ul>\n</li>\n<li>Making UIs at a REPL</li>\n<li>Debugging: Time-travel and infinite undo</li>\n</ul>",
              "description_text": "In no small part does Facebook's [React](http://facebook.github.io/react) framework owe its popularity to its magical ease -- it provides a declarative way of describing UIs, and blazing fast performance for free. Good performance in this programming model is feasible because of a key design tenet of React called [DOM Reconciliation](http://facebook.github.io/react/docs/reconciliation.html). In short, React does not mutate or create the *actual* DOM (for that is expensive and full of peril), instead it creates a representation of the DOM (which is called the *Virtual DOM*) at every app state, and then applies *only the differences* that need to be applied to the actual DOM.\r\n\r\nIn this talk, we will explore what designing and programming UIs with such a *Virtual DOM* representation entails. We extend the Virtual DOM idea to the server-side and represent complex UIs as denotations tied to their [Web Component](http://webcomponents.org/) counterparts. This combination makes it easy to compose data-driven UIs from smaller reusable parts. We will also see examples of these ideas manifesting in the [Elm](http://elm-lang.org) ecosystem and some Julia UI packages (namely [Interact](https://github.com/JuliaLang/Interact.jl), [Patchwork](http://github.com/shashi/Patchwork.jl), and [Canvas](http://github.com/shashi/Canvas.jl))\r\n\r\nAgenda/Contents:\r\n\r\n* What are Values?\r\n    * Numerals as the UI of numbers\r\n* UIs as abstract values\r\n    * Rendering abstract values into Virtual DOM\r\n* Functionally Composing UIs\r\n    * An algebra of layouts (aka try this with HTML)\r\n    * Style and theming\r\n* Reactive programming: Interaction and Animations\r\n    * UI as a time-varying value\r\n    * Diffing and Patching\r\n    * The case for the server sending patches to the browser\r\n* Making UIs at a REPL\r\n* Debugging: Time-travel and infinite undo",
              "end": "2015-04-16T09:15:00Z",
              "feedback_url": "https://metarefresh.talkfunnel.com/2015/1300-uis-as-values/feedback",
              "id": 49,
              "is_break": false,
              "json_url": "https://metarefresh.talkfunnel.com/2015/1300-uis-as-values/json",
              "proposal": 1431,
              "proposal_url": "https://metarefresh.talkfunnel.com/2015/1300-uis-as-values",
              "room": "mlr-convention-centre-jp-nagar/conference-hall",
              "section_name": "frontend-full",
              "section_title": "Front-end build processes and tools – full talks",
              "speaker": "Shashi Gowda",
              "speaker_bio": "<p>I&rsquo;m Shashi, I build UI tools for The <a href=\"http://julialang.org\">Julia</a> Language. I am <a href=\"http://twitter.com/g0wda\">twitter/g0wda</a> and <a href=\"http://github.com/shashi\">github/shashi</a></p>",
              "speaker_bio_text": "I'm Shashi, I build UI tools for The [Julia](http://julialang.org) Language. I am [twitter/g0wda](http://twitter.com/g0wda) and [github/shashi](http://github.com/shashi)",
              "start": "2015-04-16T09:00:00Z",
              "technical_level": "Intermediate",
              "title": "UIs as Values",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#49-uis-as-values"
            }
          ],
          "slot": "14:30"
        },
        {
          "sessions": [
            {
              "description": "",
              "description_text": "",
              "end": "2015-04-16T09:30:00Z",
              "feedback_url": null,
              "id": 37,
              "is_break": false,
              "json_url": null,
              "proposal": null,
              "proposal_url": null,
              "room": "mlr-convention-centre-jp-nagar/conference-hall",
              "section_name": null,
              "section_title": null,
              "speaker": "",
              "speaker_bio": "",
              "speaker_bio_text": "",
              "start": "2015-04-16T09:15:00Z",
              "technical_level": null,
              "title": "Crisp talk - Q&A",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#37-crisp-talk-q-a"
            }
          ],
          "slot": "14:45"
        },
        {
          "sessions": [
            {
              "description": "",
              "description_text": "",
              "end": "2015-04-16T10:15:00Z",
              "feedback_url": null,
              "id": 13,
              "is_break": false,
              "json_url": null,
              "proposal": null,
              "proposal_url": null,
              "room": "mlr-convention-centre-jp-nagar/conference-hall",
              "section_name": null,
              "section_title": null,
              "speaker": "",
              "speaker_bio": "",
              "speaker_bio_text": "",
              "start": "2015-04-16T09:30:00Z",
              "technical_level": null,
              "title": "Flash Talks",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#13-flash-talks"
            }
          ],
          "slot": "15:00"
        },
        {
          "sessions": [
            {
              "description": "",
              "description_text": "",
              "end": "2015-04-16T10:45:00Z",
              "feedback_url": null,
              "id": 15,
              "is_break": true,
              "json_url": null,
              "proposal": null,
              "proposal_url": null,
              "room": null,
              "section_name": null,
              "section_title": null,
              "speaker": "",
              "speaker_bio": "",
              "speaker_bio_text": "",
              "start": "2015-04-16T10:15:00Z",
              "technical_level": null,
              "title": "Tea Break",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#15-tea-break"
            }
          ],
          "slot": "15:45"
        },
        {
          "sessions": [
            {
              "description": "<p>I will cover the architecture, design, performance optimizations and UX considerations that went into building this project. Side note - Having an app should not be a reason to kill your mobile web experience. Remember, the way to get people to use your app is not by killing your mobile web app or putting ugly road blocks. Build for the customers and not for your investors.</p>",
              "description_text": "I will cover the architecture, design, performance optimizations and UX considerations that went into building this project. Side note - Having an app should not be a reason to kill your mobile web experience. Remember, the way to get people to use your app is not by killing your mobile web app or putting ugly road blocks. Build for the customers and not for your investors.",
              "end": "2015-04-16T11:30:00Z",
              "feedback_url": "https://metarefresh.talkfunnel.com/2015/1332-now-that-we-have-an-app-lets-kill-our-mobile-site/feedback",
              "id": 44,
              "is_break": false,
              "json_url": "https://metarefresh.talkfunnel.com/2015/1332-now-that-we-have-an-app-lets-kill-our-mobile-site/json",
              "proposal": 1607,
              "proposal_url": "https://metarefresh.talkfunnel.com/2015/1332-now-that-we-have-an-app-lets-kill-our-mobile-site",
              "room": "mlr-convention-centre-jp-nagar/conference-hall",
              "section_name": "applicationdesign-fulltalk",
              "section_title": "Application Design – full talk",
              "speaker": "Harish Sivaramakrishnan",
              "speaker_bio": "<p>Harish is VP &amp; Head of design and front end engineering @freecharge, musician @agamlive and an overall nice guy. At times he sees dead pixels.</p>",
              "speaker_bio_text": "Harish is VP & Head of design and front end engineering @freecharge, musician @agamlive and an overall nice guy. At times he sees dead pixels.",
              "start": "2015-04-16T10:45:00Z",
              "technical_level": "Intermediate",
              "title": "Now that we have an app, Let's kill our mobile site!",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#44-now-that-we-have-an-app-lets-kill-our-mobile-site"
            }
          ],
          "slot": "16:15"
        },
        {
          "sessions": [
            {
              "description": "",
              "description_text": "",
              "end": "2015-04-16T17:45:00Z",
              "feedback_url": null,
              "id": 17,
              "is_break": true,
              "json_url": null,
              "proposal": null,
              "proposal_url": null,
              "room": null,
              "section_name": null,
              "section_title": null,
              "speaker": "",
              "speaker_bio": "",
              "speaker_bio_text": "",
              "start": "2015-04-16T17:30:00Z",
              "technical_level": null,
              "title": "Crisp talk - TBA",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#17-crisp-talk-tba"
            }
          ],
          "slot": "23:00"
        },
        {
          "sessions": [
            {
              "description": "",
              "description_text": "",
              "end": "2015-04-16T18:15:00Z",
              "feedback_url": null,
              "id": 30,
              "is_break": true,
              "json_url": null,
              "proposal": null,
              "proposal_url": null,
              "room": null,
              "section_name": null,
              "section_title": null,
              "speaker": "",
              "speaker_bio": "",
              "speaker_bio_text": "",
              "start": "2015-04-16T17:45:00Z",
              "technical_level": null,
              "title": "Extended crisp talk - TBA",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#30-extended-crisp-talk-tba"
            },
            {
              "description": "",
              "description_text": "",
              "end": "2015-04-16T18:30:00Z",
              "feedback_url": null,
              "id": 21,
              "is_break": true,
              "json_url": null,
              "proposal": null,
              "proposal_url": null,
              "room": null,
              "section_name": null,
              "section_title": null,
              "speaker": "",
              "speaker_bio": "",
              "speaker_bio_text": "",
              "start": "2015-04-16T17:45:00Z",
              "technical_level": null,
              "title": "Full talk 1 – TBA",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#21-full-talk-1-tba"
            }
          ],
          "slot": "23:15"
        },
        {
          "sessions": [
            {
              "description": "",
              "description_text": "",
              "end": "2015-04-16T18:45:00Z",
              "feedback_url": null,
              "id": 38,
              "is_break": false,
              "json_url": null,
              "proposal": null,
              "proposal_url": null,
              "room": null,
              "section_name": null,
              "section_title": null,
              "speaker": "",
              "speaker_bio": "",
              "speaker_bio_text": "",
              "start": "2015-04-16T18:00:00Z",
              "technical_level": null,
              "title": "Full talk - TBA",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#38-full-talk-tba"
            }
          ],
          "slot": "23:30"
        },
        {
          "sessions": [
            {
              "description": "",
              "description_text": "",
              "end": "2015-04-16T18:30:00Z",
              "feedback_url": null,
              "id": 19,
              "is_break": true,
              "json_url": null,
              "proposal": null,
              "proposal_url": null,
              "room": null,
              "section_name": null,
              "section_title": null,
              "speaker": "",
              "speaker_bio": "",
              "speaker_bio_text": "",
              "start": "2015-04-16T18:15:00Z",
              "technical_level": null,
              "title": "Crisp talk TBA",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#19-crisp-talk-tba"
            },
            {
              "description": "",
              "description_text": "",
              "end": "2015-04-16T18:45:00Z",
              "feedback_url": null,
              "id": 29,
              "is_break": false,
              "json_url": null,
              "proposal": null,
              "proposal_url": null,
              "room": null,
              "section_name": null,
              "section_title": null,
              "speaker": "",
              "speaker_bio": "",
              "speaker_bio_text": "",
              "start": "2015-04-16T18:15:00Z",
              "technical_level": null,
              "title": "Extended crisp talk - TBA",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#29-extended-crisp-talk-tba"
            },
            {
              "description": "",
              "description_text": "",
              "end": "2015-04-16T18:30:00Z",
              "feedback_url": null,
              "id": 18,
              "is_break": true,
              "json_url": null,
              "proposal": null,
              "proposal_url": null,
              "room": null,
              "section_name": null,
              "section_title": null,
              "speaker": "",
              "speaker_bio": "",
              "speaker_bio_text": "",
              "start": "2015-04-16T18:15:00Z",
              "technical_level": null,
              "title": "Crisp talk – TBA",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#18-crisp-talk-tba"
            }
          ],
          "slot": "23:45"
        }
      ]
    },
    {
      "date": "2015-04-17",
      "slots": [
        {
          "sessions": [
            {
              "description": "<p>Blend Modes have been a common feature in most image editing programs on the desktop platform, but we&rsquo;ve never had them as part of the web platform, until now. Now we have them as part of CSS. This means a potential to really change graphic design on the web by  layering various web elements in novel and interesting ways to produce the designs of the future. </p>\n<p>In this talk, we&rsquo;ll go over everything one needs to know about CSS Blend Modes. We&rsquo;ll look at the algorithms of a few notable blend modes to illustrate what goes on behind the scenes, as well as see how they work with the stacking contexts in a web page. We&rsquo;ll also take a look at what other web page elements apart from images can be used with blend modes (you&rsquo;d be surprised) as well as best practices for maximum cross-browser compatibility. In the end, we&rsquo;ll talk about the future of this specification and how it can effect the future of web design. </p>",
              "description_text": "Blend Modes have been a common feature in most image editing programs on the desktop platform, but we've never had them as part of the web platform, until now. Now we have them as part of CSS. This means a potential to really change graphic design on the web by  layering various web elements in novel and interesting ways to produce the designs of the future. \r\n\r\nIn this talk, we'll go over everything one needs to know about CSS Blend Modes. We'll look at the algorithms of a few notable blend modes to illustrate what goes on behind the scenes, as well as see how they work with the stacking contexts in a web page. We'll also take a look at what other web page elements apart from images can be used with blend modes (you'd be surprised) as well as best practices for maximum cross-browser compatibility. In the end, we'll talk about the future of this specification and how it can effect the future of web design. ",
              "end": "2015-04-17T04:45:00Z",
              "feedback_url": "https://metarefresh.talkfunnel.com/2015/1343-a-deep-dive-into-css-blend-modes/feedback",
              "id": 2,
              "is_break": false,
              "json_url": "https://metarefresh.talkfunnel.com/2015/1343-a-deep-dive-into-css-blend-modes/json",
              "proposal": 1636,
              "proposal_url": "https://metarefresh.talkfunnel.com/2015/1343-a-deep-dive-into-css-blend-modes",
              "room": "mlr-convention-centre-jp-nagar/conference-hall",
              "section_name": "applicationdesign-fulltalk",
              "section_title": "Application Design – full talk",
              "speaker": "Shwetank Dixit",
              "speaker_bio": "<p>Shwetank works in the Developer Relations team as well as the Extensions Team at Opera. He is also part of the W3C Mobile Web for Social Development Group and the W3C Web Education Community Group. He promotes open web standards and best practices amongst the developer community at large. Over the years, he has written several articles about web standards and techniques in various publications like .Net Magazine, Dev.Opera, Developer Fusion and more, and has given more than 100 talks in 10 countries. </p>\n<p>He likes browsers, extensions, open web technologies, and Batman.</p>",
              "speaker_bio_text": "Shwetank works in the Developer Relations team as well as the Extensions Team at Opera. He is also part of the W3C Mobile Web for Social Development Group and the W3C Web Education Community Group. He promotes open web standards and best practices amongst the developer community at large. Over the years, he has written several articles about web standards and techniques in various publications like .Net Magazine, Dev.Opera, Developer Fusion and more, and has given more than 100 talks in 10 countries. \r\n\r\nHe likes browsers, extensions, open web technologies, and Batman.",
              "start": "2015-04-17T04:00:00Z",
              "technical_level": "Advanced",
              "title": "A Deep Dive into CSS Blend Modes",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#2-a-deep-dive-into-css-blend-modes"
            }
          ],
          "slot": "09:30"
        },
        {
          "sessions": [
            {
              "description": "<p>Frontend development for modern web apps has become complex with the need to support multiple browers and devices. At the same time there is an increased focus on innovative interactions across the different devices.<br>\nThis talk aims to touch upon a components based approach of UX, Design and Development of web apps.<br>\nWe&rsquo;ll see how tools like Google Polymer and Material Design principles help in this process and how it helps reduce the friction between frontend and backend developers on a project.</p>",
              "description_text": "Frontend development for modern web apps has become complex with the need to support multiple browers and devices. At the same time there is an increased focus on innovative interactions across the different devices. \r\nThis talk aims to touch upon a components based approach of UX, Design and Development of web apps.\r\nWe'll see how tools like Google Polymer and Material Design principles help in this process and how it helps reduce the friction between frontend and backend developers on a project.",
              "end": "2015-04-17T05:30:00Z",
              "feedback_url": "https://metarefresh.talkfunnel.com/2015/1292-building-application-frontends-the-web-components-/feedback",
              "id": 33,
              "is_break": false,
              "json_url": "https://metarefresh.talkfunnel.com/2015/1292-building-application-frontends-the-web-components-/json",
              "proposal": 1423,
              "proposal_url": "https://metarefresh.talkfunnel.com/2015/1292-building-application-frontends-the-web-components-",
              "room": "mlr-convention-centre-jp-nagar/conference-hall",
              "section_name": "applicationdesign-fulltalk",
              "section_title": "Application Design – full talk",
              "speaker": "Vinci Rufus",
              "speaker_bio": "<p>Head the Commerce and Creative practice at RazorfishNeev.<br>\nEnjoy playing with frontend tools &amp; technologies.<br>\nWrote a book on AngularJS</p>",
              "speaker_bio_text": "Head the Commerce and Creative practice at RazorfishNeev.\r\nEnjoy playing with frontend tools & technologies.\r\nWrote a book on AngularJS",
              "start": "2015-04-17T04:45:00Z",
              "technical_level": "Intermediate",
              "title": " Building  Application frontends the Web Components Way ",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#33-building-application-frontends-the-web-components-way"
            }
          ],
          "slot": "10:15"
        },
        {
          "sessions": [
            {
              "description": "",
              "description_text": "",
              "end": "2015-04-17T06:00:00Z",
              "feedback_url": null,
              "id": 9,
              "is_break": true,
              "json_url": null,
              "proposal": null,
              "proposal_url": null,
              "room": null,
              "section_name": null,
              "section_title": null,
              "speaker": "",
              "speaker_bio": "",
              "speaker_bio_text": "",
              "start": "2015-04-17T05:30:00Z",
              "technical_level": null,
              "title": "Tea Break",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#9-tea-break"
            }
          ],
          "slot": "11:00"
        },
        {
          "sessions": [
            {
              "description": "<p>See above.</p>",
              "description_text": "See above.",
              "end": "2015-04-17T06:45:00Z",
              "feedback_url": "https://metarefresh.talkfunnel.com/2015/1347-we-dont-hate-the-web/feedback",
              "id": 46,
              "is_break": false,
              "json_url": "https://metarefresh.talkfunnel.com/2015/1347-we-dont-hate-the-web/json",
              "proposal": 1666,
              "proposal_url": "https://metarefresh.talkfunnel.com/2015/1347-we-dont-hate-the-web",
              "room": "mlr-convention-centre-jp-nagar/conference-hall",
              "section_name": "applicationdesign-fulltalk",
              "section_title": "Application Design – full talk",
              "speaker": "Amar Nagram",
              "speaker_bio": "<p>Amar is the director of Mobile Engineering at Flipkart.</p>",
              "speaker_bio_text": "Amar is the director of Mobile Engineering at Flipkart.",
              "start": "2015-04-17T06:00:00Z",
              "technical_level": "Intermediate",
              "title": "We don't hate the web",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#46-we-dont-hate-the-web"
            }
          ],
          "slot": "11:30"
        },
        {
          "sessions": [
            {
              "description": "<p>Your mobile phone is likely to already support technology that makes real-time communication embedable into your web-app and with modern open-source libraries it is easier then ever. We&rsquo;re going to explore some of the scenarios in which communication helps your use-case and UX and how to get it into your app.</p>",
              "description_text": "Your mobile phone is likely to already support technology that makes real-time communication embedable into your web-app and with modern open-source libraries it is easier then ever. We're going to explore some of the scenarios in which communication helps your use-case and UX and how to get it into your app.",
              "end": "2015-04-17T07:30:00Z",
              "feedback_url": "https://metarefresh.talkfunnel.com/2015/1276-real-time-communications-on-mobile/feedback",
              "id": 1,
              "is_break": false,
              "json_url": "https://metarefresh.talkfunnel.com/2015/1276-real-time-communications-on-mobile/json",
              "proposal": 1354,
              "proposal_url": "https://metarefresh.talkfunnel.com/2015/1276-real-time-communications-on-mobile",
              "room": "mlr-convention-centre-jp-nagar/conference-hall",
              "section_name": "applicationdesign-fulltalk",
              "section_title": "Application Design – full talk",
              "speaker": "Thomas Gorissen",
              "speaker_bio": "<p>Thomas is coding the webs for 16 years, organizer of JSConf.Asia, UX mentor at JFDI.Asia and chief troublemaker at webtech startup Temasys in Singapore.</p>",
              "speaker_bio_text": "Thomas is coding the webs for 16 years, organizer of JSConf.Asia, UX mentor at JFDI.Asia and chief troublemaker at webtech startup Temasys in Singapore.",
              "start": "2015-04-17T06:45:00Z",
              "technical_level": "Beginner",
              "title": "Real-time communications on mobile",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#1-real-time-communications-on-mobile"
            }
          ],
          "slot": "12:15"
        },
        {
          "sessions": [
            {
              "description": "",
              "description_text": "",
              "end": "2015-04-17T08:30:00Z",
              "feedback_url": null,
              "id": 23,
              "is_break": true,
              "json_url": null,
              "proposal": null,
              "proposal_url": null,
              "room": null,
              "section_name": null,
              "section_title": null,
              "speaker": "",
              "speaker_bio": "",
              "speaker_bio_text": "",
              "start": "2015-04-17T07:30:00Z",
              "technical_level": null,
              "title": "Lunch",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#23-lunch"
            }
          ],
          "slot": "13:00"
        },
        {
          "sessions": [
            {
              "description": "<p>We’re all working on responsive websites. Testing these webpages across different devices/screens and across all the different browsers is a time-consuming process.<br>\nIn this talk, we’ll explore ways in which we can preview and test webpages across multiple browsers, multiples devices at different screen resolutions. This talk will cover:<br>\n1. Why should we test on devices?<br>\n2. Different tools and services with which we can test the webpages across devices/browsers .  </p>",
              "description_text": "We’re all working on responsive websites. Testing these webpages across different devices/screens and across all the different browsers is a time-consuming process. \r\nIn this talk, we’ll explore ways in which we can preview and test webpages across multiple browsers, multiples devices at different screen resolutions. This talk will cover:\r\n1. Why should we test on devices?\r\n2. Different tools and services with which we can test the webpages across devices/browsers .\r\n",
              "end": "2015-04-17T08:45:00Z",
              "feedback_url": "https://metarefresh.talkfunnel.com/2015/1318-why-and-how-to-test-webpages-across-multiple-devic/feedback",
              "id": 11,
              "is_break": false,
              "json_url": "https://metarefresh.talkfunnel.com/2015/1318-why-and-how-to-test-webpages-across-multiple-devic/json",
              "proposal": 1579,
              "proposal_url": "https://metarefresh.talkfunnel.com/2015/1318-why-and-how-to-test-webpages-across-multiple-devic",
              "room": "mlr-convention-centre-jp-nagar/conference-hall",
              "section_name": "frontend-crisp",
              "section_title": "Front-end build processes and tools – crisp talks",
              "speaker": "Priyanka Herur",
              "speaker_bio": "<p>I&rsquo;m Priyanka Herur, working at Adobe Systems in the Web Platform and Authoring team. In the past year, we&rsquo;ve been exploring solutions to make it easier to test across multiple devices. This talk will cover our learnings and observations of various device testing tool.</p>",
              "speaker_bio_text": "I'm Priyanka Herur, working at Adobe Systems in the Web Platform and Authoring team. In the past year, we've been exploring solutions to make it easier to test across multiple devices. This talk will cover our learnings and observations of various device testing tool.",
              "start": "2015-04-17T08:30:00Z",
              "technical_level": "Beginner",
              "title": "Why and how to test webpages across multiple devices and browsers",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#11-why-and-how-to-test-webpages-across-multiple-devices-and-browsers"
            }
          ],
          "slot": "14:00"
        },
        {
          "sessions": [
            {
              "description": "<p>Delivering a fast web experience requires a lot of work by the browser. Most of this work is hidden from us as web developers: we write the markup, and a nice looking page comes out on the screen. But how exactly does the browser go from consuming our HTML, CSS, and JavaScript to rendered pixels on the screen?</p>\n<p>Optimizing for performance is all about understanding what happens in these intermediate steps between receiving the HTML, CSS, and JavaScript bytes and the required processing to turn them into rendered pixels - that’s the critical rendering path.</p>\n<p>Optimizing the critical rendering path is critical for improving performance of our pages. The goal is to prioritize and display the content that relates to the primary action the user wants to take on a page.</p>",
              "description_text": "Delivering a fast web experience requires a lot of work by the browser. Most of this work is hidden from us as web developers: we write the markup, and a nice looking page comes out on the screen. But how exactly does the browser go from consuming our HTML, CSS, and JavaScript to rendered pixels on the screen?\r\n\r\nOptimizing for performance is all about understanding what happens in these intermediate steps between receiving the HTML, CSS, and JavaScript bytes and the required processing to turn them into rendered pixels - that’s the critical rendering path.\r\n\r\nOptimizing the critical rendering path is critical for improving performance of our pages. The goal is to prioritize and display the content that relates to the primary action the user wants to take on a page.",
              "end": "2015-04-17T09:00:00Z",
              "feedback_url": "https://metarefresh.talkfunnel.com/2015/1281-perffirst-optimizing-the-critical-rendering-path/feedback",
              "id": 27,
              "is_break": false,
              "json_url": "https://metarefresh.talkfunnel.com/2015/1281-perffirst-optimizing-the-critical-rendering-path/json",
              "proposal": 1398,
              "proposal_url": "https://metarefresh.talkfunnel.com/2015/1281-perffirst-optimizing-the-critical-rendering-path",
              "room": "mlr-convention-centre-jp-nagar/conference-hall",
              "section_name": "crisptalk-performance",
              "section_title": "Performance – crisp talk",
              "speaker": "Brameshmadhav Srinivasan",
              "speaker_bio": "<ul>\n<li>Pursuing a career in the field of Information Technology for about 5 and a half years now</li>\n<li>Appreciating the nuances of how the &lsquo;job gets done&rsquo; across different industries&rsquo;s IT needs</li>\n<li>Startup oriented (Love the concept of Lean startup and Minimum viable product)</li>\n<li>Passionate about programming and learning new technologies.</li>\n<li>Learning from and contributing to various open source technologies and forums</li>\n<li>Extensive experience as a Java and JavaScript toolkit programmer. Beginner skills in Hack, Dart  and Nodejs</li>\n</ul>",
              "speaker_bio_text": "- Pursuing a career in the field of Information Technology for about 5 and a half years now\r\n- Appreciating the nuances of how the 'job gets done' across different industries's IT needs\r\n- Startup oriented (Love the concept of Lean startup and Minimum viable product)\r\n- Passionate about programming and learning new technologies.\r\n- Learning from and contributing to various open source technologies and forums\r\n- Extensive experience as a Java and JavaScript toolkit programmer. Beginner skills in Hack, Dart  and Nodejs",
              "start": "2015-04-17T08:45:00Z",
              "technical_level": "Beginner",
              "title": "#Perffirst - Optimizing the Critical Rendering Path",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#27-perffirst-optimizing-the-critical-rendering-path"
            }
          ],
          "slot": "14:15"
        },
        {
          "sessions": [
            {
              "description": "<p>What does it take to get a native-like feel on mobile web?<br>\nHow does CSS and JS animations compare?<br>\nWhat libraries are out there - velocityJS, famo.us&hellip;<br>\nDemos</p>",
              "description_text": "What does it take to get a native-like feel on mobile web? \r\nHow does CSS and JS animations compare?\r\nWhat libraries are out there - velocityJS, famo.us...\r\nDemos",
              "end": "2015-04-17T09:15:00Z",
              "feedback_url": "https://metarefresh.talkfunnel.com/2015/1306-dom-animations-almost-native/feedback",
              "id": 5,
              "is_break": false,
              "json_url": "https://metarefresh.talkfunnel.com/2015/1306-dom-animations-almost-native/json",
              "proposal": 1551,
              "proposal_url": "https://metarefresh.talkfunnel.com/2015/1306-dom-animations-almost-native",
              "room": "mlr-convention-centre-jp-nagar/conference-hall",
              "section_name": "crisptalk-performance",
              "section_title": "Performance – crisp talk",
              "speaker": "Arun Subramaniam",
              "speaker_bio": "<p>Arun works in the mobile division of Amadeus, coding it out on hybrid mobile apps in the travel domain. He brings to the podium over 8 years experience in front-end engineering and couple of (hopefully) interesting demos.</p>",
              "speaker_bio_text": "Arun works in the mobile division of Amadeus, coding it out on hybrid mobile apps in the travel domain. He brings to the podium over 8 years experience in front-end engineering and couple of (hopefully) interesting demos.",
              "start": "2015-04-17T09:00:00Z",
              "technical_level": "Beginner",
              "title": "DOM animations, almost native",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#5-dom-animations-almost-native"
            }
          ],
          "slot": "14:30"
        },
        {
          "sessions": [
            {
              "description": "",
              "description_text": "",
              "end": "2015-04-17T09:30:00Z",
              "feedback_url": null,
              "id": 43,
              "is_break": false,
              "json_url": null,
              "proposal": null,
              "proposal_url": null,
              "room": "mlr-convention-centre-jp-nagar/conference-hall",
              "section_name": null,
              "section_title": null,
              "speaker": "",
              "speaker_bio": "",
              "speaker_bio_text": "",
              "start": "2015-04-17T09:15:00Z",
              "technical_level": null,
              "title": "Crisp talk - Q&A",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#43-crisp-talk-q-a"
            }
          ],
          "slot": "14:45"
        },
        {
          "sessions": [
            {
              "description": "<p>Rendering performance on the modern web is messy, especially when talking about games, mobile and HTML5. The web was never designed to do real-time animation, but we’re trying to teach this old dog yet another round of new tricks so it can compete with the fluid, animation-heavy experiences the mobile touch device revolution  has trained users to expect. Let’s blow the covers off of what’s going on when the browser renders your game and associated animations. Rather than do this by explaining all the complicated technology involved, your humble host will discuss the best practices and show you what it looks like when we do performance profiling to run your games at 60fps. We’ll bounce from JavaSript and CSS all the way down to the GPU and back using the tools built to analyze Chrome&rsquo;s performance.</p>",
              "description_text": "Rendering performance on the modern web is messy, especially when talking about games, mobile and HTML5. The web was never designed to do real-time animation, but we’re trying to teach this old dog yet another round of new tricks so it can compete with the fluid, animation-heavy experiences the mobile touch device revolution  has trained users to expect. Let’s blow the covers off of what’s going on when the browser renders your game and associated animations. Rather than do this by explaining all the complicated technology involved, your humble host will discuss the best practices and show you what it looks like when we do performance profiling to run your games at 60fps. We’ll bounce from JavaSript and CSS all the way down to the GPU and back using the tools built to analyze Chrome's performance.",
              "end": "2015-04-17T10:15:00Z",
              "feedback_url": "https://metarefresh.talkfunnel.com/2015/1277-running-mobile-games-at-60fps/feedback",
              "id": 7,
              "is_break": false,
              "json_url": "https://metarefresh.talkfunnel.com/2015/1277-running-mobile-games-at-60fps/json",
              "proposal": 1356,
              "proposal_url": "https://metarefresh.talkfunnel.com/2015/1277-running-mobile-games-at-60fps",
              "room": "mlr-convention-centre-jp-nagar/conference-hall",
              "section_name": "fulltalk-performance",
              "section_title": "Performance – full talk",
              "speaker": "Apoorv Saxena",
              "speaker_bio": "<p>Apoorv Saxena is a programmer at heart, weekend Cook and an occasional photographer. He has worked at both large organisations and startups, evangelising Backend and Front End teams. He believes in polygot programming and uses the best tools at hand to create a performant product.</p>",
              "speaker_bio_text": "Apoorv Saxena is a programmer at heart, weekend Cook and an occasional photographer. He has worked at both large organisations and startups, evangelising Backend and Front End teams. He believes in polygot programming and uses the best tools at hand to create a performant product.",
              "start": "2015-04-17T09:30:00Z",
              "technical_level": "Intermediate",
              "title": "Running Mobile Games at 60fps",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#7-running-mobile-games-at-60fps"
            }
          ],
          "slot": "15:00"
        },
        {
          "sessions": [
            {
              "description": "",
              "description_text": "",
              "end": "2015-04-17T10:45:00Z",
              "feedback_url": null,
              "id": 16,
              "is_break": true,
              "json_url": null,
              "proposal": null,
              "proposal_url": null,
              "room": null,
              "section_name": null,
              "section_title": null,
              "speaker": "",
              "speaker_bio": "",
              "speaker_bio_text": "",
              "start": "2015-04-17T10:15:00Z",
              "technical_level": null,
              "title": "Tea Break",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#16-tea-break"
            }
          ],
          "slot": "15:45"
        },
        {
          "sessions": [
            {
              "description": "<ul>\n<li>Why mobile web still matters for Cleartrip - traffic patterns, user behaviour, conversion</li>\n<li>Behaviour differences between mobile web, apps and desktop</li>\n<li>Using mobile web for customer acquisition</li>\n<li>Mobile web as a testing ground for new features </li>\n<li>The future of mobile web </li>\n</ul>",
              "description_text": "- Why mobile web still matters for Cleartrip - traffic patterns, user behaviour, conversion\r\n- Behaviour differences between mobile web, apps and desktop\r\n- Using mobile web for customer acquisition\r\n- Mobile web as a testing ground for new features \r\n- The future of mobile web ",
              "end": "2015-04-17T11:30:00Z",
              "feedback_url": "https://metarefresh.talkfunnel.com/2015/1346-mobile-web-in-an-app-world/feedback",
              "id": 47,
              "is_break": false,
              "json_url": "https://metarefresh.talkfunnel.com/2015/1346-mobile-web-in-an-app-world/json",
              "proposal": 1664,
              "proposal_url": "https://metarefresh.talkfunnel.com/2015/1346-mobile-web-in-an-app-world",
              "room": "mlr-convention-centre-jp-nagar/conference-hall",
              "section_name": "applicationdesign-fulltalk",
              "section_title": "Application Design – full talk",
              "speaker": "Wishy Arora",
              "speaker_bio": "<p>Wishy co-manages the mobile product portfolio at Cleartrip, and is the product owner for the Cleartrip iOS and Windows Phone apps and mobile web. He has over eight years of experience in tech product management and marketing, in both B2B and B2C contexts. Prior to Cleartrip, he was heading the global product marketing function at Subex. He holds an MBA from IIM Lucknow, and a BE in Computer Engineering from Pune University. He blogs occassionaly at www.3rdkosha.com.</p>",
              "speaker_bio_text": "Wishy co-manages the mobile product portfolio at Cleartrip, and is the product owner for the Cleartrip iOS and Windows Phone apps and mobile web. He has over eight years of experience in tech product management and marketing, in both B2B and B2C contexts. Prior to Cleartrip, he was heading the global product marketing function at Subex. He holds an MBA from IIM Lucknow, and a BE in Computer Engineering from Pune University. He blogs occassionaly at www.3rdkosha.com.",
              "start": "2015-04-17T10:45:00Z",
              "technical_level": "Intermediate",
              "title": "Mobile's Stepchild - A Cleartrip Experience",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#47-mobiles-stepchild-a-cleartrip-experience"
            }
          ],
          "slot": "16:15"
        },
        {
          "sessions": [
            {
              "description": "",
              "description_text": "",
              "end": "2015-04-17T12:15:00Z",
              "feedback_url": null,
              "id": 45,
              "is_break": false,
              "json_url": null,
              "proposal": null,
              "proposal_url": null,
              "room": "mlr-convention-centre-jp-nagar/conference-hall",
              "section_name": null,
              "section_title": null,
              "speaker": "",
              "speaker_bio": "",
              "speaker_bio_text": "",
              "start": "2015-04-17T11:30:00Z",
              "technical_level": null,
              "title": "Flash Talks",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#45-flash-talks"
            }
          ],
          "slot": "17:00"
        },
        {
          "sessions": [
            {
              "description": "",
              "description_text": "",
              "end": "2015-04-17T18:15:00Z",
              "feedback_url": null,
              "id": 22,
              "is_break": true,
              "json_url": null,
              "proposal": null,
              "proposal_url": null,
              "room": null,
              "section_name": null,
              "section_title": null,
              "speaker": "",
              "speaker_bio": "",
              "speaker_bio_text": "",
              "start": "2015-04-17T17:30:00Z",
              "technical_level": null,
              "title": "Full talk 2 - TBA",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#22-full-talk-2-tba"
            }
          ],
          "slot": "23:00"
        },
        {
          "sessions": [
            {
              "description": "",
              "description_text": "",
              "end": "2015-04-17T18:00:00Z",
              "feedback_url": null,
              "id": 20,
              "is_break": true,
              "json_url": null,
              "proposal": null,
              "proposal_url": null,
              "room": null,
              "section_name": null,
              "section_title": null,
              "speaker": "",
              "speaker_bio": "",
              "speaker_bio_text": "",
              "start": "2015-04-17T17:45:00Z",
              "technical_level": null,
              "title": "Q&A for crisp talks",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#20-q-a-for-crisp-talks"
            },
            {
              "description": "",
              "description_text": "",
              "end": "2015-04-17T18:30:00Z",
              "feedback_url": null,
              "id": 26,
              "is_break": true,
              "json_url": null,
              "proposal": null,
              "proposal_url": null,
              "room": null,
              "section_name": null,
              "section_title": null,
              "speaker": "",
              "speaker_bio": "",
              "speaker_bio_text": "",
              "start": "2015-04-17T17:45:00Z",
              "technical_level": null,
              "title": "Full talk 3",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#26-full-talk-3"
            },
            {
              "description": "",
              "description_text": "",
              "end": "2015-04-17T18:30:00Z",
              "feedback_url": null,
              "id": 10,
              "is_break": false,
              "json_url": null,
              "proposal": null,
              "proposal_url": null,
              "room": null,
              "section_name": null,
              "section_title": null,
              "speaker": "",
              "speaker_bio": "",
              "speaker_bio_text": "",
              "start": "2015-04-17T17:45:00Z",
              "technical_level": null,
              "title": "Intuit featured talk",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#10-intuit-featured-talk"
            },
            {
              "description": "",
              "description_text": "",
              "end": "2015-04-17T18:15:00Z",
              "feedback_url": null,
              "id": 31,
              "is_break": true,
              "json_url": null,
              "proposal": null,
              "proposal_url": null,
              "room": null,
              "section_name": null,
              "section_title": null,
              "speaker": "",
              "speaker_bio": "",
              "speaker_bio_text": "",
              "start": "2015-04-17T17:45:00Z",
              "technical_level": null,
              "title": "Extended crisp talk - TBA",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#31-extended-crisp-talk-tba"
            }
          ],
          "slot": "23:15"
        },
        {
          "sessions": [
            {
              "description": "",
              "description_text": "",
              "end": "2015-04-17T18:15:00Z",
              "feedback_url": null,
              "id": 24,
              "is_break": true,
              "json_url": null,
              "proposal": null,
              "proposal_url": null,
              "room": null,
              "section_name": null,
              "section_title": null,
              "speaker": "",
              "speaker_bio": "",
              "speaker_bio_text": "",
              "start": "2015-04-17T18:00:00Z",
              "technical_level": null,
              "title": "Crisp talk – TBA",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#24-crisp-talk-tba"
            }
          ],
          "slot": "23:30"
        }
      ]
    },
    {
      "date": "2015-04-18",
      "slots": [
        {
          "sessions": [
            {
              "description": "",
              "description_text": "",
              "end": "2015-04-17T18:45:00Z",
              "feedback_url": null,
              "id": 28,
              "is_break": true,
              "json_url": null,
              "proposal": null,
              "proposal_url": null,
              "room": null,
              "section_name": null,
              "section_title": null,
              "speaker": "",
              "speaker_bio": "",
              "speaker_bio_text": "",
              "start": "2015-04-17T18:30:00Z",
              "technical_level": null,
              "title": "Crisp talk - TBA",
              "url": "https://metarefresh.talkfunnel.com/2015/schedule#28-crisp-talk-tba"
            }
          ],
          "slot": "00:00"
        }
      ]
    }
  ],
  "sections": [
    {
      "description": "45 minute talks on design of mobile web applications. Proposals must specify application design enhanced / affected conversions. ",
      "json_url": null,
      "name": "applicationdesign-fulltalk",
      "title": "Application Design – full talk",
      "url": null
    },
    {
      "description": "15 minute talks on design of mobile web applications. Proposals must specify application design enhanced / affected conversions. ",
      "json_url": null,
      "name": "applicationdesign-crisptalk",
      "title": "Application design – crisp talk",
      "url": null
    },
    {
      "description": "45 min talks on how content is designed for mobile web. These proposals must explain why and how content design affected customer acquisition and increased / decreased user engagement.",
      "json_url": null,
      "name": "contentdesign-fulltalk",
      "title": "Content Design – full talk",
      "url": null
    },
    {
      "description": "15 minute talks on how content is designed for mobile web. Talks must explain why and how content design affected customer acquisition and increased / decreased user engagement.",
      "json_url": null,
      "name": "contentdesign-crisptalk",
      "title": "Content design – crisp talk",
      "url": null
    },
    {
      "description": "15 min sessions on front-end build processes and tools that help you to design for mobile and desktop. ",
      "json_url": null,
      "name": "frontend-crisp",
      "title": "Front-end build processes and tools – crisp talks",
      "url": null
    },
    {
      "description": "45 min sessions on front-end build processes and tools that help you to design for mobile and desktop. ",
      "json_url": null,
      "name": "frontend-full",
      "title": "Front-end build processes and tools – full talks",
      "url": null
    },
    {
      "description": "15 minute talks on tools that help to improve performance.",
      "json_url": null,
      "name": "crisptalk-performance",
      "title": "Performance – crisp talk",
      "url": null
    },
    {
      "description": "45 min proposals on tools which help to improve performance.",
      "json_url": null,
      "name": "fulltalk-performance",
      "title": "Performance – full talk",
      "url": null
    },
    {
      "description": "If you are a first time speaker, propose to speak at free community events which HasGeek will organize in your city. Run-up events will be held in Delhi, Mumbai, Pune, Indore, Coimbatore, Cochin, Chennai and Hyderabad.",
      "json_url": null,
      "name": "run-ups",
      "title": "Run-up event proposals",
      "url": null
    },
    {
      "description": "Half-day and full-day proposals for training front-end engineers and designers. Workshops will be held between October 2014 and February 2015.",
      "json_url": null,
      "name": "workshops",
      "title": "Workshops",
      "url": null
    }
  ],
  "space": {
    "bg_color": "",
    "bg_image": "",
    "datelocation": "16-17 April 2015, Bangalore",
    "end": "2015-04-18",
    "explore_url": "",
    "id": 29,
    "json_url": "https://metarefresh.talkfunnel.com/2015/json",
    "name": "2015",
    "start": "2015-04-15",
    "status": 3,
    "timezone": "Asia/Kolkata",
    "title": "Meta Refresh 2015",
    "url": "https://metarefresh.talkfunnel.com/2015/",
    "website": "https://metarefresh.in/"
  },
  "venues": [
    {
      "address1": "",
      "address2": "",
      "city": "",
      "country": "IN",
      "description": "",
      "json_url": null,
      "latitude": null,
      "longitude": null,
      "name": "mlr-convention-centre-jp-nagar",
      "postcode": "",
      "state": "",
      "title": "MLR Convention Centre, JP Nagar",
      "url": null
    }
  ]
}